Repository: cms-dev/cms
Catalog: cms/server/po/*.po
Languages: bs, et, it, lt, nl, ru

source: You don't get other %(type_pl)s.
bs: Nećete dobiti druge %(type_pl)s.
it: Non riceverai altri %(type_pl)s.
lt: Daugiau %(type_pl)s negausi.
nl: Je krijgt geen andere %(type_pl)s.
ru: У вас нет %(type_pl)s.

source: You can use a %(type_s)s every second
bs: Možete iskoristiti jedan %(type_s)s svaku %(min_interval)g sekundu
it: Puoi usare al massimo un %(type_s)s ogni secondo
lt: Gali naudoti %(type_s)s kartą per sekundę
nl: Je kan elke seconde een %(type_s)s gebruiken
ru: Вы можете использовать %(type_s)s каждую секунду

source: and no more than one %(type_s)s in total.
bs: a ne više od %(max_number)d %(type_pl)s ukupno.
it: e non più di un %(type_s)s in totale.
lt: ir ne daugiau nei vieną %(type_s)s iš viso.
nl: en niet meer dan één %(type_s)s in totaal.
ru: и не более одного %(type_s)s

source: You can use a %(type_s)s every second.
bs: Možete iskoristiti jedan %(type_s)s svaku %(min_interval)g sekundu
it: Puoi usare al massimo un %(type_s)s ogni secondo.
lt: Gali naudoti %(type_s)s kartą per sekundę.
nl: Je kan elke seconde een %(type_s)s gebruiken.
ru: Вы можете использовать %(type_s)s каждую секунду

source: You can use no more than one %(type_s)s in total.
bs: Ne možete koristiti više od %(max_number)d %(type_pl)s ukupno.
it: Non puoi usare più di un %(type_s)s in totale.
lt: Iš viso gali naudoti ne daugiau nei vieną %(type_s)s.
nl: Je kan niet meer dan één %(type_s)s in totaal gebruiken.
ru: Вы можете использовать не более одного %(type_s)s.

source: You have no limitations on how you use them.
bs: Nemate ograničenja na njihovu upotrebu.
it: Non hai limitazioni sul loro utilizzo.
lt: Neturi apribojimų jų naudojimui.
nl: Er zijn geen limieten qua gebruik.

source: Automatic (%s)
bs: Automatski (%s)
et: Automaatne (%s)
it: Automatica (%s)
lt: Automatiška (%s)
ru: Автоматически (%s)

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
bs: Prijavljen kao <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
et: Sisselogitud kasutaja: <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
it: Accesso effettuato come <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
lt: Prisijungta kaip <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
nl: Ingelogd als <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
ru: Вы: <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>

source: Logout
bs: Odjava
et: Logi välja
lt: Atsijungti
nl: Uitloggen
ru: Выход

source: Failed to log in.
bs: Prijava neuspješna.
et: Sisselogimine ebaõnnestus.
it: Accesso fallito.
lt: Prisijungti nepavyko.
nl: Login mislukt.
ru: Неудачный вход.

source: Welcome
bs: Dobro došli
et: Teretulemast
it: Benvenuto
lt: Sveiki atvykę
nl: Welkom
ru: Добро пожаловать.

source: Please log in
bs: Molimo prijavite se
et: Palun logi sisse
it: Sei pregato di fare login
lt: Prašome prisijungti
nl: Log in aub
ru: Пожалуйста авторизуйтесь

source: Username
bs: Korisničko ime
et: Kasutajatunnus
lt: Naudotojo vardas
nl: Gebruikersnaam
ru: Имя пользователя

source: Password
bs: Lozinka
et: Parool
lt: Slaptažodis
nl: Paswoord
ru: Пароль

source: Login
bs: Prijava
et: Logi sisse
lt: Prisijungti
ru: Вход

source: Reset
bs: Poništi
et: Lähtesta
lt: Atstatyti
ru: Очистить

source: New message
bs: Nova poruka
et: Uus sõnum
it: Nuovo messaggio
lt: Nauja žinutė
nl: Nieuw bericht
ru: Новое сообщение

source: New announcement
bs: Novo obavještenje
et: Uus teavitus
it: Nuovo annuncio
lt: Naujas pranešimas
nl: Nieuwe aankondiging
ru: Новое оповещение

source: New answer
bs: Novi odgovor
et: Uus vastus
it: Nuova risposta
lt: Naujas atsakymas
nl: Nieuw antwoord
ru: Новый ответ

source: %d unread
bs: %d nepročitanih
et: %d lugemata
it: %d nuovi
lt: %d neskaityti
nl: %d ongelezen
ru: %d непрочитанных

source: Until contest starts:
bs: Do početka takmičenja:
et: Võistluse algus on:
it: Fino a inizio gara:
lt: Iki varžybų pradžios:
nl: Totdat de wedstrijd start:
ru: До начала олимпиады:

source: Until contest ends:
bs: Do kraja takmičenja:
et: Võislus lõpp on
it: Fino a fine gara:
lt: Iki varžybų pabaigos:
nl: Totdat de wedstrijd eindigt:
ru: До конца олимпиады:

source: Time left:
bs: Preostalo vrijeme:
et: Aega jäänud:
it: Tempo rimanente:
lt: Likęs laikas:
nl: Tijd te gaan:
ru: Осталось:

source: Server time:
bs: Vrijeme na serveru:
et: Serveri kell:
it: Orario sul server:
lt: Serverio laikas:
nl: Server tijd:
ru: Время на сервере:

source: Overview
bs: Pregled
et: Ülevaade
it: Panoramica
lt: Apžvalga
nl: Overzicht
ru: Обзор

source: Communication
bs: Komunikacija
et: Teated
it: Comunicazioni
lt: Bendravimas
nl: Communicatie
ru: Объявления и вопросы к жюри

source: Statement
bs: Specifikacija
et: Ülesande tekst
it: Descrizione
lt: Sąlyga
nl: Opdracht
ru: Условие задачи

source: Submissions
bs: Prijave
et: Esitatud lahendused
it: Sottoposizioni
lt: Pateikti sprendimai
nl: Indieningen
ru: Отправки

source: Documentation
bs: Dokumentacija
et: Dokumentatsioon
it: Documentazione
lt: Dokumentacija
nl: Documentatie
ru: Документация

source: Testing
bs: Testiranje
et: Testimine
lt: Testavimas
nl: Testen
ru: Тестирование

source: Printing
lt: Spausdinimas

source: Contest Management System
et: Võistluste Korraldamise Süsteem
lt: Varžybų aptarnavimo sistema
nl: Wedstrijdbeheersysteem

source: is released under the
bs: je objavljen pod
et: kasutamine on lubatud vastavalt
it: è rilasciato sotto la
lt: yra išleista pagal
nl: is vrijgegeven onder de

source: Announcements
bs: Obavještenja
et: Teavitused
it: Annunci
lt: Pranešimai
nl: Aankondigingen
ru: Оповещения

source: (no subject)
bs: (bez teme)
et: (teemat ei ole)
it: (senza oggetto)
lt: (temos nėra)
nl: (geen onderwerp)
ru: (без темы)

source: Questions
bs: Pitanja
et: Küsimused
it: Domande
lt: Klausimai
nl: Vragen
ru: Вопросы

source: Subject
bs: Tema
et: Teema
it: Oggetto
lt: Tema
nl: Onderwerp
ru: Тема

source: Text
bs: Tekst
et: Tekst
it: Testo
lt: Tekstas
nl: Tekst
ru: Текст

source: Ask question
bs: Postavi pitanje
et: Esita küsimus
it: Poni la domanda
lt: Užduoti klausimą
nl: Stel een vraag
ru: Задать вопрос

source: no answer yet
bs: nema odgovora
et: küsimusele pole veel vastatud
it: nessuna risposta
lt: dar neatsakyta
nl: nog geen antwoord
ru: пока не отвечено

source: Messages
bs: Poruke
et: Sõnumid
it: Messaggi
lt: Žinutės
nl: Berichten
ru: Сообщения

source: Standard Template Library
lt: Standartinė šablonų biblioteka

source: Error %d
bs: Greška %d
it: Errore %d
lt: Klaida %d
nl: Fout %d
ru: Ошибка %d

source: An error occured while the server was handling your request.
bs: Došlo je do greške prilikom obrade vašeg zahtjeva od strane servera.
it: Si è verificato un errore nel server durante l'elaborazione della tua richiesta.
lt: Serveriui vykdant tavo užklausą įvyko klaida.
nl: Een fout trad op terwijl de server jouw aanvraag behandelde.
ru: Возникла ошибка вовремя обработки вашего запроса.

source: Note that attempts to tamper with Contest Management System (such as probing the server with customized URLs) may be considered cheating and may lead to disqualification.
bs: Pokušaji da se manipuliše Contest Management System (npr. isprobavajući različite nestandardne URLove) će se smatrati za varanje i mogu voditi do diskvalifikacije.
it: Ricorda che tentativi di compromissione di Contest Management System (come testare il server con URL personalizzati) potrebbero essere considerati infrazioni delle regole e potrebbero farti squalificare.
lt: Atkreipkite dėmesį, jog bandymas gadinti Varžybų aptarnavimo sistemą (pavyzdžiui, zonduoti serverį parinktais URL) gali būti būti palaikytas sukčiavimu, kas gali lemti diskvalifikaciją.
nl: Elke poging om het Wedstrijdbeheersysteem te beïnvloeden (zoals het sturen van gefabriceerde URLs naar de server) kan beschouwd worden als valsspelen en kan leiden tot uitsluiting van de wedstrijd.
ru: Обратите внимание, что попытки нарушить систему (такие как зондирование сервера пользовательскими URL) может быть расценено как списывание и привести к дисквалификации.

source: If you encountered this error during normal usage, please notify the contest administrators.
bs: Ako ste dobili ovu grešku tokom normalne upotrebe, molimo obavijestite administratore takmičenja.
it: Se questo errore si è verificato durante un uso normale sei pregato di notificare lo staff di gara.
lt: Jeigu šią klaidą gavote normaliai naudodamiesi sistema, prašome pranešti varžybų administratoriams.
nl: Als je deze fout tegenkomt bij normaal gebruik, verwittig dan de begeleiders van de wedstrijd.
ru: Если вы столкнулись с ошибкой системы во время нормального использования, просьба обратится к системным администраторам.

source: General information
bs: Opšte informacije
et: Üldinfo
it: Informazioni generali
lt: Bendra informacija
nl: Algemene informatie
ru: Общая информация

source: The contest hasn't started yet.
bs: Takmičenje još uvijek nije počelo.
et: Võistlus ei ole veel alanud.
it: La gara non è ancora iniziata.
lt: Varžybos dar neprasidėjo.
nl: De wedstrijd is nog niet gestart.
ru: Соревнование еще не началось.

source: The contest will start at %(start_time)s and will end at %(stop_time)s.
bs: Takmičenje će početi u %(start_time)s a završiće se u %(stop_time)s.
et: Võistluse algus on %(start_time)s, ja lõpp %(stop_time)s.
it: La gara inizierà alle %(start_time)s e terminerà alle %(stop_time)s.
lt: Varžybos prasidės %(start_time)s, o baigsis %(stop_time)s.
nl: De wedstrijd zal starten om %(start_time)s en eindigt om %(stop_time)s.
ru: Соревнование начнется в %(start_time)s и закончится в %(stop_time)s.

source: The contest is currently running.
bs: Takmičenje je trenutno u toku.
et: Võistlus käib.
it: La gara è in corso.
lt: Šiuo metu vyksta varžybos.
nl: De wedstrijd is momenteel bezig.
ru: Соревнование идет.

source: The contest started at %(start_time)s and will end at %(stop_time)s.
bs: Takmičenje je započelo u %(start_time)s a završiće se u %(stop_time)s.
et: Võistlus algas %(start_time)s ja lõpp on %(stop_time)s.
it: La gara è iniziata alle %(start_time)s e terminerà alle %(stop_time)s.
lt: Varžybos prasidėjo %(start_time)s, o baigsis %(stop_time)s.
nl: De wedstrijd is gestart om %(start_time)s en zal eindigen om %(stop_time)s.
ru: Соревнование началось в %(start_time)s и закончится в %(stop_time)s.

source: The contest has already ended.
bs: Takmičenje je već završeno.
et: Võistlus on juba lõppenud.
it: La gara è già terminata.
lt: Varžybos jau baigėsi.
nl: De wedstrijd is al geëindigd.
ru: Соревнование уже закончено.

source: The contest started at %(start_time)s and ended at %(stop_time)s.
bs: Takmičenje je započelo u %(start_time)s a završeno je u %(stop_time)s.
et: Võistluse algus %(start_time)s, lõpp %(stop_time)s.
it: La gara è iniziata alle %(start_time)s ed è terminata alle %(stop_time)s.
lt: Varžybos prasidėjo %(start_time)s, o baigsis %(stop_time)s.
nl: De wedstrijd startte om %(start_time)s en eindigde om %(stop_time)s.
ru: Соревнование началось в %(start_time)s и закончилось в %(stop_time)s.

source: You have an infinite number of tokens.
bs: Imate beskonačan broj tokena.
et: Sul on lõpmatu arv pileteid.
it: Hai un numero infinito di token.
lt: Turi begalinį žetonų skaičių.
ru: У вас неограниченное количество токенов.

source: You can see the detailed result of a submission by using a token on it.
bs: Možete vidjeti detaljne rezultate prijave tako što ćete iskoristiti token na njoj.
it: Puoi vedere i risultati dettagliati di una tua sottoposizione usando un token su di essa.
lt: Kiekvienam pateiktam sprendimui gali pažiūrėti jo detalius rezultatus panaudodamas žetoną.
ru: Вы можете посмотреть детальный результат отправки, использовав токен на ней.

source: Your score for each task will be the maximum among the tokened submissions and the last one.
bs: Vaš rezultat za svaki zadatak će biti maksimum svih tokenovanih prijava i posljednje prijave.
it: Il tuo punteggio su un problema sarà il massimo tra le sottoposizioni su cui hai usato i token e l'ultima che hai sottoposto.
lt: Tavo surinkti taškai bus maksimumas iš visų sprendimų, kuriems panaudojai žetoną, ir paskutinio sprendimo rezultato.
nl: Je score voor elke taak is het maximum van de indieningen waarvoor je een token hebt gebruikt en de laatste indiening samen.
ru: Ваш результат для каждого задания будет максимумом из всех отправок с использованным на них токеном и последней отправкой.

source: You have a distinct set of tokens for each task.
bs: Imate jedinstven skup tokena za svaki zadatak.
it: Hai dei token, distinti, per ogni problema.
lt: Kiekvienai užduočiai turi atskirą aibę žetonų.
nl: Je hebt een verzameling tokens beschikbaar voor elke taak.
ru: У вас есть определенный набор токенов на каждую задачу.

source: You can find the rules for the %(type_pl)s on each task's description page.
bs: Možete pronaći pravila za %(type_pl)s na stranici sa opisom svakog zadatka.
it: Puoi trovare le regole sull'utilizzo dei %(type_pl)s nella pagina di descrizione di ciascun problema.
lt: Kiekvienos užduoties aprašyme rasi %(type_pl)s taisykles.
ru: Вы можете найти правила для %(type_pl)s на странице каждого задания.

source: You have a set of tokens shared among all tasks.
bs: Imate skup tokena koji je dijeljen između svih zadataka.
it: Hai dei token, in comune, per tutti i problemi.
lt: Turi aibę žetonų, kuriuos gali naudoti bet kuriai iš užduočių.
nl: Je hebt een verzameling tokens die wordt gedeeld door alle taken.
ru: У вас есть множество токенов распределенным по всем заданиям.

source: You have two types of tokens: a set of <em>contest-tokens</em> shared among all tasks and a distinct set of <em>task-tokens</em> for each task.
bs: Imate dvije vrste tokena: skup <em>contest-tokens</em> dijeljen između svih zadataka i jedinstveni skup <em>task-tokens</em> za svaki zadatak.
it: Hai due tipi di token: i <em>token-gara</em>, in comune tra tutti i problemi, e i <em>token-problema</em>, distinti per ciascun problema.
lt: Turi dviejų rūšių žetonus: aibę <em>varžybų žetonų</em>, kuriuos gali naudoti bet kuriai iš užduočių, ir po aibę <em>užduoties žetonų</em> kiekvienai užduočiai atskirai.
nl: Er zijn twee types tokens: een verzameling <em>wedstrijd-tokens</em> gedeeld dooralle taken en een aparte verzameling <em>taak-tokens</em> voor elke taak.
ru: У вас имеются два типа токенов: набор <em>contest-token</em>, общий для всех задач, и наборы <em>task-token</em>, свои для каждой задачи.

source: You can see the detailed result of a submission by using two tokens on it, one of each type.
bs: Možete vidjeti detaljne rezultate prijave tako što ćete iskoristiti dva tokena na njoj, po jedan svake vrste.
it: Puoi vedere i risultati dettagliati di una tua sottoposizione usando due token su di essa, uno di entrambi i tipi.
lt: Kiekvienam pateiktam sprendimui gali pažiūrėti jo detalius rezultatus panaudodamas du žetonus: po vieną abiejų tipų žetoną.
nl: Je kan het gedetailleerde resultaat van een indiening bekijken door er twee tokens op te gebruiken, één van elk type.
ru: Вы сможете увидеть детальный результат отправки, используя на ней два токена, по одному каждого типа.

source: You can submit at most %(submissions)s solutions during this contest.
lt: Gali pateikti daugiausiai %(submission)s sprendimų šiame konkurse.

source: You can submit at most %(user_tests)s user tests during this contest.
lt: Gali pateikti daugiausiai %(user_tests)s naudotojo testų per šį konkursą.

source: Every user is allowed to compete (i.e. submit solutions) for a uninterrupted time frame of %(per_user_time)s.
bs: Svaki korisnik se može takmičiti (odnosno slati rješenja) tokom neprekinutog perioda od %(per_user_time)s.
it: Ogni utente può gareggiare (cioè sottoporre soluzioni) per un intervallo di tempo di %(per_user_time)s, senza interruzioni.
lt: Kiekvienas naudotojas gali varžytis (t. y. pateikti sprendimus) nenutrūkstamą %(per_user_time)s ilgio laiko tarpą.
nl: Elke gebruiker mag deelnemen (d.w.z. oplossingen indienen) gedurende een ononderbroken tijdsslot van %(per_user_time)s.
ru: Каждый пользователь может соревноваться (т.е. отправлять решения) в течение непрерывного отрезка времени %(per_user_time)s.

source: As soon as the contest starts you can choose to start your time frame.
bs: Čim takmičenje počne možete izabrati da počnete vaš period.
it: Non appena inizia la gara potrai scegliere di far iniziare il tuo intervallo di tempo.
lt: Kai tik prasidės varžybos, galėsi pasirinkti savo laiko tarpą.
nl: Zodra de wedstrijd start mag je kiezen om jouw tijdsslot te starten.
ru: Когда контест начнется, вы сможете запустить свое время.

source: Once you start, you can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
bs: Jednom kada počnete, možete slati rješenja do kraja vremenskog perioda ili do kraja takmičenja, šta god od to dvoje nastupi prvo.
it: Non appena inizi potrai sottoporre soluzioni fino alla fine del tuo intervallo di tempo oppure fino alla fine della gara, se quest'ultima avviene prima.
lt: Pradėjus spręsti, sprendimus pateikti galėsi iki savo laiko tarpo arba varžybų pabaigos – to, kas bus pirmiau.
nl: Eens je start, kan je oplossingen indienen tot aan het einde van het tijdsslot of het einde van de wedstrijd, welk ook eerst komt.
ru: Когда вы начнете, вы можете отправлять решения до конца вашего времени или конца контеста, в зависимости от того, что наступит раньше.

source: By clicking on the button below you can start your time frame.
bs: Klikom na dugme ispod možete započeti vaš vremenski period.
it: Cliccando sul pulsante qui sotto puoi far iniziare il tuo intervallo di tempo.
lt: Paspausdamas žemiau esantį mygtuką gali pradėti savo laiko tarpą.
nl: Door op de knop hieronder te klikken start je jouw tijdsslot.
ru: Нажав на кнопку ниже, вы начнете свой контест.

source: You started your time frame at %(start_time)s.
bs: Započeli ste vremenski period u %(start_time)s.
it: Il tuo intervallo di tempo è iniziato a %(start_time)s.
lt: Savo laiko tarpą pradėjai %(start_time)s.
nl: Je hebt jouw tijdsslot gestart om %(start_time)s.
ru: Вы начали свой контест в %(start_time)s.

source: You can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
bs: Možete slati rješenja do kraja vremenskog perioda ili do kraja takmičenja, šta god od to dvoje nastupi prvo.
it: Puoi sottoporre soluzioni fino alla fine del tuo intervallo di tempo oppure fino alla fine della gara, se quest'ultima avviene prima.
lt: Pateikti savo sprendimus gali iki savo laiko tarpo pabaigos arba iki varžybų pabaigos – to, kas bus pirmiau.
nl: Je kan oplossingen indienen tot aan het einde van het tijdsslot of tot het einde van de wedstrijd, welk ook eerst komt.
ru: Вы можете отправлять решения до конца вашего времени или конца контеста, в зависимости от того, что наступит раньше.

source: You started your time frame at %(start_time)s and you already finished it.
bs: Započeli ste svoj vremenski period u %(start_time)s te je on već istekao.
it: Il tuo intervallo di tempo è iniziato a %(start_time)s ed è già finito.
lt: Tavo laiko tarpas prasidėjo %(start_time)s ir jau baigėsi.
nl: Je hebt je tijdsslot gestart om %(start_time)s en je hebt het al beëindigd.
ru: Вы начали контест в %(start_time)s и он уже закончился.

source: There's nothing you can do now.
bs: Sada ne možete ništa uraditi.
it: Non c'è niente che tu possa fare adesso.
lt: Daugiau nieko nebegali daryti.
nl: Je kan nu niets meer doen.
ru: Вы ничего не можете сделать сейчас.

source: You never started your time frame. Now it's too late.
bs: Nikada niste započeli vaš vremenski period. No sada je prekasno.
it: Non hai mai fatto iniziare il tuo intervallo di tempo. Adesso è troppo tardi.
lt: Taip ir nepradėjai savo laiko tarpo, dabar jau vėlu.
nl: Je hebt jouw tijdsslot nooit gestart. Nu is het te laat.
ru: Вы не начинали контест. Теперь уже поздно.

source: Start!
bs: Počni!
it: Inizia!
lt: Pradėti!
ru: Старт!

source: Task overview
bs: Pregled zadatka
et: Ülesande info
it: Panoramica dei problemi
lt: Užduočių apžvalga
nl: Taak overzicht
ru: Обзор задачи

source: Task
bs: Zadatak
et: Ülesanne
it: Problema
lt: Užduotis
nl: Taak
ru: Задача

source: Name
bs: Ime
et: Nimi
it: Nome
lt: Pavadinimas
nl: Naam
ru: Имя

source: Time limit
bs: Vremensko ograničenje
et: Ajalimiit
it: Limite di tempo
lt: Laiko limitas
nl: Tijdslimiet
ru: Ограничение по времени

source: Memory limit
bs: Memorijsko ograničenje
et: Mälulimiit
it: Limite di memoria
lt: Atminties limitas
nl: Geheugenlimiet
ru: Ограничение по памяти

source: Type
bs: Vrsta
et: Tüübid
it: Tipo
lt: Tipas
ru: Тип

source: Files
bs: Datoteke
et: Failid
it: File
lt: Failai
nl: Bestanden
ru: Файлы

source: Tokens
bs: Tokeni
et: Piletid
it: Token
lt: Žetonai
ru: Токены

source: %(seconds)g second
bs: %(seconds)g sekundi
et: %(seconds)g s
it: %(seconds)g secondo
lt: %(seconds)g sek.
nl: %(seconds)g seconde
ru: %(seconds)g секунда

source: %(seconds)g seconds
bs: %(seconds)g sekundi
et: %(seconds)g s
it: %(seconds)g secondi
lt: %(seconds)g sek.
nl: %(seconds)g seconden
ru: %(seconds)g секунды

source: Yes
bs: Da
et: Jah
it: Sì
lt: Taip
nl: Ja
ru: Да

source: No
bs: Ne
et: Ei
lt: Ne
nl: Nee
ru: Нет

source: Print
lt: Spausdinti

source: You can print %(remaining_jobs)d more text or PDF files of up to %(max_pages)d pages each.
lt: Gali spausdinti dar %(remaining_jobs)d tekstinių arba PDF failų po ne daugiau nei %(max_pages)d puslapių.

source: You can print %(remaining_jobs)d more text files of up to %(max_pages)d pages each.
lt: Gali spausdinti dar %(remaining_jobs)d tekstinių failų po ne daugiau nei %(max_pages)d puslapių.

source: File (text or PDF)
lt: Failas (tekstinis arba PDF)

source: File (text)
lt: Failas (tekstinis)

source: Submit
bs: Pošalji
et: Esita
it: Sottoponi
lt: Pateikti
nl: Indienen
ru: Отправить

source: You cannot print anything any more as you have used up your printing quota.
lt: Daugiau spausdinti negali nes jau sunaudojai savo spausdinimo limitą.

source: Previous print jobs
lt: Ankstesni spausdinimo darbai

source: Date and time
bs: Datum i vrijeme
et: Kuupäev ja kellaaeg
it: Data e ora
lt: Data ir laikas
nl: Datum en tijd
ru: Дата и время

source: Time
bs: Vrijeme
et: Aeg
it: Ora
lt: Laikas
nl: Tijd
ru: Время

source: File name
lt: Failo vardas

source: Status
et: Olek
it: Stato
lt: Būsena
ru: Статус

source: no print jobs yet
lt: spausdinimo darbų dar nėra

source: Preparing...
lt: Paruošiama...

source: Compilation output
bs: Izlaz kompajlera
et: Kompilaatori väljund
it: Output della compilazione
lt: Kompiliavimo išvestis
nl: Compilatie output
ru: Вывод компиляции

source: Compilation outcome:
bs: Ishod kompajliranja:
et: Kompileerimise tulemus:
it: Esito della compilazione:
lt: Kompiliavimo rezultatas:
nl: Compilatie resultaat:
ru: Результат компиляции:

source: Compilation time:
bs: Vrijeme kompajliranja:
et: Kompileerimise aeg:
it: Tempo di compilazione:
lt: Kompiliavimo trukmė:
nl: Compilatie tijd:
ru: Время компиляции:

source: Memory used:
bs: Iskorištena memorija:
et: Mälukasutus:
it: Memoria utilizzata:
lt: Panaudota atminties:
nl: Geheugengebruik:
ru: Использование памяти:

source: Standard output
bs: Standardni izlaz
et: Standardväljund
lt: Standartinė išvestis
nl: Standaard output
ru: Стандартный поток вывода

source: Standard error
bs: Standardne greške
et: Veaväljund
lt: Standartinė klaidų išvestis
nl: Standaard error
ru: Стандартный поток ошибок

source: None
bs: Bez
it: Nessuno
lt: Nieko
nl: Geen
ru: Отсутсвует

source: Download
et: Allalaadimine
it: Scarica
lt: Atsisiųsti
ru: Скачать

source: Played
bs: Iskorišteno
it: Usato
lt: Panaudotas
nl: Afgespeeld
ru: Сыграно

source: Play!
bs: Iskoristi!
it: Usa!
lt: Naudoti!
nl: Spelen!
ru: Играть!

source: Wait...
bs: Čekaj...
et: Oota...
it: Aspetta...
lt: Laukite...
nl: Wachten...
ru: Подождите...
