Repository: cms-dev/cms
Catalog: cms/server/po/*.po
Languages: bs, et, it, lt, nl, ru

source: N/A
bs: Nedostupno
lt: Nėra
nl: Niet beschikbaar
ru: Н/Д

source: Compilation succeeded
bs: Kompajliranje uspješno
et: Kompileerimine õnnestus
it: Compilazione eseguita con successo
lt: Kompiliavimas sėkmingas
nl: Compilatie succesvol
ru: Успешная компиляция

source: Compilation failed
bs: Kompajliranje nije uspješno
et: Kompileerimine ebaõnnestus
it: Compilazione fallita
lt: Kompiliavimas nesėkmingas
nl: Compilatie mislukt
ru: Ошибка компиляции

source: Compilation timed out
bs: Kompajliranje je trajalo predugo
et: Kompileerimise ajalimiit ületatud
it: Compilazione interrotta perché fuori tempo massimo
lt: Kompiliavimas viršijo laiko ribojimą
nl: Compilatie time-out
ru: Превышено максимальное время компилирования

source: Compilation killed with signal %d (could be triggered by violating memory limits)
bs: Kompajliranje prekinuto signalom %d (možda je izazvano prekoračenjem dozvoljene memorije)
et: Kompileerimine katkes signaali %d tagajärjel (võib olla tingitud mälupiirangute ületamisest)
it: Compilazione interrotta con segnale %d (può essere dovuto ad una violazione dei limiti di memoria)
lt: Kompiliavimas nutrauktas signalu %d (tai galėjo įvykti viršijus atminties ribojimus)
nl: Compilatie afgebroken met signaal %d (mogelijk veroorzaakt door het schenden van geheugenlimieten)
ru: Компиляция завершилась с сигналом %d (это могло быть вызвано превышением ограничения по памяти)

source: Execution timed out
bs: Vrijeme za izvršavanje je isteklo
et: Programmi täitmise ajalimiit ületatud
it: Esecuzione terminata perché fuori tempo massimo
lt: Vykdymas viršijo laiko ribojimą
nl: Time-out bij uitvoering
ru: Превышено время выполнения

source: Execution killed with signal %d (could be triggered by violating memory limits)
bs: Izvršavanje prekinuto signalom %d (možda je izazvano prekoračenjem dozvoljene memorije)
et: Programmi täitmine katkes signaali %d tagajärjel (võib olla tingitud mälupiirangute ületamisest)
it: Esecuzione interrotta con segnale %d (può essere dovuto ad una violazione dei limiti di memoria)
lt: Vykdymas nutrauktas signalu %d (tai galėjo įvykti viršijus atminties ribojimus)
nl: Uitvoering afgebroken met signaal %d (mogelijk veroorzaakt door het schenden van geheugenlimieten)
ru: Выполнение завершилось с сигналом %d (это могло быть вызвано превышением ограничения по памяти)

source: Execution killed because of forbidden syscall %s
bs: Izvršenje prekinuto zbog nedozvoljenog sistemskog poziva %s
et: Programmi täitmine peatatud keelatud süsteemifunktsiooni %s kasutamise tõttu
it: Esecuzione terminata a causa di chiamata di sistema vietata %s
lt: Vykdymas nutrauktas dėl draudžiamo sisteminio iškvietimo %s
nl: Uitvoering afgebroken vanwege verboden syscall %s
ru: Выполнение прервано в связи использованием запрещенного системного вызова %s

source: Execution killed because of forbidden file access
bs: Izvršenje prekinuto zbog nedozvoljenog datotečnog pristupa
et: Programmi täitmine peatatud lubamatu failipöörduse tõttu
it: Esecuzione terminata a causa di accesso a file vietato
lt: Vykdymas nutrauktas dėl bandymo pasiekti draudžiamą failą
nl: Uitvoering afgebroken vanwege verboden bestandstoegang
ru: Выполнение прервано в связи с попыткой доступа к запрещенному файлу

source: Execution failed because the return code was nonzero
bs: Izvršenje nije uspjelo jer povratni kod nije bio nula
et: Programmi täitmine ebaõnnestus, nullist erinev veakood
it: Esecuzione fallita a causa di codice di ritorno diverso da zero
lt: Vykdymas nesėkmingas, nes grąžintas kodas buvo ne nulis
nl: Uitvoering mislukt omdat de return code niet nul was
ru: Выполнение завершилось неудачно

source: Output is correct
bs: Izlaz je ispravan
et: Väljund on korrektne
it: L'output è corretto
lt: Išvestis teisinga
ru: Правильный вывод

source: Output isn't correct
bs: Izlaz nije ispravan
et: Väljund ei ole korrektne
it: L'output non è corretto
lt: Išvestis neteisinga
nl: Output is niet correct
ru: Неправильный вывод

source: Evaluation didn't produce file %s
bs: Evaluacija nije proizvela datoteku %s
et: Programmi täitmisel ei tekkinud faili %s
it: La valutazione non ha prodotto il file %s
lt: Vykdymo metu nebuvo sukurtas failas %s
nl: Evaluatie produceerde niet het bestand %s
ru: Проверка не смогла создать файл %s

source: Subtask %d
bs: Podzadatak %d
et: Alamülesanne %d
lt: Dalinė užduotis %d
nl: Subtaak %d
ru: Подзадача %d

source: Outcome
bs: Ishod
et: Tulemus
it: Esito
lt: Rezultatas
nl: Uitkomst
ru: Результат

source: Details
bs: Detalji
et: Detailid
it: Dettagli
lt: Detalės
ru: Детали

source: Execution time
bs: Vrijeme izvršenja
et: Täitmise aeg
it: Tempo di esecuzione
lt: Vykdymo trukmė
nl: Uitvoeringstijd
ru: Время выполнения

source: Memory used
bs: Korištena memorija
et: Kasutatud mälu
it: Memoria utilizzata
lt: Atmintis
nl: Geheugengebruik
ru: Использованная память

source: Not correct
bs: Nije ispravno
et: Vale vastus
it: Non corretto
lt: Neteisingai
nl: Niet correct
ru: Не правильно

source: Correct
bs: Ispravno
et: Õige vastus
it: Corretto
lt: Teisingai
ru: Правильно

source: Partially correct
bs: Djelomično ispravno
et: Osaliselt õige vastus
it: Parzialmente corretto
lt: Dalinai teisingai
nl: Deels correct
ru: Частичное решение

source: Invalid files in submission
bs: Neispravne datoteke u prijavi
et: Lahendus sisaldab lubamatuid faile
it: File non validi nella sottoposizione
lt: Pateiktas netinkamas failas
nl: Ongeldige bestanden in indiening
ru: Отправлены недопустимые файлы

source: Execution completed successfully
bs: Izvršavanje uspješno završeno
et: Prorammmi täitmine õnnestus
it: Esecuzione completata con successo
lt: Vykdymas sėkmingas
ru: Выполнение успешно завершилось

source: No compilation needed
bs: Nije potrebno kompajliranje
et: Kompileerimine pole vajalik
it: Compilazione non necessaria
lt: Kompiliavimas nereikalingas
nl: Geen compilatie nodig
ru: Нет необходимости компилировать

source: File not submitted
bs: Datoteka nije poslana
et: Faili pole esitatud
it: File non sottoposto
lt: Failas nepateiktas
nl: Bestand niet ingediend
ru: Файл не отправлен

source: Question received
bs: Primljeno pitanje
et: Küsimus on vastuvõetud
it: Domanda ricevuta
lt: Klausimas gautas
nl: Vraag ontvangen
ru: Вопрос получен

source: Your question has been received, you will be notified when the it will be answered.
bs: Vaše pitanje je primljeno, bićete obaviješteni kada dobijete odgovor.
et: Teie küsimus on vastuvõetud, Teid teavitatakse, kui selle on vastatud.
it: La tua domanda è stata inviata, riceverai una notifica quando sarà risposta.
lt: Tavo klausimas gautas. Kai jis bus atsakytas, pasirodys pranešimas.
nl: Je vraag werd ontvangen, je zal worden verwittigd wanneer ze beantwoord is.
ru: Ваш вопрос принят, вы будете осведомлены когда на него ответят.

source: You have reached the maximum limit of at most %d submissions among all tasks.
bs: Dosegli ste gornju granicu od maksimalnih %d prijava za sve zadatke.
et: Te olete ületanud lahenduste esitamise kogulimiidi %d.
it: Hai raggiunto il limite massimo di %d sottoposizioni tra tutti i problemi.
lt: Pasiekei %d sprendimų pateikimo visoms užduotims limitą.
nl: Je hebt de limiet van maximum %d indieningen voor alle taken samen bereikt.
ru: Вы достигли максимального количества отправок по всем задачам, равного %d.

source: You have reached the maximum limit of at most %d submissions on this task.
bs: Dosegli ste gornju granicu od maksimalnih %d prijava za ovaj zadatak.
et: Te olete ületanud selle ülesande lahenduste esitamise limiidi (%d lahendust).
it: Hai raggiunto il limite massimo di %d sottoposizioni su questo problema.
lt: Pasiekei %d sprendimų pateikimo šiai užduočiai limitą.
nl: Je hebt de limiet van maximum %d indieningen voor deze taak bereikt.
ru: Вы достигли максимального количества отправок по этой задаче, равного %d.

source: Too many submissions!
bs: Previše prijava!
et: Liiga palju esitatud lahendusi!
it: Troppe sottoposizioni!
lt: Per daug sprendimų pateikimų!
nl: Te veel indieningen!
ru: Слишком много отправок!

source: Among all tasks, you can submit again after %d seconds from last submission.
bs: Za sve zadatke možete slati novu prijavu nakon %d sekundi od posljednje prijave.
it: Tra tutti i problemi, devi aspettare almeno %d secondi tra due sottoposizioni.
lt: Tarp visų užduočių, gali dar kartą pateikti sprendimą po %d sekundžių nuo praeito pateikimo.
nl: Voor alle taken samen, kan je opnieuw indienen na %d seconden na je laatste indiening.
ru: Вы можете отправлять решение по любой задаче спустя %d секунд после последней отправки.

source: For this task, you can submit again after %d seconds from last submission.
bs: Za ovaj zadatak možete slati novu prijavu nakon %d sekundi od posljednje prijave.
it: Su questo problema, devi aspettare almeno %d secondi tra due sottoposizioni.
lt: Šiai užduočiai dar kartą sprendimą gali pateikti po %d sekundžių nuo paskutinio pateikimo.
nl: Voor deze taak kan je opnieuw indienen na %d seconden na je laatste indiening.
ru: Вы можете отправлять решение этой задачи спустя %d секунд после последней отправки.

source: Submissions too frequent!
bs: Previše česte prijave!
et: Lahenduste esitamine on liiga sage!
it: Sottoposizioni troppo frequenti!
lt: Per dažni pateikimai!
nl: Je dient te frequent in!
ru: Слишком частые отправки!

source: Invalid submission format!
bs: Neispravan format prijave!
et: Esiatud lahenduse vorming on vale!
it: Formato sottoposizione invalido!
lt: Netinkamas pateikimo formatas!
nl: Ongeldig formaat voor indiening!
ru: Неправильный формат файла

source: Please select the correct files.
bs: Molimo izaberite korektne datoteke.
et: Palun valige õiged failid.
it: Seleziona i file corretti.
lt: Pasirinkite teisingus failus.
nl: Selecteer de correcte bestanden aub.
ru: Пожалуйста выберите правильные файлы.

source: Invalid archive format!
bs: Neispravan format arhive!
et: Vigases vormingus arhiiv!
it: Formato archivio invalido!
lt: Netinkamas archyvo formatas!
nl: Ongeldig formaat voor archief!
ru: Недопустимый формат архива!

source: The submitted archive could not be opened.
bs: Poslana arhiva se nije mogla otvoriti.
et: Esitatud arhiivi ei õnnestu avada.
it: Impossibile aprire l'archivio sottoposto.
lt: Nepavyksta atverti pateikto archyvo.
nl: Het ingediende archief kon niet worden geopend.
ru: Отправленый архив не открывается.

source: Cannot recognize submission's language.
bs: Ne mogu prepoznati jezik prijave.
et: Lahenduse programmeerimiskeel on tundmatu.
it: Impossibile riconoscere il linguaggio della sottoposizione
lt: Nepavyksta atpažinti pateikto sprendimo kalbos.
nl: De taal van de indiening kan niet worden herkend.
ru: Невозможно определить язык отправки.

source: All sources must be in the same language.
bs: Sve izvorne datoteke moraju biti u istom jeziku.
et: Kogu lähtetekst peab olema samas programmeerimiskeeles.
it: Tutti i sorgenti devono essere nello stesso linguaggio.
lt: Visi pirminiai programos tekstai turi būti ta pačia kalba.
nl: Alle bronbestanden moeten in dezelfde taal zijn.
ru: Все исходники должны быть написаны на одном языке.

source: Language %s not allowed in this contest.
bs: Jezik %s nije dozvoljen na ovom takmičenju.
et: Programmeerimiskeele %s kasutamine ei ole sellel võistlusel lubatud.
it: Il linguaggio %s non è consentito in questa gara.
lt: Kalba %s nėra leidžiama šiose varžybose.
ru: Язык %s не разрешен на этом соревновании.

source: Invalid submission!
bs: Neispravna prijava!
et: Esitatud lahendus on vigane!
it: Sottoposizione invalida!
lt: Netinkamas pateiktas sprendimas!
nl: Ongeldige indiening!
ru: Неправильная отправка!

source: Submission too big!
bs: Prijava prevelika!
et: Esitatud lahendus on liiga suur!
it: Sottoposizione troppo grande!
lt: Pateiktas sprendimas per didelis!
nl: Indiening te groot!
ru: Файл слишком большой!

source: Each source file must be at most %d bytes long.
bs: Svaka izvorna datoteka može biti velika najviše %d bajta.
et: Iga lähteteksti fail võib olla ülimalt %d baiti pikk.
it: Ogni file sorgente deve essere grande al massimo %d byte.
lt: Kiekvienas pirminio teksto failas turi būti nedidesnis už %d baitų.
nl: Elk bronbestand mag maximaal %d bytes lang zijn.
ru: Каждый файл не должен превышать %d байт.

source: Submission storage failed!
bs: Smještaj prijave neuspješan!
et: Esitatud lahenduse salvestamine ebaõnnestus!
it: Errore nel salvataggio della sottoposizione!
lt: Nepavyko išsaugoti pateikto sprendimo!
nl: Opslag van indiening mislukt!
ru: Не удалось сохранить отправку!

source: Please try again.
bs: Molimo pokušajte ponovo.
et: Palun proovige uuesti.
it: Riprova.
lt: Bandyk dar kartą.
nl: Probeer opnieuw aub.
ru: Пожалуйста, попробуйте еще раз.

source: Submission received
bs: Primljena prijava
et: Lahendus on vastuvõetud
it: Sottoposizione ricevuta
lt: Sprendimas gautas
nl: Indiening ontvangen
ru: Отправка принята

source: Your submission has been received and is currently being evaluated.
bs: Vaša prijava je primljena i trenutno se evaluira.
et: Lahendus on vastuvõetud ja on testimisel.
it: La tua sottoposizione è stata ricevuta e verrà valutata.
lt: Tavo sprendimas gautas ir šiuo metu yra vertinamas.
nl: Je indiening werd ontvangen en wordt momenteel geëvalueerd.
ru: Ваша задача принята и сейчас оценивается.

source: Token request discarded
bs: Zahtjev za tokenom odbijen
et: Pileti tellimus tühistatud
it: Richiesta del token rifiutata
lt: Žetono užklausa atmesta
nl: Aanvraag token afgewezen
ru: Запрос токена отклонен

source: Your request has been discarded because you have no tokens available.
bs: Vaš zahtjev je odbijen jer nemate više slobodnih tokena.
et: Päring on tühistatud, kuna pole piletit.
it: La tua richiesta è stata rifiutata perché non hai token disponibili.
lt: Tavo užklausa atmesta, kadangi neturi žetonų.
nl: Je aanvraag werd afgewezen omdat je geen tokens beschikbaar hebt.
ru: Ваш запрос отклонен потому что у вас нет доступных токенов.

source: Your request has been discarded because you already used a token on that submission.
bs: Vaš zahtjev je odbijen jer ste već iskoristili token na toj prijavi.
et: Päring on tühistatud, kuna selle jaoks on juba piletit kasutatud.
it: La tua richiesta è stata rifiutata perché hai già usato un token su questa sottoposizione.
lt: Užklausa buvo atmesta, kadangi šiam sprendimui žetoną jau naudojai.
nl: Je aanvraag werd afgewezen omdat je reeds een token gebruikte voor deze indiening.
ru: Ваш запрос был отклонен потому что вы уже использовали токен на этой отправке.

source: Token request received
bs: Primljen zahtjev za tokenom
et: Pileti tellimus vastuvõetud
it: Richiesta del token ricevuta
lt: Žetono užklausa gauta
nl: Aanvraag token ontvangen
ru: Запрос токена получен

source: Your request has been received and applied to the submission.
bs: Vaš zahtjev je primljen i primijenjen na prijavu.
it: La tua richiesta è stata ricevuta e applicata alla sottoposizione.
lt: Tavo užklausa gauta ir įvykdyta pateiktam sprendimui.
nl: Je aanvraag werd ontvangen en wordt toegepast op de indiening.
ru: Ваш запрос был получен и применен к отправке.

source: Compiling...
bs: Kompajliram...
et: Kompileerimine...
it: Compilazione in corso...
lt: Kompiliuojama...
nl: Bezig met compileren...
ru: Компиляция...

source: details
bs: detalji
et: detailvaade
it: dettagli
lt: išsamiai
ru: детали

source: Evaluating...
bs: Evaluiram...
et: Testimine...
it: Valutazione in corso...
lt: Vertinama...
nl: Bezig met evalueren...
ru: Проверка...

source: Scoring...
bs: Bodujem...
et: Punktide andmine...
it: Assegnazione del punteggio in corso...
lt: Skaičiuojami taškai...
nl: Bezig met punten geven...
ru: Оценивание...

source: Evaluated
bs: Evaluirano
et: Testitud
it: Valutato
lt: Įvertinta
nl: Geëvalueerd
ru: Проверено

source: You have reached the maximum limit of at most %d tests among all tasks.
bs: Dosegli ste gornju granicu od maksimalnih %d testova za sve zadatke.
it: Hai raggiunto il limite massimo di %d test tra tutti i problemi.
lt: Pasiekei %d testų visoms užduotims limitą.
nl: Je hebt de limiet van maximaal %d tests voor alle taken samen bereikt.
ru: Вы достигли лимита тестирования на всех задачах, равного %d тестам.

source: You have reached the maximum limit of at most %d tests on this task.
bs: Dosegli ste gornju granicu od maksimalnih %d testova za ovaj zadatak.
it: Hai raggiunto il limite massimo di %d test su questo problema.
lt: Pasiekei %d testų limitą šiai užduočiai.
nl: Je hebt de limiet van maximaal %d tests voor deze taak bereikt.
ru: Вы достигли лимита тестирования на этой задаче, равного %d тестам.

source: Too many tests!
bs: Previše testova!
et: Liiga palju teste!
it: Troppi test!
lt: Per daug testų!
nl: Te veel tests!
ru: Слишком много тестов!

source: Among all tasks, you can test again after %d seconds from last test.
bs: Za sve zadatke možete ponovo testirati nakon %d sekundi od posljednjeg testa.
it: Tra tutti i problemi, devi aspettare almeno %d secondi tra due test.
lt: Tarp visų užduočių dar kartą galėsi testuoti praėjus %d sekundžių nuo paskutinio testavimo.
nl: Voor alle taken samen, kan je opnieuw testen na %d seconden na de laatste test.
ru: Для всех задач, вы можете тестировать только после %d секунд после последнего тестирования.

source: For this task, you can test again after %d seconds from last test.
bs: Za ovaj zadatak možete ponovo testirati nakon %d sekundi od posljednjeg testa.
it: Su questo problema, devi aspettare almeno %d secondi tra due test.
lt: Šiai užduočiai dar kartą testuoti galima praėjus %d sekundžių nuo paskutinio testavimo
nl: Voor deze taak, kan je opnieuw testen na %d seconden na de laatste test.
ru: Для этой задачи, вы можете тестировать только после %d секунд после последнего тестирования.

source: Tests too frequent!
bs: Previše česti testovi!
et: Testimine on liiga sage!
it: Test troppo frequenti!
lt: Per dažnas testavimas!
nl: Je test te frequent!
ru: Слишком частое тестирование!

source: Invalid test format!
bs: Neispravan format testa!
et: Vigane testi vorming!
it: Formato test invalido!
lt: Netinkamas testo formatas!
nl: Ongeldig test formaat!
ru: Неправильный формат теста!

source: Cannot recognize test's language.
bs: Ne mogu prepoznati jezik testa.
it: Impossibile riconoscere il linguaggio del test
lt: Nepavyko atpažinti testo kalbos.
nl: Kan de taal van de test niet herkennen.
ru: Невозможно распознать язык теста.

source: Invalid test!
bs: Neispravan test!
et: Vigane test!
it: Test invalido!
lt: Netinkamas testas!
nl: Ongeldige test!
ru: Недопустимый тест!

source: Test too big!
bs: Test je prevelik!
et: Test on liiga suur!
it: Test troppo grande!
lt: Testas per didelis!
nl: Test te groot!
ru: Тест слишком большой!

source: Input too big!
bs: Ulaz je prevelik!
et: Sisend on liiga suur!
it: Input troppo grande!
lt: Įvestis per didelė!
nl: Input te groot!
ru: Входной файл слишком большой!

source: The input file must be at most %d bytes long.
bs: Ulazna datoteka može biti velika najviše %d bajta.
et: Sisendfaili suurus võib olla kuni %d baiti.
it: Il file di input deve essere grande al massimo %d byte.
lt: Įvesties failas turi neviršyti %d baitų.
nl: Het inputbestand mag maximaal %d bytes lang zijn.
ru: Входной файл должен должен содержать максимум %d байт.

source: Test storage failed!
bs: Smještaj testa neuspješan!
et: Testi salvestamine ebaõnnestus!
it: Errore nel salvataggio del test!
lt: Nepavyko išsaugoti testo!
nl: Kon de test niet opslaan!
ru: Сохранение теста неудачно!

source: Test received
bs: Test primljen
et: Test vastuvõetud
it: Test ricevuto
lt: Testas gautas
nl: Test ontvangen
ru: Тест принят

source: Your test has been received and is currently being executed.
bs: Vaš test je primljen i trenutno se izvršava.
et: Test on vastuvõetud ja see käivitatakse.
it: Il tuo test è stato ricevuto e verrà valutato.
lt: Tavo testas gautas ir šiuo metu yra vykdomas.
nl: Je test werd ontvangen en wordt momenteel uitgevoerd.
ru: Ваш тест был принят и сейчас выполняется.

source: Executing...
bs: Izvršavam...
et: Testimine...
it: Esecuzione in corso...
lt: Vykdoma...
nl: Bezig met uitvoeren...
ru: Выполнение...

source: Executed
bs: Izvršeno
et: Käivitatud
it: Eseguito
lt: Įvykdyta
nl: Uitgevoerd
ru: Выполнено

source: %(seconds)0.3f s
lt: %(seconds)0.3f sek.
ru: %(seconds)0.3f с

source: Too many print jobs!
lt: Per daug spausdinimo darbų!

source: You have reached the maximum limit of at most %d print jobs.
lt: Pasiekei %d testų limitą spausdinamų darbų skaičiui.

source: Invalid format!
lt: Netinkamas formatas!

source: File too big!
lt: Failas per didelis!

source: Each file must be at most %d bytes long.
lt: Kiekvienas failas turi būti ne didesnis nei %d baitų.

source: Print job storage failed!
lt: Nepavyko išsaugoti spausdinimo darbo!

source: Print job received
lt: Spausdinimo darbas gautas

source: Your print job has been received.
lt: Tavo spausdinimo darbas gautas.

source: loading...
bs: učitavam...
et: laadimine...
it: caricamento in corso...
lt: kraunama...
ru: загрузка...

source: %d second
bs: %d sekunda
et: %d sekund
it: %d secondo
lt: %d sekundė
nl: %d seconde
ru: %d секунда

source: %d minute
bs: %d minuta
et: %d minut
it: %d minuto
lt: %d minutė
nl: %d minuut
ru: %d минута

source: %d hour
bs: %d sat
et: %d tund
it: %d ora
lt: %d valanda
nl: %d uur
ru: %d час

source: %d day
bs: %d dan
et: %d päev
it: %d giorno
lt: %d diena
nl: %d dag
ru: %d день

source: %s and %s
bs: %s i %s
et: %s ja %s
it: %s e %s
lt: %s ir %s
nl: %s en %s
ru: %s и %s

source: more than %s
bs: više od %s
et: rohkem kui %s
it: più di %s
lt: daugiau nei %s
nl: meer dan %s
ru: больше чем %s

source: contest-token
et: võistluse pilet
lt: varžybų žetoną
nl: wedstrijd-token

source: contest-tokens
it: contest-token
lt: varžybų žetonų
nl: wedstrijd-tokens

source: task-token
et: ülesande pilet
lt: užduoties žetoną
nl: taak-token

source: task-tokens
it: task-token
lt: užduoties žetonų
nl: taak-tokens
ru: task-token

source: token
et: pilet
lt: žetoną
ru: токен

source: tokens
it: token
lt: žetonų
ru: токены

source: You don't have %(type_pl)s available for this task.
bs: Nemate %(type_pl)s dostupnih za ovaj zadatak.
it: Non hai %(type_pl)s disponibili per questo problema.
lt: Tu neturi %(type_pl)s šiai užduočiai.
nl: Je hebt geen %(type_pl)s beschikbaar voor deze taak.
ru: Для этой задачи у вас нет %(type_pl)s.

source: You have an infinite number of %(type_pl)s for this task.
bs: Imate beskonačan broj %(type_pl)s za ovaj zadatak.
it: Hai un numero infinito di %(type_pl)s per questo problema.
lt: Turi neribotą %(type_pl)s skaičių.
ru: Для этой задачи у вас неограниченное количество %(type_pl)s.

source: You start with no %(type_pl)s.
bs: Počinjete bez %(type_s)s.
it: All'inizio hai zero %(type_pl)s.
lt: Pradedi be %(type_pl)s.
nl: Je start zonder %(type_pl)s.
ru: Вы начинаете без %(type_pl)s.

source: You start with one %(type_s)s.
bs: Počinjete sa %(gen_initial)d %(type_pl)s.
it: All'inizio hai un %(type_s)s.
lt: Pradžioje turi vieną %(type_s)s.
nl: Je start met één %(type_s)s.
ru: Вы начинаете с одного %(type_s)s.

source: Every minute
bs: Svaku %(gen_interval)g minutu
it: Ogni minuto
lt: Kas minutę
nl: Elke minuut
ru: Каждую минуту

source: you get another %(type_s)s,
bs: dobićete %(gen_number)d drugih %(type_pl)s,
it: riceverai un altro %(type_s)s,
lt: gausi po vieną %(type_s)s,
nl: krijg je nog een %(type_s)s,
ru: вы получаете %(type_s)s,

source: up to a maximum of one %(type_s)s.
bs: do maksimalnih %(gen_max)d %(type_pl)s.
it: fino ad un massimo di un %(type_s)s.
lt: kol pasieksi vieną %(type_s)s.
nl: tot een maximum van een %(type_s)s.
ru: до максимально одного %(type_s)s

source: you get another %(type_s)s.
bs: dobićete %(gen_number)d drugih %(type_pl)s,
it: riceverai un altro %(type_s)s.
lt: gausi po vieną %(type_s)s.
nl: krijg je nog een %(type_s)s.
ru: вы получаете %(type_s)s.
