Repository: cms-dev/cms
Catalog: cms/server/po/*.po
Languages: bs, et, it, lt, nl, ru

source: No tokens
bs: Nema tokena
et: Pileteid pole
it: Nessun token
lt: Žetonų nėra
nl: Geen tokens
ru: Нет токенов

source: %(name)s (%(short_name)s) <small>description</small>
bs: %(name)s (%(short_name)s) <small>opis</small>
et: %(name)s (%(short_name)s) <small>kirjeldus</small>
it: %(name)s (%(short_name)s) <small>descrizione</small>
lt: %(name)s (%(short_name)s) <small>aprašymas</small>
nl: %(name)s (%(short_name)s) <small>beschrijving</small>
ru: %(name)s (%(short_name)s) <small>описание</small>

source: no statement available
bs: nije dostupna specifikacija
et: ülesande teksti pole
it: nessun testo disponibile
lt: sąlygos nėra
nl: geen omschrijving beschikbaar
ru: нет условия

source: Download task statement
bs: Preuzmi specifikaciju zadatka
et: Laadi ülesande tekst
it: Scarica il testo del problema
lt: Atsisiųsti užduoties sąlygą
nl: Download de taakbeschrijving
ru: Скачать текст условия

source: The statement for this task is available in multiple versions, in different languages.
bs: Specifikacija za ovaj zadatak je dostupna u više verzija, u raznim jezicima.
et: Selle ülesande tekstist on saadaval mitu versiooni, erinevates keeltes.
it: La descrizione di questo problema è disponibile in molte versioni, in diverse lingue.
lt: Šios užduoties sąlyga galima keliomis versijomis skirtingomis kalbomis.
nl: De beschrijving van deze taak is beschikbaar in verschillende versies, in verschillende talen.
ru: Условие этой задачи доступно на нескольких языках.

source: You can see (and download) all of them using the list on the right.
bs: Možete ih vidjeti (i preuzeti) koristeći listu s desne strane.
it: Puoi vederle (e scaricarle) tutte usando la lista sulla destra.
lt: Visas jas peržiūrėti (ir atsisiųsti) gali sąraše dešinėje.
nl: Je kan ze allemaal zien (en downloaden) in de lijst aan de rechterkant.
ru: Вы можете посмотреть (и скачать) любой перевод, используя список справа.

source: Some suggested translations follow.
bs: Ispod su neki predloženi prevodi.
it: Seguono alcuni testi suggeriti.
lt: Toliau pateikiami siūlomi vertimai.
nl: Wij raden de volgende vertalingen aan.
ru: Некоторые переводы.

source: Statement in <b>%s</b>
bs: Specifikacija u <b>%s</b>
it: Testo in <b>%s</b>
lt: Sąlyga <b>%s</b> kalba
nl: Beschrijving in <b>%s</b>
ru: Условие на <b>%s</b>

source: Statement in %s
bs: Specifikacija u %s
it: Testo in %s
lt: Sąlyga %s kalba
nl: Beschrijving in %s
ru: Условие на %s

source: Some details
bs: Neki detalji
et: Üksikasjad
it: Alcuni dettagli
lt: Detalės
nl: Enkele details
ru: Некоторые детали

source: Compilation commands
bs: Naredbe kompajlera
et: Kompileerimise käsurida
it: Comandi di compilazione
lt: Kompiliavimo komandos
nl: Commando's voor compilatie
ru: Команды компиляции

source: You can find the rules for the %(type_pl)s on the <a href="%(url_root)s/">contest overview page</a>.
bs: Možete pronaći pravila za %(type_pl)s na <a href="%(url_root)s/">stranici pregleda takmičenja</a>.
it: Puoi trovare le regole per i %(type_pl)s nella <a href="%(url_root)s/">pagina di panormica della gara</a>.
lt: <a href="%(url_root)s/">Varžybų apžvalgos puslapyje</a> rasi %(type_pl)s taisykles.
ru: Вы можете найти правила для %(type_pl)s на <a href="%(url_root)s/">странице информации о контесте</a>.

source: Remeber that to see the detailed result of a submission you need to use both a contest-token and a task-token.
bs: Zapamtite da ne možete vidjeti detaljan rezultat prijave osim ako iskoristite i contest-token i task-token.
it: Ricorda che per vedere i risultati dettagliati di una sottoposizione devi usare sia un token-gara che un token-problema.
lt: Nepamiršk, jog norėdamas pamatyti detalius pateikto sprendimo rezultatus turi panaudoti ir varžybų, ir užduoties žetoną.
nl: Onthoud dat je voor het bekijken van een gedetailleerd resultaat van een indiening, zowel een wedstrijd-token als een taak-token moet gebruiken.
ru: Помните, что для того, чтобы увидеть детальный результат отправки, вам необходимо использовать как contest-token, так и task-token для этой задачи.

source: Attachments
bs: Prilozi
et: Manused
it: Allegati
lt: Priedai
nl: Bijlagen
ru: Прикрепленные файлы

source: %(name)s (%(short_name)s) <small>submissions</small>
bs: %(name)s (%(short_name)s) <small>prijave</small>
et: %(name)s (%(short_name)s) <small>esitatud lahendused</small>
it: %(name)s (%(short_name)s) <small>sottoposizioni</small>
lt: %(name)s (%(short_name)s) <small>sprendimų pateikimas</small>
nl: %(name)s (%(short_name)s) <small>indieningen</small>
ru: %(name)s (%(short_name)s) <small>отправки</small>

source: Submit a solution
bs: Pošalji rješenje
et: Esita lahendus
it: Sottoponi una soluzione
lt: Pateikti sprendimą
nl: Dien een oplossing in
ru: Отправить решение

source: You can submit %(submissions_left)s more solution(s).
lt: Gali pateikti dar %(submissions_left)s sprendimą(-ų).

source: submission.zip
bs: prijava.zip
et: lahendus.zip
it: sottoposizione.zip
lt: sprendimas.zip
nl: indiening.zip

source: Previous submissions
bs: Prethodne prijave
et: Eelmised esitatud lahendused
it: Sottoposizioni precedenti
lt: Anksčiau pateikti sprendimai
nl: Vorige indieningen
ru: Предыдущие отправки

source: Right now, you have infinite tokens available on this task.
bs: Trenutno imate beskonačno mnogo tokena za ovaj zadatak.
et: Praegu on sul selle ülesande lahenduste esitamiseks piiramatult pileteid.
it: In questo momento hai infiniti token disponibili per questo problema.
lt: Šiuo metu šiai užduočiai turi be galo daug žetonų.
nl: Momenteel heb je oneindig veel tokens beschikbaar voor deze taak.
ru: Сейчас у вас неограниченное количество токенов для этой задачи.

source: Right now, you have one token available on this task.
bs: Trenutno imate jedan token za ovaj zadatak.
et: Praegu on sul selle ülesande lahenduste esitamiseks üks pilet.
it: In questo momento hai un token disponibile per questo problema.
lt: Šiuo metu šiai užduočiai turi vieną žetoną.
nl: Momenteel heb je één token beschikbaar voor deze taak.
ru: Сейчас у вас один токен для этой задачи.

source: Right now, you have %(tokens)s tokens available on this task.
bs: Trenutno imate %(tokens)s tokena za ovaj zadatak.
et: Praegu on sul selle ülesande lahenduste esitamiseks %(tokens)s pilet.
it: In questo momento, hai %(tokens)s token disponibili per questo problema.
lt: Šiuo metu šiai užduočiai turi %(tokens)s žetonus(-ų).
nl: Momenteel heb je %(tokens)s tokens beschikbaar voor deze taak.
ru: Сейчас у вас %(tokens)s токенов для этой задачи.

source: But you have to wait until %(expiration_time)s to use them.
bs: Ali morate sačekati do %(expiration_time)s da biste ih koristili.
et: Sa pead ootama kuni %(expiration_time)s et neid kasutada.
it: Ma dovrai aspettare fino alle %(expiration_time)s per usarli.
lt: Tačiau jų negali naudoti iki %(expiration_time)s.
nl: Maar je moet wachten tot %(expiration_time)s voordat je ze kunt gebruiken.
ru: Но вы сможете использовать их только %(expiration_time)s.

source: You will receive a new token at %(gen_time)s.
bs: Primićete novi token u %(gen_time)s.
et: Sa saad uue pileti kell: %(gen_time)s.
it: Riceverai un nuovo token alle %(gen_time)s.
lt: Naują žetoną gausi %(gen_time)s.
nl: Je krijgt een nieuw token om %(gen_time)s.
ru: Вы получите новый токен в %(gen_time)s.

source: In the current situation, no more tokens will be generated.
bs: U trenutnoj situaciji neće biti generisano više tokena.
et: Praeguses olukorras uusi pileteid ei anta.
it: Nella situazione attuale, nessun nuovo token verrà generato.
lt: Esant dabartinei situacijai, žetonai generuojami nebebus.
nl: Wegens omstandigheden worden er geen tokens meer gegenereerd.
ru: В текущей ситуации токены больше не будут генерироваться.

source: Right now, you do not have tokens available for this task.
bs: Trenutno nemate nijedan token za ovaj zadatak.
et: Praegu pole sul selle ülesande esitamiseks pileteid.
it: In questo momento, non hai token disponibili per questo problema.
lt: Šiuo metu neturi žetonų šiam uždaviniui.
nl: Momenteel heb je geen tokens meer beschikbaar voor deze taak.
ru: Сейчас у вас нет свободных токенов для этой задачи.

source: But you will have to wait until %(expiration_time)s to use it.
bs: Ali morate sačekati do %(expiration_time)s da biste ih koristili.
et: Sa pead ootama kuni %(expiration_time)s, et seda kasutada.
it: Ma dovrai aspettare fino alle %(expiration_time)s per usarlo.
lt: Tačiau turi palaukti iki %(expiration_time)s, kad galėtum jį naudoti.
nl: Maar je zal moeten wachten tot %(expiration_time)s om het te gebruiken.
ru: Но вы сможете использовать его только %(expiration_time)s.

source: Public score
bs: Javni bodovi
et: Avalikud punktid
it: Punteggio pubblico
lt: Vieši taškai
nl: Publieke score
ru: Открытый результат

source: Total score
bs: Ukupni bodovi
et: Punktid kokku
it: Punteggio totale
lt: Visi taškai
nl: Totaalscore
ru: Результат

source: Score
bs: Bodovi
et: Punktid
it: Punteggio
lt: Taškai
ru: Очки

source: Token
et: Pilet
lt: Žetonas
ru: Токен

source: no submissions yet
bs: još uvijek nema prijava
et: lahendusi pole veel esitatud
it: nessuna sottoposizione
lt: pateiktų sprendimų dar nėra
nl: nog geen indieningen
ru: нет отправок

source: Submission details
bs: Detalji prijave
et: Esitatud lahenduse andmed
it: Dettagli della sottoposizione
lt: Pateikto sprendimo detalės
nl: Details van de indiening
ru: Детали отправки

source: Close
bs: Zatvori
et: Sulge
it: Chiudi
lt: Uždaryti
nl: Sluiten
ru: Закрыть

source: Submit a test
bs: Pošalji test
et: Sisesta test
it: Sottoponi un test
lt: Pateikti testą
nl: Dien een test in
ru: Отправить тест

source: You can submit %(user_tests_left)s more test(s).
lt: Gali pateitki dar %(user_tests_left)s testą(-ų).

source: input
bs: ulaz
et: sisend
lt: įvestis
ru: входные данные

source: Previous tests
bs: Prethodni testovi
et: Eelmised testid
it: Test precedenti
lt: ankstesni testai
nl: Vorige tests
ru: Предыдущие тесты

source: Input
bs: Ulaz
et: Sisend
lt: Įvestis
ru: Входные данные

source: Output
bs: Izlaz
et: Väljund
lt: Išvestis
ru: Вывод

source: no tests yet
bs: još uvijek nema testova
et: teste ei ole
it: nessun test
lt: testų dar nėra
nl: nog geen tests
ru: нет тестов

source: Test details
bs: Detalji testa
et: Testi andmed
it: Dettagli del test
lt: Testo detalės
nl: Details van de test
ru: Детали теста

source: Evaluation outcome
bs: Ishod evaluacije
et: Testimise tulemus
it: Valutazione
lt: Vertinimo išeiga
nl: Resultaat van de evaluatie
ru: Результат проверки

source: You have infinite %(type_pl)s.
nl: Je hebt oneindig veel %(type_pl)s.

source: You have an infinite set of tokens.
nl: Je hebt een oneindige voorraad tokens.

source: You can use one of these tokens to see the detailed result of a submission.
nl: Je kan een van deze tokens gebruiken om het gedetailleerd resultaat van een indiening te bekijken.

source: You can use at most one token every second among all tasks.
nl: Je kan maximaal één token per seconde gebruiken voor alle taken samen.

source: You can use at most one token every %(min_interval)d seconds among all tasks.
nl: Je kan maximaal één token gebruiken per %(min_interval)d seconden voor alle taken samen.

source: Tasks may pose further limitations on how often you can use tokens.
nl: Taken kunnen bijkomende limieten stellen op het gebruik van tokens.

source: See the description page of each task for more information.
nl: Bekijk de pagina met de beschrijving van elke taak voor meer info.

source: Tasks may pose some limitations on how often you can use tokens.
nl: Taken kunnen limieten stellen op hoe vaak je tokens kan gebruiken.

source: You can find the rules for the tokens on the description page of each task.
nl: Je kan de regels over tokens vinden op de pagina met de beschrijving van elke taak.

source: In addition to those rules, you can use at most one token every second among all tasks.
nl: Bovenop die regels, kan je maximaal één token per seconde gebruiken voor alle taken samen.

source: In addition to those rules, you can use at most one token every %(min_interval)d seconds among all tasks.
nl: Bovenop die regels, kan je maximaal één token per %(min_interval)d seconden gebruiken voor alle taken samen.

source: In addition to these rules, tasks may pose some limitations on how often you can use tokens.
nl: Bovenop deze regels, kunnen taken limieten instellen op hoe vaak je tokens kan gebruiken.

source: You can find the rules for the task-tokens on each task's description page.
nl: Je kan de regels voor de taak-tokens op de pagina met de beschrijving van elke taak terugvinden.

source: You can use at most one token every second for this task
nl: Je kan maximaal één token per seconde gebruiken voor deze taak

source: You can use at most one token every %(min_interval)d seconds for this task
nl: Je kan maximaal één token per %(min_interval)d seconden gebruiken voor deze taak

source: and at most one token every second among all tasks.
nl: en maximaal één token per seconde voor alle taken samen.

source: and at most one token every %(min_interval)d seconds among all tasks.
nl: en maximaal één token per %(min_interval)d seconden voor alle taken samen.

source: You can use at most one token every second for this task.
nl: Je kan maximaal één token per seconde gebruiken voor deze taak.

source: You can use at most one token every %(min_interval)d seconds for this task.
nl: Je kan maximaal één token per %(min_interval)d seconden gebruiken voor deze taak.

source: On this task you don't have additional rules.
nl: Voor deze taak zijn er geen bijkomende beperkingen.

source: In addition to these rules, you can use at most one token every second among all tasks.
nl: Bovenop deze regels, kan je maximaal één token gebruiken per seconde voor alle taken samen.

source: In addition to these rules, you can use at most one token every %(min_interval)d seconds among all tasks.
nl: Bovenop deze regels, kan je maximaal één token per %(min_interval)d seconden gebruiken voor alle taken samen.

source: You can find the rules for the tokens on the <a href="%(url_root)s/">contest overview page</a>.
nl: Je vindt de regels over tokens op de <a href="%(url_root)s/">overzichtspagina van de wedstrijd</a>.

source: In addition to those rules, you can use at most one token every second on this task.
nl: Bovenop deze regels, kan je maximaal één token per seconde gebruiken voor deze taak.

source: In addition to those rules, you can use at most one token every %(min_interval)d seconds on this task.
nl: Bovenop deze regels, kan je maximaal één token per %(min_interval)d seconden gebruiken voor deze taak.

source: You can find the rules for the contest-tokens on the <a href="%(url_root)s/">contest overview page</a>.
nl: Je vindt de regels over wedstrijd-tokens op de <a href="%(url_root)s/">overzichtspagina van de wedstrijd</a>.

source: %(mb)d MiB
ru: %(mb)d МБ

source: %Y-%m-%d
it: %d/%m/%Y

source: %Y-%m-%d %H:%M:%S
it: %H:%M:%S %d/%m/%Y
