Repository: cms-dev/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: ar, cs, es_cl, et, hu, ja, lv, ro, sl, th, uk, zh_cn

source: Submission storage failed!
cs: Nepodařilo se uložit odevzdané řešení!
es_cl: ¡No se pudo almacenar el envío!
et: Esitatud lahenduse salvestamine ebaõnnestus!
hu: A beküldés mentése nem sikerült!
ja: 提出ファイルの保存に失敗しました!
lv: Iesūtījumu glabātuvē ir radusies kļūme!
ro: Gresala de stocare a fisierului!
sl: Shranjevanje oddaje neuspešno!
th: การส่งจัดเก็บล้มเหลว!
uk: Помилка зберігання даних!
zh_cn: 提交文件存取错误！

source: Too many tests!
cs: Příliš mnoho testů!
es_cl: ¡Demasiados tests!
et: Liiga palju teste!
ja: テスト要求が多すぎます!
lv: Par daudz testu!
ro: Prea multe teste!
sl: Preveč preizkusov!
th: ชุดทดสอบเยอะเกินไป!
uk: Забагато тестів!
zh_cn: 测试次数过多！

source: You have reached the maximum limit of at most %d tests among all tasks.
cs: Byl dosažený limit maximálně %d testů pro všechny úlohy.
es_cl: Ha alcanzado el máximo permitido de %d tests entre todos los problemas.
et: Te olete ületanud testimise kogulimiidi (%d testi).
ja: 全課題を通して、テストは合計で最大 %d 回までです。
lv: Jūs esat sasniedzis maksimālo testu skaitu visiem uzdevumiem (%d).
ro: Ati atins limita maxima de %d teste pentru toate sarcinile impreuna.
sl: Dosegel si največje možno število %d preizkusov za vse naloge.
th: สำหรับการแข่งขันนี้ คุณได้ทดสอบครบ %d ครั้งแล้ว
uk: Ви досягли максимального ліміту не більше %d тестів серед усіх завдань.
zh_cn: 在竞赛中, 您最多可以进行 %d 次测试。

source: You have reached the maximum limit of at most %d tests on this task.
cs: Byl dosažený limit maximálně %d testů pro tuto úlohu.
es_cl: Has alcanzado el máximo permitido de %d tests en este problema.
et: Te olete ületanud selle ülesande testimise limiidi (%d testi).
ja: この課題に対するテストは最大 %d 回までです。
lv: Jūs esat sasniedzis maksimālo testu skaitu šim uzdevumam (%d).
ro: Ati atins limita maxima de %d teste pe aceasta sarcina.
sl: Dosegel si največje možno število %d preizkusov za to nalogo.
th: สำหรับโจทย์ข้อนี้ คุณได้ทดสอบครบ %d ครั้งแล้ว
uk: Ви досягли максимального ліміту щонайбільше %d тестів для цього завдання.
zh_cn: 在本题中, 您最多可以进行 %d 次测试。

source: Tests too frequent!
cs: Přílič časté testování!
es_cl: ¡Tests demasiado frecuentes!
et: Testimine on liiga sage!
hu: Túl gyakori tesztelés!
ja: テスト要求の間隔が短すぎます!
lv: Pārāk bieži testi!
ro: Testati prea frecvent!
sl: Prepogosti preizkusi!
th: ทดสอบบ่อยเกินไป
uk: Тести занадто часті!
zh_cn: 测试过于频繁！

source: Among all tasks, you can test again after %d seconds from last test.
cs: Test k libovolné úloze můžete znovu spustit po %d vteřinách od posledního testu.
es_cl: Entre todos los problemas, puede volver a realizar un test pasados %d segundos desde el último test.
et: Saate jälle mõnda ülesannet testida alles %d sekundit peale viimast testimist.
hu: Az összes feladatra vonatkoztatva az utolsó tesztelésed után %d másodperccel tudsz újra tesztelni.
ja: 全課題を通して、最後の提出から %d 秒間はテストを要求することができません。
lv: Jebkuru uzdevumu jūs drīkstat testēt %d sekundes pēc iepriekšējā testa.
ro: Pentru toate sarcinile, puteti face testari din nou dupa %d secunde de la ultima testare.
sl: Naslednji preizkus lahko opraviš %d sekund po zadnjem preizkusu.
th: สำหรับการแข่งขันนี้ คุณสามารถทดสอบได้ทุกๆ %d วินาที
uk: Серед усіх завдань ви можете повторити тестування через %d секунд після останнього тесту.
zh_cn: 在竞赛中, 两次测试之间必须间隔至少 %d 秒。

source: For this task, you can test again after %d seconds from last test.
cs: Test k této úloze můžete znovu spustit po %d vteřinách od posledního testu.
es_cl: En este problema, puede volver a realizar un test pasados %d segundos desde el último test.
et: Saate jälle seda ülesannet testida alles %d sekundit peale viimast testimist.
hu: Ennél a feladatnál az utolsó tesztelésed után %d másodperccel tudsz újra tesztelni.
ja: この課題に関して、最後の提出から %d 秒間はテストを要求することができません。
lv: Šo uzdevumu jūs drīkstat testēt %d sekundes pēc iepriekšējā testa.
ro: Pentru aceasta sarcina, puteti face testari din nou dupa %d secunde de la ultima testare.
sl: Naslednji preizkus lahko opraviš %d sekund po zadnjem preizkusu za to nalogo.
th: สำหรับโจทย์ข้อนี้ คุณสามารถทดสอบได้ทุกๆ %d วินาที
uk: Ви можете повторити це завдання через %d секунди після останнього тесту.
zh_cn: 在本题中, 两次测试之间必须间隔至少 %d 秒。

source: Invalid test format!
cs: Neplatný formát testu!
es_cl: ¡El formato del test es inválido!
et: Vigane testi vorming!
hu: Érvénytelen teszt formátum!
ja: 無効なテスト形式です!
lv: Nepareizs testa formāts!
ro: Formatul de test nu este valid!
sl: Napačna oblika preizkusa!
th: รูปแบบการทดสอบไม่ถูกต้อง
uk: Недійсний формат тесту!
zh_cn: 错误的测试文件格式！

source: Test too big!
cs: Příliš velký test!
es_cl: ¡El test es demasiado grande!
et: Test on liiga suur!
hu: Túl nagy teszt!
ja: テストが大きすぎます!
lv: Tests par lielu!
ro: Testul este prea mare!
sl: Prevelik preizkus!
th: การทดสอบใหญ่เกินไป
uk: Тест занадто великий!
zh_cn: 测试文件过大！

source: Input too big!
cs: Příliš velký vstup!
es_cl: ¡El archivo de entrada es demasiado grande!
et: Sisend on liiga suur!
hu: Túl nagy bemenet!
ja: 入力が大きすぎます!
lv: Ievaddati par lielu!
ro: Fisierul de intrare este prea mare!
sl: Prevelik vhod!
th: ข้อมูลนำเข้าใหญ่เกินไป
uk: Вхідні дані завеликі!
zh_cn: 输入文件过大！

source: The input file must be at most %d bytes long.
cs: Vstupní soubor smí být maximálně %d bytů velký.
es_cl: El archivo de entrada puede tener un tamaño máximo de %d bytes.
et: Sisendfaili suurus võib olla kuni %d baiti.
hu: A bemeneti fájl maximum %d bájt méretű lehet.
ja: 各入力ファイルは %d バイト以下である必要があります。
lv: Ievaddatu datnes apjoms nedrīkst pārsniegt %d baitus.
ro: Fisierul de intrare nu poate depasi marimea de %d octeti.
sl: Vhodna datoteka je lahko velika največ %d bajtov.
th: ข้อมูลนำเข้าต้องมีขนาดไม่เกิน %d ไบท์
uk: Вхідний файл має мати щонайбільше %d байт.
zh_cn: 输入文件不得超过 %d 字节。

source: Test storage failed!
cs: Nedodařilo se uložit test!
es_cl: ¡No se pudo almacenar el test!
et: Testi salvestamine ebaõnnestus!
ja: テスト要求の保存に失敗しました!
lv: Testu glabātuvē ir radusies kļūme!
ro: Stocarea testului a esuat!
sl: Shranjevanje preizkusa spodletelo!
th: การทดสอบจัดเก็บล้มเหลว!
uk: Перевірити пам'ять не вдалося!
zh_cn: 测试文件储存失败！

source: Communication
ar: التواصل
cs: Komunikace
es_cl: Comunicación
et: Teated
hu: Kommunikáció
ja: コミュニケーション
lv: Komunikācija
ro: Comunicarea cu juriul
sl: Komunikacija
th: การสื่อสาร
uk: Взаємодія
zh_cn: 信息询问

source: Announcements
ar: المنشورات
cs: Oznámení
es_cl: Anuncios
et: Teavitused
hu: Közlemények
ja: アナウンス
lv: Paziņojumi
ro: Anunturi
sl: Obvestila
th: ประกาศ
uk: Оголошення
zh_cn: 公告信息

source: (no subject)
ar: (دون موضوع)
cs: (bez předmětu)
es_cl: (sin asunto)
et: (teemat ei ole)
hu: (nincs tárgy)
ja: (件名なし)
lv: (bez temata)
ro: (fara subiect)
sl: (ni zadeve)
th: (ไม่มีหัวเรื่อง)
uk: (без теми)
zh_cn: （无标题）

source: Questions
ar: الأسئلة
cs: Otázky
es_cl: Preguntas
et: Küsimused
hu: Kérdések
ja: 質問
lv: Jautājumi
ro: Intrebari
sl: Vprašanja
th: คำถาม
uk: Питання
zh_cn: 询问列表

source: Subject
ar: الموضوع
cs: Předmět
es_cl: Asunto
et: Teema
hu: Tárgy
ja: 件名
lv: Temats
ro: Subiectul
sl: Zadeva
th: หัวข้อ
uk: Тема
zh_cn: 标题

source: Text
ar: النص
es_cl: Texto
et: Tekst
hu: Szöveg
ja: 本文
lv: Teksts
sl: Besedilo
th: ข้อความ
uk: Текст
zh_cn: 内容

source: Ask question
ar: اسأل سؤالًا
cs: Položit otázku
es_cl: Enviar la pregunta
et: Esita küsimus
hu: Kérdezz
ja: 質問する
lv: Uzdot jautājumu
ro: Pune o intrebare
sl: Zastavi vprašanje
th: ถามคำถาม
uk: Поставте запитання
zh_cn: 询问新问题

source: Reset
ar: إعادة ضبط
cs: Vyresetovat
es_cl: Borrar
et: Lähtesta
hu: Mégse
ja: リセット
lv: Atiestatīt
ro: Reseteaza
sl: Ponastavi
th: รีเซ็ต
uk: Скинути
zh_cn: 重置

source: no answer yet
ar: لا إجابة بعد
cs: zatím bez odpovědi
es_cl: sin respuesta aún
et: küsimusele pole veel vastatud
hu: még nem érkezett válasz
ja: 回答はまだありません
lv: pagaidām atbildes nav
ro: raspunsul inca nu este
sl: ni odovora
th: ยังไม่ได้รับคำตอบ
uk: ще немає відповіді
zh_cn: 尚未回复

source: Messages
ar: الرسائل
cs: Zprávy
es_cl: Mensajes
et: Sõnumid
hu: Üzenetek
ja: メッセージ
lv: Ziņojumi
ro: Mesaje
sl: Sporočila
th: ข้อความ
uk: Повідомлення
zh_cn: 信息

source: Automatic (%(lang)s)
cs: Automatické (%(lang)s)
es_cl: Automático (%(lang)s)
et: Automaatne (%(lang)s)
hu: Automatikus (%(lang)s)
sl: Avtomatsko (%(lang)s)
th: อัตโนมัติ (%(lang)s)
uk: Автоматично (%(lang)s)
zh_cn: 自动检测（%(lang)s）

source: Logout
ar: تسجيل خروج
cs: Odhlásit
es_cl: Salir
et: Logi välja
hu: Kijelentkezés
ja: ログアウト
lv: Atslēgties
ro: Iesire
sl: Odjava
th: ออกจากระบบ
uk: Вийти
zh_cn: 登出

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
ar: سجلت الدخول باسم <strong>%(first_name)s%(last_name)s</strong><em>%(username)s</em>
cs: Přihlášen(a) jako <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
es_cl: Acceso permitido a <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
et: Sisse logitud kui <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
hu: Bejelentkezve mint <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
ja: <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>としてログインしています
lv: Pieslēdzies kā <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
ro: Logat ca <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
sl: Prijavljen kot <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
th: สวัสดี <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
uk: Ви ввійшли як <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
zh_cn: 使用者 <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>

source: Failed to log in.
ar: فشل تسجيل الدخول.
cs: Přihlášení se nepodařilo.
es_cl: Acceso denegado.
et: Sisselogimine ebaõnnestus.
hu: Sikertelen bejelentkezés.
ja: ログインに失敗しました。
lv: Kļūme pieslēdzoties.
ro: Logarea a esuat.
sl: Prijava ni uspela.
th: การเข้าสู่ระบบไม่สำเร็จ
uk: Не вдалося увійти.
zh_cn: 无法登入。

source: Welcome
ar: مرحبًا
cs: Vítejte
es_cl: Bienvenido
et: Tere tulemast
hu: Üdv
ja: ようこそ
lv: Sveicināti!
ro: Bine ati venit
sl: Pozdravljeni
th: ยินดีต้อนรับ
uk: Ласкаво просимо
zh_cn: 欢迎

source: Please log in
ar: فضلًا سجل الدخول
cs: Přihlašte se
es_cl: Por favor acceda al sistema
et: Palun logi sisse
hu: Kérlek lépj be
ja: ログインしてください
lv: Lūdzu, pieslēdzieties!
ro: Va rugam sa va logati
sl: Prosim, prijavi se
th: กรุณาเข้าสู่ระบบ
uk: Будь ласка, увійдіть
zh_cn: 请登入后参与竞赛

source: Username
ar: اسم المستخدم
cs: Uživatelské jméno
es_cl: Nombre de usuario
et: Kasutajatunnus
hu: Felhasználónév
ja: ユーザ名
lv: Lietotājvārds
ro: Nume utilizator
sl: Uporabniško ime
th: ชื่อผู้ใช้งาน
uk: Логін
zh_cn: 用户名

source: Password
ar: كلمة المرور
cs: Heslo
es_cl: Contraseña
et: Parool
hu: Jelszó
ja: パスワード
lv: Parole
ro: Parola
sl: Geslo
th: รหัสผ่าน
uk: Пароль
zh_cn: 密码

source: Login
ar: تسجيل دخول
cs: Přihlásit se
es_cl: Iniciar sesión
et: Logi sisse
hu: Bejelentkezés
ja: ログイン
lv: Pieslēgties
ro: Logare
sl: Vstopi
th: เข้าสู่ระบบ
uk: Увійти
zh_cn: 登入

source: Don't have an account?
ar: هل عندك حساب؟
cs: Nemáte účet?
es_cl: ¿No tienes una cuenta?
et: Pole kasutajat?
hu: Nincs fiókod?
ro: Nu ai un cont?
th: ไม่มีบัญชี?
uk: Немає облікового запису?
zh_cn: 还没有账号？

source: Register
ar: تسجيل
cs: Registrovat
es_cl: Registrarse
et: Registreeri
hu: Regisztrálás
ro: Înregistrează-te
th: สมัครบัญชี
uk: зареєструватися
zh_cn: 注册

source: New message
ar: رسالة جديدة
cs: Nová zpráva
es_cl: Nuevo mensaje
et: Uus sõnum
hu: Új üzenet
ja: 新着メッセージ
lv: Jauns ziņojums
ro: Mesaj nou
sl: Novo sporočilo
th: ข้อความใหม่
uk: Нове повідомлення
zh_cn: 新信息

source: New announcement
ar: منشور جديد
cs: Nové oznámení
es_cl: Anuncio nuevo
et: Uus teavitus
hu: Új közlemény
ja: 新着アナウンス
lv: Jauns paziņojums
ro: Anunt nou
sl: Novo obvestilo
th: ประกาศใหม่
uk: Нове оголошення
zh_cn: 新公告

source: New answer
ar: إجابة جديدة
cs: Nová odpověď
es_cl: Nueva respuesta
et: Uus vastus
hu: Új válasz
ja: 新着回答
lv: Jauna atbilde
ro: Raspuns nou
sl: Nov odgovor
th: คำตอบใหม่
uk: Нова відповідь
zh_cn: 新回复

source: %d unread
ar: %d غير مقروءة
cs: %d nepřečteno
es_cl: %d sin leer
et: %d lugemata
hu: %d olvasatlan
ja: 未読 %d 件
lv: %d nelasītas
ro: %d necitite
sl: %d neprebranih
th: ยังไม่ได้อ่าน %d ข้อความ
uk: %d непрочитаних
zh_cn: %d 则信息未读

source: Until contest starts:
ar: حتى بداية المسابقة:
cs: Do začátku soutěže:
es_cl: Tiempo restante hasta el comienzo de la competencia:
et: Võistluse alguseni:
hu: A verseny kezdetéig:
ja: コンテスト開始まで:
lv: Līdz sacensību sākumam:
ro: Pana la inceputul concursului:
sl: Čas do začetka:
th: การแข่งขันจะเริ่มเวลา
uk: До початку змагання:
zh_cn: 距离竞赛开始：

source: Until analysis starts:
ar: حتى بداية المراجعة:
cs: Do začátku analýzy:
es_cl: Tiempo restante hasta el inicio de la fase de análisis:
et: Järellahendamise alguseni:
hu: Az analízis kezdetéig:
lv: Līdz pēcsacensību režīma sākumam:
ro: Pana la inceputul analizei:
th: โหมดการวิเคราะห์จะเริ่มเวลา
uk: До початку аналізу:
zh_cn: 距离赛后评测开始：

source: Until contest ends:
ar: حتى نهاية المسابقة:
cs: Do konce soutěže:
es_cl: Tiempo restante hasta el final de la competencia:
et: Võisluse lõpuni:
hu: A verseny végéig:
ja: コンテスト終了まで:
lv: Līdz sacensību beigām:
ro: Pana la sfarsitul concursului:
sl: Čas do konca:
th: การแข่งขันจะจบเวลา
uk: До закінчення змагання:
zh_cn: 距离竞赛结束：

source: Until analysis ends:
ar: حتى نهاية المراجعة:
cs: Do konce analýzy:
es_cl: Tiempo restante el final de la fase de análisis:
et: Järellahendamise lõpuni:
hu: Az analízis végéig:
lv: Līdz pēcsacensību režīma beigām:
ro: Pana la sfarsitul analizei:
th: โหมดการวิเคราะห์จะจบเวลา
uk: До закінчення аналізу:
zh_cn: 距离赛后评测结束：

source: Time left:
ar: الوقت المتبقي:
cs: Zbývající čas:
es_cl: Tiempo restante:
et: Aega jäänud:
hu: Fennmaradó idő:
ja: 残り時間:
lv: Atlikušais laiks:
ro: Timpul ramas:
sl: Preostali čas:
th: เวลาที่เหลือ:
uk: Залишився час:
zh_cn: 剩余时间：

source: Server time:
ar: وقت السيرفر:
cs: Čas serveru:
es_cl: Hora del servidor:
et: Serveri kell:
hu: Szerveridő:
ja: サーバー時刻:
lv: Servera laiks:
ro: Timpul serverului:
sl: Strežniški čas:
th: เวลาเซิร์ฟเวอร์:
uk: Час сервера:
zh_cn: 现在时间：

source: Overview
ar: نظرة عامة
cs: Přehled
es_cl: Vista general
et: Ülevaade
hu: Áttekintés
ja: 概要
lv: Pārskats
ro: Privire de ansamblu
sl: Pregled
th: ภาพรวม
uk: Огляд
zh_cn: 竞赛概况

source: Statement
ar: نص المسألة
cs: Zadání
es_cl: Enunciado
et: Ülesande tekst
hu: Feladatleírás
ja: 問題文
lv: Formulējums
ro: Enunt
sl: Naloga
th: รายละเอียดโจทย์
uk: Умова
zh_cn: 题目描述

source: Submissions
ar: التسليمات
cs: Odevzdaná řešení
es_cl: Envío
et: Esitatud lahendused
hu: Beküldések
ja: 提出
lv: Iesūtījumi
ro: Expedieri
sl: Oddaje
th: ส่งโปรแกรม
uk: Спроби
zh_cn: 评测页面

source: Documentation
ar: دليل الاستخدام
cs: Dokumentace
es_cl: Documentación
et: Dokumentatsioon
hu: Dokumentáció
ja: 資料
lv: Dokumentācija
ro: Documente
sl: Dokumentacija
th: เอกสาร
uk: Документація
zh_cn: 参考资料

source: Testing
cs: Testování
et: Testimine
hu: Tesztelés
ja: テスト
lv: Testēšana
ro: Testare
sl: Preizkušanje
th: การทดสอบ
uk: Тестування
zh_cn: 线上测试

source: Printing
ar: طباعة
cs: Tisk
es_cl: Impresión
et: Printimine
hu: Nyomtatás
ja: 印刷
lv: Drukāšana
sl: Tiskanje
th: การพิมพ์
uk: Друк

source: is released under the
cs: je uvolněný pod
es_cl: se distribuye bajo la
et: kasutamine on lubatud vastavalt
hu: a következő licenc alatt áll:
ja: は以下のライセンスのもとでリリースされています:
lv: tiek izplatīta izmantojot
ro: este eliberat sub
sl: je objavljen pod
th: ใช้สัญญาอนุญาต
uk: випускається під
zh_cn: 遵循

source: Choose a contest
ar: اختر مسابقة
cs: Vyberte si soutěž
es_cl: Seleccionar una competencia
et: Vali võistlus
hu: Válassz egy versenyt
ro: Alege un concurs
th: เลือกการแข่งขัน
uk: Виберіть змагання

source: Programming languages and libraries
ar: اللغات البرمجية والمكتبات
cs: Programovací jazyky a knihovny
es_cl: Lenguajes de programación y librerías
et: Programmeerimiskeeled ja teegid
hu: Programozási nyelvek és könyvtárak
ja: プログラミング言語およびライブラリの仕様
lv: Programmēšanas valodas un bibliotēkas
ro: Limbaje de programare si biblioteci
sl: Programski jeziki in knjižnice
th: ภาษาโปรแกรมและไลบรารี่
uk: Мови програмування та бібліотеки
zh_cn: 编程语言和库

source: Standard Template Library
ar: المكتبة الأساسية
cs: Standard Template Library (STL)
es_cl: Standrad Template Library
lv: Standarta šablonu bibliotēka (STL)
uk: Стандартна бібліотека шаблонів

source: The main Java class of the solution should have exactly the same name as the task.
ar: اسم الكلاس في Java يجب أن يطابق اسم المسألة
cs: Hlavní třída programu v Javě se musí jmenovat stejně jako úloha.
es_cl: La class principal en Java debe llamarse igual que el nombre del problema
et: Java lahenduse peaklass peaks olema sama nimega kui ülesanne.
hu: A megoldásod fő Java osztályának neve meg kell, hogy egyezzen a feladat nevével.
ja: Java 言語で解答する場合のメインクラスの名前は、課題名と完全に一致させる必要があります。
lv: Risinājuma galvenajai Java klasei ir jābūt nosauktai precīzi tāpat kā pašam uzdevumam.
ro: Clasa Java principala a solutiei trebuie sa aiba exact acelasi numa ca sarcina.
th: คลาส main ของภาษา Java จะต้องใช้ชื่อเดียวกับชื่อโจทย์เท่านั้น
uk: Основний клас Java рішення повинен мати точно таке ж ім’я, як і завдання.
zh_cn: Java 的 main class 应该与题目名称保持一致。

source: Submission details for compilation
ar: تفاصيل التسليم للكومبايل
cs: Detaily odevzdaného řešení pro kompilaci
es_cl: Detalles del envío (compilación)
et: Kompileerimisel esinevad teated
hu: Fordítás kimenetele
ja: コンパイルメッセージの詳細
lv: Iesūtījuma kompilēšanas detaļas
ro: Detaliile expedierii pentru compilare
sl: Podrobnosti oddaje o prevajanju
th: รายละเอียดการคอมไพล์
uk: Деталі спроби для компіляції
zh_cn: 程序编译细节

source: Message
ar: رسالة
cs: Zpráva
es_cl: Mensaje
et: Sõnum
hu: Üzenet
ja: メッセージ
lv: Ziņojums
ro: Mesaj
sl: Sporočilo
th: ข้อความ
uk: Повідомлення
zh_cn: 信息

source: Explanation
ar: شرح
cs: Vysvětlení
es_cl: Explicación
et: Seletus
hu: Magyarázat
ja: 説明
lv: Izskaidrojums
ro: Explicatii
sl: Obrazložitev
th: คำอธิบาย
uk: Пояснення
zh_cn: 解释

source: Submission details for evaluation
ar: تفاصيل التسليم للتنفيذ
cs: Detaily odevzdaného řešení pro vyhodnocení
es_cl: Detalles del envío (evaluación)
et: Testimisel esinevad teated
hu: Kiértékelés kimenetele
ja: 実行・評価メッセージの詳細
lv: Iesūtījuma izpildes detaļas
ro: Detaliile expedierii pentru evaluare
sl: Podrobnosti oddaje o ovrednotenju
th: รายละเอียดการประเมิน
uk: Деталі спроби для оцінювання
zh_cn: 程序评估细节

source: Error %(status_code)s
ar: خطأ %(status_code)s
cs: Chyba %(status_code)s
et: Viga %(status_code)s
hu: Hiba: %(status_code)s
ro: Eroare %(status_code)s
sl: Napaka %(status_code)s
uk: Помилка %(status_code)s
zh_cn: 错误 %(status_code)s

source: An error occured while the server was handling your request.
ar: حصل خطأ من النظام حين معالجة طلبك
cs: Během zpracování vašeho požadavku došlo na serveru k chybě.
es_cl: Ocurrió un error mientras el servidor procesaba su solicitud.
et: Päringu töötlemise käigus esines viga.
hu: Hiba történt a kérés feldolgozása közben.
ja: サーバーがあなたの要求を処理している途中でエラーが発生しました。
lv: Serverim apstrādājot jūsu pieprasījumu, ir radusies kļūme.
ro: A aparut o eroare la preluctrarea solicitarii dumneavoastre.
sl: Napaka se je zgodila med tem ko je strežnik obravnaval tvojo zahtevo.
th: เกิดข้อผิดพลาดขณะที่เซิร์ฟเวอร์กำลังจัดการคำขอของคุณ
uk: Під час обробки вашого запиту сервером сталася помилка.
zh_cn: 竞赛系统服务器发生错误。

source: Note that attempts to tamper with Contest Management System (such as probing the server with customized URLs) may be considered cheating and may lead to disqualification.
cs: Vezměte na vědomí, že pokusy zasahovat do soutěžního systému (jako zkoumání serveru s upravenými URL) může být vyhodnoceno jako podvod a vést k diskvalifikaci ze soutěže.
es_cl: Notar que cualquier intento de afectar el funcionamiento del sistema (como por ejemplo intentar acceder al servidor a través de URLs personalizadas) podría ser considerado un intento de trampa, y podría producir su descalificación.
et: Pange tähele, et Contest Management System'i ebaotstarbeline kasutus (nagu näiteks moonutatud URL-ide katsetamine) võib olla interpreteeritud kui sohitegemise katse, ning kaasa tuua diskvalifikatsiooni.
hu: Megjegyezzük, hogy a Contest Management System (CMS) nem rendeltetésszerű használata (például tetszőleges URL-ek próbálgatása) csalásnak minősülhet és a versenyből való kizárást vonhatja maga után.
ja: コンテスト管理システム (CMS) の内部に干渉したり、改竄しようとする試み (例えば、URL を改変してサーバー内を探索すること) は、不正行為とみなされて失格の原因となる可能性があるので、注意してください。
lv: Iedarbošanās uz testēšanas sistēmu neatļautā veidā (piemēram, mēģinājums izmantot modificētas pieprasījuma adreses) var tikt uzskatīta par blēdīšanos un var beigties ar diskvalifikāciju.
ro: Atentie, incercarile de a incalca/manipula sistemul (cum ar fi ondarea serverului cu URL utilizatorului) poate fi considerata ca inselaciune si duce la descalificare.
sl: Vedi, da je poseg v Contest Management System (kot je preizkušanje strežnika s prirejenimi URL naslovi) lahko tretiran kot goljufija in si zaradi tega lahko prislužiš izključitev.
th: การพยายามแฮคระบบ Contest Management System ด้วยวิธีต่าง ๆ เช่น การเข้า URL ที่ไม่ได้รับอนุญาต อาจถือเป็นการทุจริตและสามารถตัดสิทธิ์การเข้าแข่งขันได้
uk: Зауважте, що спроби підробити систему керування змаганнями (наприклад, перевірка сервера за допомогою налаштованих URL-адрес) можуть вважатися шахрайством і призвести до дискваліфікації.
zh_cn: 擅自以非正当方式操作本系统可能会被认定为作弊，并导致取消竞赛资格。

source: If you encountered this error during normal usage, please notify the contest administrators.
ar: إذا واجهت هذه المشكلة أثناء الاستخدام الطبيعي، فضلًا أبلغ المسؤولين عن المسابقة.
cs: Pokud potkáte tuto chybu během běžného použití, dejte prosím vědět organizátorům soutěže.
es_cl: Si encuentra este error durante el uso normal del sistema, por favor contacte a un administrador.
et: Kui te avastasite selle vea normaalse kasutuse käigus, palun teavitage võistluse administraatoreid.
hu: Ha ezt a hibát látod, akkor értesítsd a versenyszervezőket.
ja: 通常の利用においてこのエラーに遭遇した場合は、コンテストの管理者に知らせてください。
lv: Ja jūs saskārāties ar šo kļūdu parastā situācijā, lūdzu, informējiet sacensību administratorus.
ro: Daca in timpul licrului ati intilnit o eroare de sistem, va rugam sa anuntati administratorul.
sl: Če naletiš na to težavo med normalno uporabo, prosim, pošlji e-pošto na weiss.simon.1995@gmail.com .
th: หากคุณพบข้อผิดพลาดนี้ระหว่างการใช้งาน โปรดแจ้งให้ผู้ดูแลการแข่งขัน
uk: Якщо ви зіткнулися з цією помилкою під час звичайного використання, повідомте про це адміністраторів змагання.
zh_cn: 若在正常使用的情况下发生错误, 请联络管理员。

source: General information
ar: معلومات عامة
cs: Obecné informace
es_cl: Información general
et: Üldinfo
hu: Általános információk
ja: 全般的な情報
lv: Vispārīga informācija
ro: Informatie generala
sl: Splošne informacije
th: ข้อมูลทั่วไป
uk: Загальна інформація
zh_cn: 竞赛信息

source: The contest hasn't started yet.
ar: المسابقة لم تبدأ بعد
cs: Soutěž ještě nezačala.
es_cl: La competencia no ha comenzado aún.
et: Võistlus ei ole veel alanud.
hu: A verseny még nem indult el.
ja: コンテストはまだ始まっていません。
lv: Sacensības vēl nav sākušās.
ro: Concursul nu a inceput inca.
sl: Tekmovanje se še ni začelo
th: การแข่งขันยังไม่ได้เริ่มต้นขึ้น
uk: Змагання ще не розпочалося.
zh_cn: 竞赛尚未开始。

source: The contest will start at %(start_time)s and will end at %(stop_time)s.
cs: Soutěž začne %(start_time)s a skončí %(stop_time)s.
es_cl: La competencia comenzará a las %(start_time)s y finalizará a las %(stop_time)s.
et: Võistluse algab %(start_time)s ja lõppeb %(stop_time)s.
hu: A verseny %(start_time)s időpontban fog elkezdődni, és %(stop_time)s időpontban fog véget érni.
ja: コンテストは %(start_time)s に始まり、 %(stop_time)s に終わる予定です。
lv: Sacensības sāksies %(start_time)s un beigsies %(stop_time)s.
ro: Concursul va incepe la %(start_time)s si se va sfarsi la %(stop_time)s.
sl: Tekmovanje se bo začelo ob %(start_time)s in končalo ob %(stop_time)s.
th: การแข่งขันนี้จะเริ่มต้นเวลา %(start_time)s และจะสิ้นสุดเวลา %(stop_time)s.
uk: Змагання розпочнеться о %(start_time)s і закінчиться о %(stop_time)s.
zh_cn: 竞赛时间将于 %(start_time)s 开始，至 %(stop_time)s 结束。
