Repository: cms-dev/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: ar, cs, es_cl, et, hu, ja, lv, ro, sl, th, uk, zh_cn

source: Correct
ar: صحيح
cs: Správně
es_cl: Correcto
et: Õige vastus
hu: Helyes
ja: 正解
lv: Pareizs
ro: Corect
sl: Pravilno
th: ถูกต้อง
uk: Правильно

source: Not correct
ar: غير صحيح
cs: Nesprávně
es_cl: Incorrecto
et: Vale vastus
hu: Helytelen
ja: 不正解
lv: Nepareizs
ro: Gresit
sl: Napačno
th: ไม่ถูกต้อง
uk: Неправильно

source: Partially correct
ar: صحيح جزئيًا
cs: Částečně správně
es_cl: Parcialmente correcto
et: Osaliselt õige vastus
hu: Részlegesen helyes
ja: 部分的に正解
lv: Daļēji pareizs
ro: Solutie partiala
sl: Delno pravilno
th: ได้คะแนนบางส่วน
uk: Частково правильно

source: Outcome
ar: نتيجة
cs: Výsledek
es_cl: Resultado
et: Tulemus
hu: Eredmény
ja: 結果
lv: Iznākums
ro: Rezultatul
sl: Rezultat
th: ผลลัพธ์
uk: Результат

source: Details
ar: التفاصيل
cs: Podrobnosti
es_cl: Detalles
et: Detailid
hu: Részletek
ja: 詳細
lv: Detaļas
ro: Detalii
sl: Podrobnosti
th: รายละเอียด
uk: Деталі

source: Execution time
ar: الوقت المستغرق للتنفيذ
cs: Doba běhu
es_cl: Tiempo de ejecución
et: Täitmise aeg
hu: Futásidő
ja: 実行時間
lv: Izpildes laiks
ro: Timpul de executie
sl: Čas izvajanja
th: เวลาดำเนินการ
uk: Час виконання

source: Memory used
ar: الذاكرة المستعملة
cs: Použitá paměť
es_cl: Memoria utilizada
et: Kasutatud mälu
hu: Memórihasználat
ja: メモリ使用量
lv: Izmantotā atmiņa
ro: Memoria utilizata
sl: Porabljen spomin
th: หน่วยความจำที่ใช้
uk: Використана пам'ять

source: Score details temporarily unavailable.
cs: Detaily skóre momentálně nejsou dostupné.
es_cl: La puntuación detallada se encuentra temporalmente no disponible.
et: Punktide andmed on ajutiselt kättesaamatud.
hu: A pontozás részletei ideiglenesen nem elérhetőek.
lv: Vērtēšanas detaļas pašlaik nav pieejamas.
ro: Detaliile scorului sunt temporar indisponibile.
th: ดูรายละเอียดคะแนนไม่ได้ชั่วคราว
uk: Деталі результатів тимчасово недоступні.

source: Subtask %(index)s
ar: المسألة الفرعية رقم %(index)s
cs: Podúloha %(index)s
es_cl: Subtarea %(index)s
et: Alamülesanne %(index)s
hu: %(index)s. részfeladat
sl: Podnaloga %(index)s
th: กลุ่มชุดทดสอบที่ %(index)s
uk: Підзавдання %(index)s

source: Compilation succeeded
ar: نجح التحويل
cs: Úspěšně zkompilováno
es_cl: Compilación correcta
et: Kompileerimine õnnestus
hu: Sikeres fordítás
ja: コンパイル成功
lv: Kompilācija ir veiksmīga
ro: Compilare reusita
sl: Prevajanje uspešno zaključeno
th: คอมไพล์สำเร็จ
uk: Компіляція виконана успішно

source: Your submission successfully compiled to an executable.
cs: Odevzdané řešení bylo úspěšně zkompilováno do spustitelného souboru.
es_cl: El envío ha sido compilado a un archivo ejecutable de manera exitosa.
et: Teie lahendus kompileeriti edukalt.
hu: A beküldött megoldásod sikeresen lefordult.
ro: Expedierea a fost compilata cu succes intr-un fiser executabil.
sl: Tvoja oddaja se je uspešno prevedla v izvršno datoteko.
th: การคอมไพล์สำเร็จ
uk: Ваша спроба успішно скомпільована у виконуваний файл.

source: Compilation failed
ar: فشل التحويل
cs: Kompilace selhala
es_cl: Compilación fallida
et: Kompileerimine ebaõnnestus
hu: Sikertelen fordítás
ja: コンパイル失敗
lv: Kompilācija ir nesekmīga
ro: Compilarea a esuat
sl: Prevajanje ni uspelo
th: การคอมไพล์ล้มเหลว
uk: Помилка компіляції

source: Your submission did not compile correctly.
cs: Odevzdané řešení nebylo správně zkompilováno.
es_cl: El envío no compiló correctamente.
et: Teie lahenduse kompileerimisel esines viga.
hu: A beküldött megoldásod nem fordult le.
ja: 提出されたファイルのコンパイルに失敗しました。
lv: Jūsu iesūtījumu nevarēja nokompilēt pareizi.
ro: Expedierea nu a fost compilata corect.
sl: Tvoja oddaja se ni uspešno prevedla.
th: โปรแกรมของคุณคอมไพล์ไม่ผ่าน
uk: Ваша спроба скомпільована неправильно.

source: Compilation timed out
ar: التحويل تجاوز حد الوقت
cs: Vyčerpaný časový limit kompilace
es_cl: Tiempo de compilación excedido
et: Kompileerimise ajalimiit ületatud
hu: A fordítás túllépte az időlimitet
ja: コンパイル時間超過
lv: Pārsniegts kompilēšanai atvēlētais laiks
ro: Depasirea timpului alocat pentru compilare
sl: Čas prevajanja je potekel
th: ใช้เวลาในคอมไพล์มากเกินไป
uk: Час очікування компіляції минув

source: Your submission exceeded the time limit while compiling. This might be caused by an excessive use of C++ templates, for example.
cs: Odevzdané řešení během kompilace vyčerpalo časový limit. To může být způsobeno např. nadměrným využíváním šablon (templates) v C++.
es_cl: El envío superó el tiempo máximo permitido durante la compilación. Esto podría deberse, por ejemplo, a un uso excesivo de templates de C++.
et: Teie lahenduse kompileerimine võttis liiga kaua aega. See võib tuleneda näiteks liigsest C++ mallide kasutamisest.
hu: A fordítás túllépte a megadott időlimitet. Ezt okozhatja például a C++ sablonok túlzott használata is.
ja: 提出されたファイルのコンパイルが制限時間内に終わりませんでした。原因として C++ テンプレートの多用などが考えられます。
lv: Jūsu iesūtījums kompilēšanas laikā ir pārsniedzis laika limitu. To, piemēram, var būt izraisījis pārliecīgs C++ šablonu lietojums.
ro: Expedierea a depasit limita de timp la compilare.Aceasta ar putea ficauzata de utilizarea excesiva a template-urilor C++, de exemplu.
sl: Tvoja oddaja je presegla časovno omejitev prevajanja. To je lahko posledica npr. prevelike uporabe C++ predlog.
th: การส่งของคุณใช้เวลามนการคอมไพล์มากเกินไป อาจเป็นเพราะใช้เทมเพลต C++ ที่ใหญ่เกินไป
uk: Ви перевищили ліміт часу під час компіляції. Це може бути спричинено, наприклад, надмірним використанням шаблонів C++.

source: Compilation killed with signal %s (could be triggered by violating memory limits)
cs: Kompilace ukončena signálem %s (to mohlo být způsobeno překročením paměťových limitů)
es_cl: La compilación terminó con signal %s (podría deberse a un uso de memoria superior al máximo permitido)
et: Kompileerimine katkes signaali %s tagajärjel (võib olla tingitud mälupiirangute ületamisest)
hu: A fordítás %s jelzés (signal) hatására fejeződött be
ja: シグナル %s による強制終了 (メモリ制限違反の可能性もあります)
lv: Kompilēšana pārtraukta ar signālu %s (to var būt izraisījusi atmiņas ierobežojumu pārkāpšana)
ro: Compilarea intrerupta de semnalul %s (ar putea fi cauzata de incalcarea limitelor de memorie)
sl: Prevajanje je bilo zaustavljeno s signalom %s (lahko da je bilo sproženo zaradi prekoračitve spominske omejitve)
th: การคอมไพล์ถูกฆ่าด้วย signal %s (อาจเป็นเพราะใช้หน่วยความจำมากเกินไป)
uk: Компіляція припинена сигналом %s (може бути викликано порушенням обмежень пам’яті)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit for the compilation, and in turn by an excessive use of C++ templates, for example.
cs: Odevzdané řešení bylo přerušeno uvedeným signálem. To mohlo být způsobeno, kromě jiných věcí, překročením paměťových limitů pro kompilaci, tedy např. nadměrným využíváním šablon v C++.
es_cl: El envío fue terminado con la señal indicada. Entre otras cosas, esto podría ser causado por la utilización durante la compilación de una cantidad de memoria mayor al máximo valor permitido. Esto a su vez podría ser causado por un uso excesivo de templates en C++, por ejemplo.
et: Teie lahenduse kompileerimine katkes antud signaaliga. See võib muuhulgas olla tingitud kompilaatori mälupiirangute ületamisest, mis omakorda võib tuleneda liigsest C++ mallide kasutamisest.
hu: A beküldött megoldásod fordítása a megadott jelzés (signal) hatására fejeződött be. Többek között ezt a fordító túlzott memóriahasználata is okozhatja, amelynek oka lehet a például a C++ sablonok túlzott használata.
ja: 提出されたファイルのコンパイルは強制終了されました。原因としてさまざまなものが考えられますが、例えば C++ テンプレートの多用などによるコンパイル時のメモリ制限の超過が原因かもしれません。
lv: Jūsu iesūtījuma izpilde ir pārtraukta ar norādītu signālu. To, cita starpā, var būt izraisījusi atmiņas apjoma pārsniegšana kompilēšanas laikā, ko, savukārt, var būt izsaucis pārliecīgs C++ šablonu lietojums.
ro: Expedierea a fost intrerupta cu semnalul specificat. Printre altele, acest lucru ar putea fi cauzat de depasirea limitei de memorie pentru compilare si, la rindul sau, de utilizarea excesiva a template-urilor utilizate in C++, de exemplu.
sl: Tvoja oddaja je bila zaustavljena s specifičnim signalom. Med drugim je lahko razlog za to prekoračitev spominske omejitve za prevajanje. Morda zaradi prekomerne uporabe C++ predlog.
th: การส่งของคุณถูกฆ่าด้วย signal ซึ่งอาจเป็นเพราะใช้หน่วยความจำในการคอมไพล์มากเกินไป ซึ่งอาจเกิดจากการใช้เทมเพลต C++ ที่ใหญ่เกินไป
uk: Ваша спроба була знищена вказаним сигналом. Серед іншого, це може бути спричинено перевищенням обмеження пам’яті для компіляції та, у свою чергу, надмірним використанням шаблонів C++, наприклад.

source: Output is correct
ar: المخرجات صحيحة
cs: Správný výstup
es_cl: Salida correcta
et: Väljund on õige
hu: Helyes kimenet
ja: 正解
lv: Izvaddati ir pareizi
ro: Iesire corecta
sl: Izhod je pravilen
th: ผลลัพธ์ถูกต้อง
uk: Вихідні дані правильні

source: Your submission ran and gave the correct answer
cs: Odevzdané řešení doběhlo a vydalo správnou odpověď
es_cl: El envío se ejecutó y devolvió la respuesta correcta
et: Lahendus jooksis edukalt ja andis õige vastuse
hu: A beküldött megoldásod lefutott, és helyes eredményt adott
ja: 提出されたプログラムは正常終了して、正しい解答を出力しました。
lv: Jūsu iesūtījums tika izpildīts un izdeva pareizu atbildi
ro: Expedierea s-a derulat si a dat raspunsul corect
sl: Tvoja oddaja je bila pognana in je vrnila pravilen odgovor
th: โปรแกรมคุณให้คำตอบที่ถูกต้อง
uk: Ваша спроба запущена та дала правильну відповідь

source: Output is partially correct
ar: المخرجات صحيحة جزئيًا
cs: Částečně správný výstup
es_cl: Salida parcialmente correcta
et: Väljund on osaliselt õige
hu: Részlegesen helyes kimenet
ja: 部分的に正解
lv: Izvaddati ir daļēji pareizi
ro: Rezultatul este partial corect
sl: Izhod je delno pravilen
th: ผลลัพธ์ถูกต้องบางส่วน
uk: Вихідні дані частково правильні

source: Your submission ran and gave the partially correct answer
cs: Odevzdané řešení doběhlo a vydalo částečně správnou odpověď
es_cl: El envío se ejecutó y devolvió una respuesta parcialmente correcta
et: Lahendus jooksis edukalt ja andis osaliselt õige vastuse
hu: A beküldött megoldásod lefutott, és részlegesen helyen eredményt adott
ja: 提出されたプログラムは正常終了して、部分的に正しい解答を出力しました。
lv: Jūsu iesūtījums tika izpildīts un izdeva daļēji pareizu atbildi
ro: Expedierea s-a derulat si a dat un raspuns partial corect
sl: Tvoja oddaja je bila pognana in je vrnila delno pravilen odgovor
th: โปรแกรมคุณให้คำตอบที่ถูกต้องบางส่วน
uk: Ваша спроба запущена та дала частково правильну відповідь

source: Output isn't correct
ar: المخرجات غير صحيحة
cs: Nesprávný výstup
es_cl: Salida errónea
et: Väljund ei ole õige
hu: Helytelen kimenet
ja: 不正解
lv: Izvaddati nav pareizi
ro: Iesire gresita
sl: Izhod je napačen
th: ผลลัพธ์ไม่ถูกต้อง
uk: Вихідні дані неправильні

source: Your submission ran, but gave the wrong answer
cs: Odevzdané řešení doběhlo, ale vydalo špatnou odpověď
es_cl: El envío se ejecutó, pero devolvió una respuesta errónea
et: Lahendus jooksis edukalt, kuid andis vale vastuse
hu: A beküldött megoldásod lefutott, de helytelen eredményt adott
ja: 提出されたプログラムは正常終了しましたが、解答が正しくありませんでした。
lv: Jūsu iesūtījums tika izpildīts, bet izdeva nepareizu atbildi
ro: Expedierea a rulat, insa a dat un raspuns gresit
sl: Tvoja oddaja je bila pognana, vendar je vrnila napačen odgovor
th: โปรแกรมสามารถรันได้ แต่คำตอบไม่ถูกต้อง
uk: Ваша спроба запущена, але дала неправильну відповідь

source: Evaluation didn't produce file %s
cs: Vyhodnocení nevytvořilo soubor %s
es_cl: La evaluación no generó el archivo %s
et: Programmi täitmisel ei tekkinud faili %s
hu: A kiértékelés közben nem jött létre a(z) %s fájl
ja: ファイル %s がありません
lv: Vērtēšanas laikā netika izveidota datne %s
ro: Evaluarea nu a putut crea fisierul %s
sl: Pri ovrednotenju ni nastala datoteka %s
th: การประมวลผลไม่ได้ไฟล์ %s
uk: Оцінювання не створило файл %s

source: Your submission ran, but did not write on the correct output file
cs: Odevzdané řešení doběhlo, ale nic nezapsalo do správného výstupního souboru
es_cl: El envío se ejecutó, pero no escribió la salida en el archivo correcto
et: Lahendus jooksis edukalt, kuid ei kirjutanud õigesse väljundfaili
hu: A beküldött megoldásod lefutott, de nem hozta létre a megfelelő kimeneti fájlt
ja: 提出されたプログラムは正常終了しましたが、指定されたファイルへの出力がありませんでした。
lv: Jūsu iesūtījums tika izpildīts, bet neierakstīja pareizajā izvada datnē
ro: Expedierea a rulat, dar nu a scris in fisierul corect de iesire
sl: Tvoja oddaja je bila pognana, vendar ni izpisovala v pravilno izhodno datoteko
th: โปรแกรมสามารถรันได้ แต่เขียนผิดไฟล์
uk: Ваша спроба запущена, але не вивела нічого у правильний вихідний файл

source: Execution timed out
ar: التنفيذ تجاوز حد الوقت
cs: Program vyčerpal časový limit
es_cl: Tiempo límite excedido
et: Programmi protsessori ajalimiit ületatud
hu: Időlimit túllépés
ja: 実行時間超過
lv: Pārsniegts izpildes laiks
ro: Depasirea timpului de executie
sl: Čas izvajanja je potekel
th: ใช้เวลาประมวลผลนานเกินไป
uk: Час запуску минув

source: Your submission used too much CPU time.
ar: تسليمك استغرق من وقت المعالج أكثر من الحد
cs: Odevzdané řešení spotřebovalo příliš mnoho procesorového času.
es_cl: El envío utilizó demasiado tiempo de CPU.
et: Lahenduse jooksmiseks kulus liiga palju protsessori aega.
hu: A beküldött megoldásod túl sok processzoridőt használt.
ja: 提出されたプログラムの実行が CPU 時間の制限を超えました。
lv: Jūsu iesūtījums izmantojis pārāk daudz procesora laika.
ro: Programul expediat utilizeaza prea mult timp al procesorului.
sl: Tvoja oddaja je porabila preveč procesorskega časa.
th: การส่งของคุณใช้เวลาประมวลของ CPU ผลนานเกินไป
uk: Ваша спроба використала забагато процесорного часу.

source: Execution timed out (wall clock limit exceeded)
cs: Program vyčerpal časový limit (překročený limit na reálný čas)
es_cl: Tiempo límite excedido (tiempo físico total)
et: Programmi tööaja limiit ületatud
hu: Időlimit túllépés (valós idő)
ja: 実行時間超過 (実時間)
lv: Pārsniegts izpildes laiks (pārsniegts reālā laika ierobežojums)
ro: Depasirea timpului de executie (wall clock limit exceeded)
sl: Čas izvajanja je potekel (dejanjska časovna omejitev je bila presežena)
th: ใช้เวลาประมวลผลทั้งหมดนานเกินไป
uk: Час очікування минув (перевищено ліміт настінного годинника)

source: Your submission used too much total time. This might be triggered by undefined code, or buffer overflow, for example. Note that in this case the CPU time visible in the submission details might be much smaller than the time limit.
cs: Odevzdané řešení využilo příliš mnoho celkového času. To může být např. způsobeno kódem s nedefinovaným chováním nebo přetečením bufferu. Uvědomte si, že v tomto případě může být procesorový čas zobrazený v detailech odevzdaného řešení mnohem menší než časový limit.
es_cl: El envío utilizó demasiado tiempo en total. Esto podría ser el resultado de código con comportamiento indefinido o desbordamientos (buffer overflow). Notar que en este caso, el tiempo de CPU que se muestra en los detalles podría ser muy inferior al tiempo máximo permitido.
et: Programmi tööaeg ületas lubatud piiri. Selle kõige tõenäolisem põhjus on katse lugeda rohkem sisendit, kui seda on. Aga mõnikord võivad seda põhjustada ka mitmesugused määramatused programmis, sealhulgas ka massiivide piiridest väljumine. Kuna lahendus jääb ootele, võib selle kasutatud protsessoriaeg olla protsessori ajalimiidist märksa väiksem.
hu: A megoldásod túl sok ideig futott valós időben mérve. Ezt például érvénytelen/hibás programkód, puffer túlcsordulás is okozhatja. Fontos, hogy ebben az esetben a beküldés részletes megtekintésekor mutatott processzoridő jóval kisebb lehet a feladatban megadott időlimitnél.
ja: 提出されたプログラムの実行が実時間の制限を超えました。原因として、ソースコード中の未定義動作やバッファオーバーフローなどが考えられます。詳細ページに表示される実行時間は実時間ではなく CPU 時間であるため、時間制限より小さくなりうることに注意してください。
lv: Jūsu iesūtījums kopumā ir patērējis pārāk daudz laika. Tas var būt noticis, piemēram, nedefinētas koda uzvedības vai bufera pārpildīšanās dēļ. Šādos gadījumos iesūtījuma detaļās norādītais procesora laiks var būt ievērojami mazāks nekā izpildes laika ierobežojums.
ro: Expedierea voastra a utlilzat prea mult timp total. Aceasta ar putea fi cauzata, de exemplu, de cod nedefinit sau un buffer overflow. In acest caz timpul vizibil utlilzat CPU in detaliile expedierii poate fi cu mult mai mic decat limita de timp.
sl: Tvoja oddaja je porabila preveč skupnega časa. To je lahko posledica nedefinirane kode ali preseženega medpomnilnika. V tem primeru je lahko procesorski čas, ki je viden pri podrobnostih o oddaji, precej manjši od dejanjske časovne omejitve.
th: โปรแกรมของคุณใช้เวลาประมวลผลทั้งหมดนานเกินไป อาจเป็นเพราะโค้ด undefined หรือเกิด buffer overflow
uk: Ваша спроба використала забагато загального часу. Це може бути викликано, наприклад, невизначеним кодом або переповненням буфера. Зауважте, що в цьому випадку час процесора, видимий у деталях спроби, може бути набагато меншим за обмеження часу.

source: Execution killed (could be triggered by violating memory limits)
ar: أوقف التنفيذ (قد يكون بسبب الوصول لذاكرة غير مصرح بها)
cs: Program byl ukončen (to mohlo být způsobeno překročením paměťových limitů)
es_cl: La ejecución fue terminada abruptamente (podría deberse a un exceso en el uso de memoria)
et: Programmi täitmine katkes signaali tagajärjel (võib olla tingitud mälupiirangute ületamisest)
hu: Kilőve futás közben (memóriatúllépés is okozhatja)
uk: Виконання припинено (може бути викликано порушенням обмежень пам’яті)

source: The evaluation was killed by a signal. Among other things, this might be caused by exceeding the memory limit. Note that if this is the reason, the memory usage visible in the submission details is the usage before the allocation that caused the signal.
cs: Vyhodnocování bylo ukončeno signálem. To může být způsobeno překročením paměťového limitu. Uvědomte si, že je-li to způsobeno tím, použitá paměť zobrazená v detailech odevzdaného řešení je použitá paměť před alokací, která způsobila poslání signálu.
es_cl: La evaluación fue terminada mediante una señal del sistema operativo. Entre otras cosas, esto podría deberse a un exceso en el uso de memoria. Notar que si esta fuera la razón, la memoria utilizada mostrada en los detalles de envío sería la memoria utilizada antes de la reserva de memoria que generó la señal.
et: Lahenduse jooksmine katkes signaali tagajärjel. See võib olla tingitud muuhulgas mälupiirangu ületamisest. Pane tähele, et sellisel juhul näidatakse esituse mälukastutust vahetult enne piirangu ületamist.
hu: A kiértékelés hibakóddal fejeződött be. Többek között ezt a túlzott memóriahasználat okozhatja. Fontos, ha valóban ez okozta a hibát, akkor a beküldés részletes megtekintésekor mutatott memóriahasználat a hibát kiváltó memóriafoglalás előtti állapotot mutatja.
uk: Оцінювання було знищено сигналом. Серед іншого це може бути спричинено перевищенням ліміту пам’яті. Зауважте, що якщо це причина, використання пам’яті, видиме в деталях спроби, є використанням до розподілу, який спричинив сигнал.

source: Execution failed because the return code was nonzero
ar: فشل التنفيذ لأن كود الخروج لم يساوي صفر
cs: Program selhal kvůli nenulové návratové hodnotě
es_cl: Ejecución fallida por código de retorno distinto de cero
et: Programmi täitmine ebaõnnestus, nullist erinev veakood
hu: A végrehajtás sikertelen, mert a kilépési kód nem nulla
ja: 戻り値がゼロでなかったことによる異常終了
lv: Izpilde ir nesekmīga, jo atgriešanās kods nav nulle
ro: Executia a esuat, deoarece codur de retur a fost nonzero
sl: Izvajanje je spodletelo, ker se je končala z neničelno kodo
th: การรันไม่สำเร็จ เพราะโปรแกรมคืนค่าที่ไม่ใช่ศูนย์
uk: Помилка виконання, оскільки код повернення був ненульовим

source: Your submission failed because it exited with a return code different from 0.
cs: Odevzdané řešení selhalo, protože skončilo s návratovou hodnotou odlišnou od 0.
es_cl: El envío falló porque terminó con un código de retorno (return code) distinto de 0.
et: Lahendus loeti ebaõnnestunuks, kuna selle jooksmine lõppes nullist erineva veakoodiga.
hu: A beküldött megoldásod a futás végén nem nulla kilépési kóddal fejeződött be.
ja: 提出されたプログラムはゼロではない戻り値を返したため、正常終了することができませんでした。
lv: Jūsu iesūtījums ir neveiksmīgs, jo tas beidzies ar nenulles atgriešanās kodu.
ro: Expedierea a esuat deoarece aceasta a iesit cu un cod diferit de 0.
sl: Tvoja oddaja je spodletela, ker se je končala s kodo drugačno od 0.
th: การรันไม่สำเร็จ เพราะโปรแกรมคืนค่าที่ไม่ใช่ศูนย์
uk: Ваше надсилання не виконано, оскільки він завершився з кодом повернення, відмінним від 0.

source: Execution completed successfully
cs: Spuštění programu skončilo úspěšně
es_cl: Ejecución completada de manera exitosa
et: Prorammi täitmine õnnestus
hu: Sikeres végrehajtás
ja: 正常終了
lv: Izpilde beigusies sekmīgi
ro: Executie reusita
sl: Izvajanje se je uspešno zaključilo
th: การรันสำเร็จ
uk: Виконання успішно завершено

source: No compilation needed
cs: Kompilace není potřeba
es_cl: No se requiere compilación
et: Kompileerimine pole vajalik
hu: Nincs szükség fordításra
ja: コンパイル不要
lv: Kompilēšana nav nepieciešama
ro: Compilarea nu este necesara
sl: Prevajanje ni potrebno
th: ไม่จำเป็นต้องคอมไพล์
uk: Компіляція не потрібна

source: File not submitted
cs: Soubor neodevzdán
es_cl: Archivo no enviado
et: Faili pole esitatud
hu: A fájl nem került beküldésre
ja: ファイル未提出
lv: Datne nav iesūtīta
ro: Fisierul nu a fost expediat
sl: Datoteka ni bila oddana
th: ไฟล์ไม่ถูกส่ง
uk: Файл не надіслано

source: Question too long!
ar: السؤال طويل جدًا!
cs: Příliš dlouhá otázka!
es_cl: ¡La pregunta es demasiado larga!
et: Küsimus on liiga pikk!
hu: Túl hosszú a kérdés!
ro: Intrebare prea lunga!
th: คำถามยาวเกินไป!
uk: Питання занадто довге!

source: Subject must be at most %(max_subject_length)d characters, content at most %(max_text_length)d.
cs: Předmět může mít maximálně %(max_subject_length)d znaků a text maximálně %(max_text_length)d znaků.
es_cl: El asunto debe tener una longitud máxima de %(max_subject_length)d caracteres, y el contenido una longitud máxima de %(max_text_length)d caracteres.
et: Küsimuse pealkiri peab olema maksimaalselt %(max_subject_length)d tähemärki, küsimuse sisu maksimaalselt %(max_text_length)d tähemärki.
hu: A tárgy maximum %(max_subject_length)d karakter, míg a szöveg maximum %(max_text_length)d karakter hosszú lehet.
ro: Subiectul trebuie sa aibe maxim %(max_subject_length)d caractere, iar continutul maxim %(max_text_length)d caractere.
th: หัวข้อสามารถมีได้ไม่เกิน %(max_subject_length)d ตัวอักษร, เนื้อหาสามารถมีได้ไม่เกิน %(max_text_length)d ตัวอักษร
uk: Тема має містити щонайбільше %(max_subject_length)d символів, а вміст – не більше %(max_text_length)d.

source: contest-token
cs: soutěžní token
et: võistluse pilet
hu: verseny-zseton
ja: コンテストトークン
lv: sacensību žetons
ro: jeton de concurs
sl: tekmovalni-žeton
th: โทเค็นการแข่งขัน
uk: токен змагання

source: contest-tokens
cs: soutěžní tokeny
et: võistluse pilet
hu: verseny-zseton
ja: コンテストトークン
lv: sacensību žetoni
ro: jetoane de concurs
sl: tekmovalni-žetoni
th: โทเค็นการแข่งขัน
uk: токени змагання

source: task-token
cs: úlohový token
et: ülesande pilet
hu: feladat-zseton
ja: 課題トークン
lv: uzdevuma žetons
ro: jeton de sarcina
sl: naloga-žeton
th: โทเค็นโจทย์
uk: токен завдання

source: task-tokens
cs: úlohové tokeny
et: ülesande pilet
hu: feladat-zseton
ja: 課題トークン
lv: uzdevuma žetoni
ro: jetoane de sarcina
sl: naloga-žetoni
th: โทเค็นโจทย์
uk: токени завдання

source: token
et: pilet
hu: zseton
ja: トークン
lv: žetons
ro: jeton
sl: žeton
th: โทเค็น
uk: токен

source: tokens
cs: tokeny
et: pilet
hu: zsetonok
ja: トークン
lv: žetoni
ro: jetoane
sl: žetoni
th: โทเค็น
uk: токени
