Repository: cms-dev/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: ar, cs, es_cl, et, hu, ja, lv, ro, sl, th, uk, zh_cn

source: Right now, you have one token available on this task.
cs: Právě teď máte pro tuto úlohu k dispozici jeden token.
es_cl: En este momento, usted tiene un token disponible para este problema.
et: Praegu on Teil selle ülesande lahenduste esitamiseks üks pilet.
hu: Jelenleg egy zsetonod van ehhez a feladathoz.
ja: 現在、この課題では1個のトークンが使用できます。
lv: Šobrīd šim uzdevumam jums ir pieejams viens žetons.
ro: Acum pentru aceasta sarcina aveti un token.
sl: Trenutno nimaš na voljo nobenega žetona za to nalogo.
th: ขณะนี้ คุณมีโทเค็น 1 โทเค็นสำหรับโจทย์นี้
uk: Зараз у вас є один токен для цієї задачі.
zh_cn: 目前拥有一个 Token 可供使用于本题。

source: Right now, you have %(tokens)s tokens available on this task.
cs: Právě teď máte pro tuto úlohu k dispozici %(tokens)s tokenů.
es_cl: En este momento, tienes %(tokens)s tokens disponibles para este problema.
et: Praegu on Teil selle ülesande lahenduste esitamiseks %(tokens)s piletit.
hu: Jelenleg %(tokens)s zsetonod van ehhez a feladathoz.
ja: 現在、この課題では %(tokens)s 個のトークンが使用できます。
lv: Šobrīd šim uzdevumam jums ir pieejami %(tokens)s žetoni.
ro: Acum pentru aceasta sarcina aveti %(tokens)s token-e.
sl: Trenutno imaš na voljo %(tokens)s žetonov za to nalogo.
th: ขณะนี้ คุณมีโทเค็น %(tokens)s โทเค็นสำหรับโจทย์นี้
uk: Зараз у вас є %(tokens)s токенів для цієї задачі.
zh_cn: 目前拥有 %(tokens)s 个 Token 可供使用于本题。

source: But you have to wait until %(expiration_time)s to use them.
cs: Ale na jejich použití musíte počkat do %(expiration_time)s.
es_cl: Pero debe esperar hasta %(expiration_time)s para utilizarlos.
et: Kuid Te peate ootama kuni %(expiration_time)s, et neid kasutada.
hu: De várnod kell %(expiration_time)s időpontig, hogy használhasd őket.
ja: しかし、それを使用するためには %(expiration_time)s 待つ必要があります。
lv: Bet, lai tos izmantotu, nepieciešams pagaidīt līdz %(expiration_time)s.
ro: Dar le veti putea utiliza doar dupa %(expiration_time)s.
sl: Vendar moraš počakati do %(expiration_time)s, da jih lahko uporabiš.
th: แต่คุณจะต้องรอจนถึง %(expiration_time)s จึงจะสามารถใช้ได้
uk: Але вам доведеться почекати до %(expiration_time)s, щоб використати їх.
zh_cn: 但需等待至 %(expiration_time)s 后才可再次使用 Token。

source: You will receive a new token at %(gen_time)s.
cs: Obdržíte nový token v %(gen_time)s.
es_cl: Recibirás un nuevo token a las %(gen_time)s.
et: Te saate uue pileti %(gen_time)s.
hu: Új zsetont kapsz %(gen_time)s időpontban.
ja: 新しいトークンを %(gen_time)s に受け取ることができます。
lv: Jūs saņemsiet jaunu žetonu %(gen_time)s.
ro: Veti primi un token nou in %(gen_time)s.
sl: Nov žeton prejmeš ob %(gen_time)s.
th: คุณจะได้รับโทเค็นใหม่เวลา %(gen_time)s.
uk: Ви отримаєте новий токен в %(gen_time)s.
zh_cn: 在 %(gen_time)s 可以获得一个新的 Token。

source: In the current situation, no more tokens will be generated.
cs: V současné situaci nebudou vygenerované žádné další tokeny.
es_cl: En la situación actual, no se generarán más tokens.
et: Praeguses olukorras uusi pileteid ei anta.
hu: Pillanatnyilag nem kapsz további zsetonokat.
ja: 現在の状況では、新規にトークンが生成されることはありません。
lv: Šajā situācijā vairāk žetoni netiks ģenerēti.
ro: In situatia actuala, nu vor mai fi generate alte token-e.
sl: V danih okoliščinah ne bo proizveden noben nov žeton več.
th: จะไม่มีการแจกโทเค็นอีกแล้ว
uk: У поточній ситуації не будуть створені нові токени.
zh_cn: 将不会再有新的 Token 产生。

source: Right now, you do not have tokens available for this task.
cs: Právě teď nemáte pro tuto úlohu k dispozici žádný token.
es_cl: En este momento, no tienes tokens disponibles para este problema.
et: Praegu pole teil selle ülesande esitamiseks pileteid.
hu: Jelenleg nincs zsetonod ehhez a feladathoz.
ja: 現在、この課題で使用可能なトークンはありません。
lv: Šobrīd jums šim uzdevumam nav žetonu.
ro: Acum, nu aveti niciun jeton valid valabil pentru aceasta sarcina.
sl: Trenutno nimaš na voljo nobenega žetona za to nalogo.
th: คุณไม่เหลือโทเค็นสำหรับโจทย์ข้อนี้แล้ว
uk: Зараз у вас немає доступних токенів для цієї задачі.
zh_cn: 现在，本题 Token 已用尽。

source: But you will have to wait until %(expiration_time)s to use it.
cs: Ale k jeho použití musíte počkat do %(expiration_time)s.
es_cl: Pero debes esperar hasta %(expiration_time)s para utilizarlo.
et: Te peate ootama kuni %(expiration_time)s, et seda kasutada.
hu: De várnod kell %(expiration_time)s időpontig, hogy használhasd.
ja: しかし、そのトークンを使用するためには %(expiration_time)s 待つ必要があります。
lv: Bet, lai to izmantotu, nepieciešams pagaidīt līdz %(expiration_time)s.
ro: Dar il veti putea utiliza doar dupa %(expiration_time)s.
sl: Vendar moraš počakati do %(expiration_time)s, da ga lahko uporabiš.
th: แต่คุณจะต้องรอจนถึง %(expiration_time)s ในการใช้.
uk: Але вам доведеться почекати до %(expiration_time)s, щоб використати його.
zh_cn: 但需等待 %(expiration_time)s 后才可再次使用 Token。

source: Unofficial submissions
ar: التسليمات غير الرسمية
cs: Neoficiální řešení
es_cl: Envíos no oficiales
et: Mitteametlikud esitused
hu: Nem hivatalos beküldések
ro: Expedieri neoficiale
th: การส่งที่ไม่เป็นทางการ
uk: Неофіційні спроби

source: Official submissions
ar: التسليمات الرسمية
cs: Oficiální řešení
es_cl: Envíos oficiales
et: Ametlikud esitused
hu: Hivatalos beküldések
ro: Expedieri oficiale
th: การส่งที่เป็นทางการ
uk: Офіційні спроби

source: Submission details
ar: تفاصيل التسليم
cs: Detaily odevzdaného řešení
es_cl: Detalles del envío
et: Esitatud lahenduse andmed
hu: Beküldés részletei
ja: 提出の詳細
lv: Iesūtījuma detaļas
ro: Detaliile expedierii
sl: Podrobnosti oddaje
th: รายละเอียดการส่ง
uk: Деталі спроби
zh_cn: 提交详细信息

source: Close
ar: إغلاق
cs: Zavřít
es_cl: Cerrar
et: Sulge
hu: Bezárás
ja: 閉じる
lv: Aizvērt
ro: Inchide
sl: Zapri
th: ปิด
uk: Закрити
zh_cn: 关闭

source: Download
ar: تنزيل
cs: Stáhnout
es_cl: Descargar
et: Lae alla
hu: Letöltés
ja: ダウンロード
lv: Lejuplādēt
ro: Descarca
sl: Prenesi
th: ดาวน์โหลด
uk: Завантажити
zh_cn: 下载

source: Submit a test
cs: Nahrát test
es_cl: Enviar un test
et: Esita test
hu: Teszt beküldése
ja: テストを要求する
lv: Iesūtīt testu
ro: Trimite testul
sl: Oddaj preizkus
th: ส่งชุดทดสอบ
uk: Надіслати тест
zh_cn: 提交测试

source: You can submit %(user_tests_left)s more test(s).
cs: Můžete nahrát ještě %(user_tests_left)s testů.
es_cl: Usted puede enviar %(user_tests_left)s tests más.
et: Võite esitada veel %(user_tests_left)s testi.
hu: Még %(user_tests_left)s alkalommal küldhetsz be tesztet.
ja: あなたはテストをあと %(user_tests_left)s 回要求できます。
lv: Jūs drīkstat iesūtīt vēl %(user_tests_left)s testu(s).
ro: Puteti expedia pana la %(user_tests_left)s de teste.
sl: Oddaš lahko še %(user_tests_left)s preizkusov.
th: คุณสามารถส่งได้อีก %(user_tests_left)s ชุดทดสอบ
uk: Ви можете надіслати ще %(user_tests_left)s тестів.
zh_cn: 您可以再提交 %(user_tests_left)s 次测试。

source: input
ar: المدخلات
cs: vstup
es_cl: entrada
et: sisend
hu: bemenet
ja: 入力
lv: ievaddati
ro: date de intrare
sl: vhod
th: ข้อมูลนำเข้า
uk: вхідні дані
zh_cn: 输入

source: Previous tests
cs: Předchozí testy
es_cl: Tests anteriores
et: Eelmised testid
hu: Korábbi tesztek
ja: 以前のテスト
lv: Iepriekšējie testi
ro: Teste precedente
sl: Predhodni preizkusi
th: ชุดทดสอบก่อนหน้า
uk: Попередні тести
zh_cn: 测试记录

source: Input
ar: المدخلات
cs: Vstup
es_cl: Entrada
et: Sisend
hu: Bemenet
ja: 入力
lv: Ievaddati
ro: Date de intrare
sl: Vhod
th: ข้อมูลนำเข้า
uk: Вхідні дані
zh_cn: 输入

source: Output
ar: المخرجات
cs: Výstup
es_cl: Salida
et: Väljund
hu: Kimenet
ja: 出力
lv: Izvaddati
ro: Date de iesire
sl: Izhod
th: ข้อมูลส่งออก
uk: Вихідні дані
zh_cn: 输出

source: no tests yet
cs: zatím žádné testy
es_cl: ningún test aún
et: teste ei ole
hu: nincsenek tesztek
ja: まだテストはありません
lv: pagaidām nav testu
ro: nu sunt teste
sl: trenutno ni preizkusov
th: ยังไม่มีชุดทดสอบ
uk: ще немає тестів
zh_cn: 尚未测试

source: Test details
cs: Detaily testu
es_cl: Detalles de test
et: Testi andmed
hu: Teszt részletei
ja: テストの詳細
lv: Testa detaļas
ro: Detaliile testului
sl: Podrobnosti preizkusa
th: รายละเอียดชุดทดสอบ
uk: Деталі тесту
zh_cn: 测试详细资料

source: Evaluation outcome
cs: Výsledek vyhodnocení
es_cl: Resultado de la evaluación
et: Testimise tulemus
hu: Kiértékelés eredménye
ja: 実行結果
lv: Izpildes iznākums
ro: Rezultatele evaluarii
sl: Rezultat ovrednotenja
th: ผลการประเมิน
uk: Результат оцінювання
zh_cn: 测试信息

source: Wait...
ar: انتظر...
cs: Počkejte...
es_cl: Espere...
et: Oota...
hu: Várj...
ja: お待ちください…
lv: Gaidiet…
ro: Asteptati...
sl: Počakaj...
th: รอ...
uk: Чекайте...
zh_cn: 等待中...

source: None
ar: لا شيء
cs: Žádné
es_cl: Ninguno
et: Puudub
hu: Egyik sem
ja: なし
lv: Nekas
ro: Lipsa
sl: Brez
th: ไม่มี
uk: Немає
zh_cn: 无

source: Public score
ar: الدرجة الظاهرة
cs: Veřejné skóre
es_cl: Puntaje público
et: Avalikud punktid
hu: Nyilvános pontszám
ja: 公開得点
lv: Publiski redzamais rezultāts
ro: Scorul public
sl: Javne točke
th: คะแนนสาธารณะ
uk: Публічний бал
zh_cn: 公开得分

source: Total score
ar: الدرجة الكلية
cs: Celkové skóre
es_cl: Puntaje total
et: Punktid kokku
hu: Teljes pontszám
ja: 合計得点
lv: Kopējais rezultāts
ro: Scorul total
sl: Skupne točke
th: คะแนนรวม
uk: Сумарний бал
zh_cn: 总得分

source: Score
ar: الدرجة
cs: Skóre
es_cl: Puntaje
et: Punktid
hu: Pontszám
ja: 得点
lv: Rezultāts
ro: Scorul
sl: Točke
th: คะแนน
uk: Бал
zh_cn: 得分

source: Token
et: Pilet
hu: Zseton
ja: トークン
lv: Žetons
ro: Jeton
sl: Žeton
th: โทเค็น
uk: Токен

source: no submissions
ar: لا تسليمات
cs: žádná odevzdaná řešení
es_cl: no hay envíos
hu: nincsenek beküldések
ro: nicio expediere
th: ไม่มีการส่ง
uk: немає спроб

source: Played
cs: Zahráno
es_cl: Token utilizado
hu: Felhasználva
ja: 解禁済
lv: Izmantots
ro: Jucat
sl: Igrano
th: เล่น
uk: Зіграно
zh_cn: 已使用

source: Play!
cs: Zahrát!
es_cl: ¡Usar token!
hu: Felhasznál
ja: 解禁!
lv: Izmantot!
ro: Joaca!
sl: Igraj!
th: เล่น!
uk: Грати!
zh_cn: 现在使用

source: No tokens
cs: Žádné tokeny
es_cl: Sin tokens
hu: Nincs zseton
ja: トークン無し
lv: Nav žetonu
ro: Nu mai sunt jetoane
sl: Ni žetonov
th: ไม่มีโทเค็น
uk: Немає токенів
zh_cn: Token 已用尽

source: Invalid file
ar: ملف غير صالح
cs: Neplatný soubor
es_cl: Archivo inválido
hu: Érvénytelen fájl
th: ไฟล์ไม่ถูกต้อง
uk: Неправильний файл

source: Print job has too many pages
cs: Tisková úloha má moc stránek
es_cl: El trabajo de impresión tiene demasiadas páginas
hu: A nyomtatandó dokumentum túl sok oldalt tartalmaz
th: งานพิมพ์มีจำนวนหน้ามากเกินไป
uk: Завдання для друку містить забагато сторінок

source: Sent to printer
cs: Odeslat do tiskárny
es_cl: Enviado a la impresora
hu: Elküldve a nyomtatónak
th: ส่งไปยังเครื่องพิมพ์
uk: Відправлено на принтер

source: Memory limit exceeded
ro: Limita de memorie depasita
th: ใช้หน่วยความจำมากเกินไป

source: Your submission used too much memory.
ro: Programul expediat utilizeaza prea multa memorie.
th: โปรแกรมคุณใช้หน่วยความจำมากเกินไป

source: Execution killed by signal
ro: Executie intrerupta de semnal
th: โปรแกรมของคุณถูก kill ด้วยค่า signal

source: The evaluation was killed by a signal.
ro: Evaluarea a fost intrerupta de un semnal.
th: การตรวจถูก kill ด้วยค่า signal

source: The submission should contain at most %d files.
ro: Expedierea nu poate contine mai mult de %d fisiere.
th: การส่งควรมีไม่เกิน%dไฟล์

source: GNU Affero General Public License
ar: رخصة جنو أفيرو العامة
cs: licencí GNU Affero General Public
es_cl: licencia pública general de Affero (GNU AGPL)
et: GNU Affero General Public License tingimustele
lv: GNU Affero vispārējo publisko licenci
zh_cn: GNU AGPL 通用公共许可证

source: submission.zip
es_cl: envio.zip
et: lahendus.zip
lv: iesūtījums.zip
ro: expediere.zip
sl: oddaja.zip

source: Your submission successfully compiled to an excutable.
ja: 提出されたファイルのコンパイルに成功しました。
lv: Jūsu iesūtījums veiksmīgi nokompilēts izpildāmā programmā.

source: Execution killed with signal %d (could be triggered by violating memory limits)
ja: シグナル %d による強制終了 (メモリ制限違反の可能性もあります)
lv: Izpilde pārtraukta ar signālu %d (to var būt izsaukusi atmiņas apjoma ierobežojumu neievērošana)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit. Note that if this is the reason, the memory usage visible in the submission details is the usage before the allocation that caused the signal.
ja: 提出されたプログラムは強制終了されました。原因としてさまざまなものが考えられますが、例えばメモリ制限の超過が原因かもしれません。もしメモリ制限の超過によって強制終了された場合には、詳細ページに表示される消費メモリの量が、メモリ制限を超える直前に消費していたメモリの量を示していることに注意してください。
lv: Jūsu iesūtījuma izpilde pārtraukta ar norādītu signālu. Cita starpā, to var būt izsaukusi atmiņas apjoma ierobežojumu neievērošana. Ja tas ir īstais iemesls, tad izmantotās atmiņas apjoms, kas norādīts iesūtījuma izpildes detaļās, ir apjoms, kas tika atvēlēts pirms tika mēģināts izdalīt atmiņu, kas izraisīja signālu.

source: Execution killed because of forbidden syscall %s
ja: 禁止されたシステムコール %s を発行したことによる強制終了
lv: Izpilde pārtraukta aizliegta sistēmas izsaukuma %s dēļ

source: Your submission was killed because it tried to use the forbidden syscall specified in the message.
ja: 禁止されたシステムコールを呼び出そうとしたため、提出されたプログラムは強制終了されました。
lv: Jūsu iesūtījums ir mēģinājis veikt aizliegtu sistēmas izsaukumu, kas norādīts ziņojumā, un tā izpilde ir pārtraukta.

source: Execution killed because of forbidden file access
ja: 禁止されたファイルアクセスを行ったことによる強制終了
lv: Izpilde pārtraukta neatļautas datņu piekļūšanas dēļ

source: Your submission was killed because it tried to read or write a forbidden file.
ja: 禁止されたファイルへの読み込みまたは書き込みを行おうとしたため、提出されたプログラムは強制終了されました。
lv: Jūsu iesūtījums ir mēģinājis lasīt vai rakstīt neatļautā datnē, un tā izpilde ir pārtraukta.

source: N/A
ar: لا يوجد
hu: nem elérhető
lv: Nav pieejams
sl: Ni odgovora

source: Subtask %d
ja: 小課題 %d
lv: %d. apakšuzdevums

source: Invalid files in submission
ja: 無効なファイルを含む提出
lv: Iesūtījumā ir nepareizas datnes

source: %Y-%m-%d
lv: %d.%m.%Y

source: %Y-%m-%d %H:%M:%S
lv: %d.%m.%Y %H:%M:%S

source: %d second
ja: %d 秒
lv: %d sekunde

source: %d minute
ja: %d 分
lv: %d minūte

source: %d hour
ja: %d 時間
lv: %d stunda

source: %d day
ja: %d 日
lv: %d diena

source: %s and %s
ja: %s と %s
lv: %s un %s

source: more than %s
ja: %s と少し
lv: vairāk kā %s

source: Question too big!
ja: 質問が長すぎます!
lv: Jautājums pārāk garš!

source: You have reached the question length limit.
ja: 質問の長さに対する制限を超えています。
lv: Jūs esat sasniedzis jautājuma garuma ierobežojumu.

source: Cannot recognize the submission language.
ja: 提出されたファイルがどのプログラミング言語で書かれているか判定することができません。
lv: Nav iespējams atpazīt iesūtījuma valodu.

source: Language %s not allowed in this contest.
ja: プログラミング言語 %s はこのコンテストでは使用できません。
lv: Šajās sacensībās nav atļauts izmantot valodu %s.

source: Invalid submission!
ja: 無効な提出です!
lv: Nederīgs iesūtījums!

source: Cannot recognize the user test language.
ja: テスト用ソースコードのプログラミング言語を判定することができません。
lv: Nav iespējams atpazīt lietotāja testa valodu.

source: Invalid test!
ja: 無効なテスト要求です!
lv: Nepareizs tests!

source: Automatic (%s)
ja: 自動 (%s)
lv: Automātiski (%s)

source: Contest Management System
ar: نظام إدارة المسابقات
cs: Systém pro správu soutěží
hu: A Contest Management System
ja: コンテスト管理システム (CMS)
lv: Sacensību Vadīšanas Sistēma
zh_cn: 本系统

source: Error %d
ja: エラー %d
lv: Kļūda %d

source: {seconds:g} second
lv: {seconds:g} sekunde

source: {seconds:g} seconds
lv: {seconds:g} sekundes

source: You can print %(remaining_jobs)d more text or PDF files of up to %(max_pages)d pages each.
ja: あなたは %(max_pages)d ページ以下のテキストまたはPDFファイルをあと %(remaining_jobs)d 回印刷できます。
lv: Jūs drīkstat izdrukāt vēl %(remaining_jobs)d teksta vai PDF datnes (katru ne garāku par %(max_pages)d lappusēm).

source: You can print %(remaining_jobs)d more text files of up to %(max_pages)d pages each.
ja: あなたは %(max_pages)d ページ以下のテキストファイルをあと %(remaining_jobs)d 回印刷できます。
lv: Jūs drīkstat izdrukāt vēl %(remaining_jobs)d teksta datnes (katru ne garāku par %(max_pages)d lappusēm).

source: Statement in <b>%s</b>
ja: 問題文 (<b>%s</b>)
lv: Formulējums valodā: <b>%s</b>

source: Statement in %s
ja: 問題文 (%s)
lv: Formulējums valodā: %s

source: Remeber that to see the detailed result of a submission you need to use both a contest-token and a task-token.
ja: 提出に対する詳細な結果を見るためには、コンテストトークンと課題トークンの両方を使用する必要があることに注意してください。
lv: Lai aplūkotu iesūtījuma detalizētus rezultātus, nepieciešams izmantot gan sacensību, gan uzdevuma žetonu.

source: Official
lv: Ieskaitīts

source: no submissions yet
ja: まだ提出はありません
lv: pagaidām nav iesūtījumu

source: %(seconds)0.3f s
ja: %(seconds)0.3f 秒

source: %(seconds)g second
ja: %(seconds)g 秒

source: %(seconds)g seconds
ja: %(seconds)g 秒

source: You can find the rules for the %(type_pl)s on the <a href="%(url_root)s/">contest overview page</a>.
ja: %(type_pl)sの使用に関する規則は、<a href="%(url_root)s/">コンテストの概要ページ</a>を参照してください。
