Repository: cms-dev/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: ar, cs, es_cl, et, hu, ja, lv, ro, sl, th, uk, zh_cn

source: The contest is currently running.
ar: المسابقة حية الآن.
cs: Soutěž právě probíhá.
es_cl: La competencia ya comenzó
et: Võistlus käib.
hu: A verseny jelenleg zajlik.
ja: コンテストは現在実施中です。
lv: Sacensības notiek.
ro: Concursul este in curs de desfasurare.
sl: Tekmovanje je v teku.
th: อยู่ในระหว่างการแข่งขัน
uk: Наразі змагання триває.
zh_cn: 竞赛进行中。

source: The contest started at %(start_time)s and will end at %(stop_time)s.
cs: Soutěž začala %(start_time)s a skončí %(stop_time)s.
es_cl: La competencia comenzó a las %(start_time)s y finalizará a las %(stop_time)s.
et: Võistlus algas %(start_time)s ja lõppeb %(stop_time)s.
hu: A verseny %(start_time)s időpontban kezdődött el, és %(stop_time)s időpontban fog véget érni.
ja: コンテストは %(start_time)s に始まりました。%(stop_time)s に終わる予定です。
lv: Sacensības ir sākušās %(start_time)s un beigsies %(stop_time)s.
ro: Concursul a inceput la %(start_time)s si se va sfarsi la %(stop_time)s.
sl: Tekmovanje se je začelo ob %(start_time)s in se bo končalo ob %(stop_time)s.
th: การแข่งขันนี้เริ่มต้นไปแล้วเมื่อ %(start_time)s และจะสิ้นสุดเมื่อ %(stop_time)s.
uk: Змагання розпочалося о %(start_time)s і завершиться о %(stop_time)s.
zh_cn: 竞赛时间为 %(start_time)s 至 %(stop_time)s。

source: The contest has already ended.
ar: المسابقة قد انتهت.
cs: Soutěž již skončila.
es_cl: La competencia ya finalizó.
et: Võistlus on juba lõppenud.
hu: A verseny már bejeződött.
ja: コンテストは終了しました。
lv: Sacensības jau ir beigušās.
ro: Concursul s-a sfarsit.
sl: Tekmovanje se je že končalo.
th: การแข่งขันนี้ได้สิ้นสุดลงแล้ว
uk: Змагання вже завершилося.
zh_cn: 竞赛已经结束。

source: The contest started at %(start_time)s and ended at %(stop_time)s.
cs: Soutěž začala %(start_time)s a skončila %(stop_time)s.
es_cl: La competencia comenzó a las %(start_time)s y finalizó a las %(stop_time)s.
et: Võistlus algas %(start_time)s ja lõppes %(stop_time)s.
hu: A verseny %(start_time)s időpontban kezdődött el, és %(stop_time)s időpontban ért véget.
ja: コンテストは %(start_time)s に始まり、%(stop_time)s に終わりました。
lv: Sacensības sākās %(start_time)s un beidzās %(stop_time)s.
ro: Concursul a inceput la %(start_time)s si s-a sfarsit la %(stop_time)s.
sl: Tekmovanje se bo začelo ob %(start_time)s in končalo ob %(stop_time)s.
th: การแข่งขันนี้เริ่มต้นไปแล้วเมื่อ %(start_time)s และสิ้นสุดไปแล้วเมื่อ %(stop_time)s.
uk: Змагання розпочалося о %(start_time)s і завершилося о %(stop_time)s.
zh_cn: 竞赛时间於 %(start_time)s 开始，并已於 %(stop_time)s 结束。

source: The analysis mode hasn't started yet.
cs: Analýza ještě nezačala.
es_cl: La fase de análisis no ha comenzado aún.
et: Järellahendamine ei ole veel alanud.
hu: Az analízis mód még nem kezdődött el.
lv: Pēcsacensību režīms vēl nav sācies.
ro: Analiza nu a inceput inca.
th: โหมดการวิเคราะห์ยังไม่ได้เริ่มต้นขึ้น
uk: Режим аналізу ще не почався.

source: The analysis mode will start at %(start_time)s and will end at %(stop_time)s.
cs: Analýza začne %(start_time)s a skončí %(stop_time)s.
es_cl: La fase de análisis comenzará a las %(start_time)s y finalizará a las %(stop_time)s.
et: Järellahendamine algab %(start_time)s ja lõppeb %(stop_time)s.
hu: Az analízis mód %(start_time)s időpontban fog elkezdődni, és %(stop_time)s időpontban fog véget érni.
lv: Pēcsacensību režīms sāksies %(start_time)s un beigsies %(stop_time)s.
ro: Analiza va incepe la %(start_time)s si se va sfarsi la %(stop_time)s.
th: โหมดการวิเคราะห์จะเริ่มต้นเมื่อ %(start_time)s และจะสิ้นสุดเมื่อ %(stop_time)s.
uk: Режим аналізу розпочнеться о %(start_time)s і закінчиться о %(stop_time)s.

source: The analysis mode is currently running.
cs: Analýza právě probíhá.
es_cl: La fase de análisis ya comenzó.
et: Järellahendamine käib.
hu: Az analízis mód jelenleg bekapcsolva.
lv: Pēcsacensību režīms ir aktīvs.
ro: Analiza este in curs de desfasurare.
th: โหมดการวิเคราะห์กำลังดำเนินอยู่
uk: Зараз працює режим аналізу.

source: The analysis mode started at %(start_time)s and will end at %(stop_time)s.
cs: Analýza začala %(start_time)s a skončí %(stop_time)s.
es_cl: La fase de análisis comenzó a las %(start_time)s y finalizará a las %(stop_time)s.
et: Järellahendamine algas %(start_time)s ja lõppeb %(stop_time)s.
hu: Az analízis mód %(start_time)s időpontban kezdődött el, és %(stop_time)s időpontban fog véget érni.
lv: Pēcsacensību režīms ir sācies %(start_time)s un beigsies %(stop_time)s.
ro: Analiza a inceput la %(start_time)s si se va sfarsi la %(stop_time)s.
th: โหมดการวิเคราะห์เริ่มต้นไปแล้วเมื่อ %(start_time)s และจะสิ้นสุดเมื่อ %(stop_time)s.
uk: Режим аналізу почався о %(start_time)s і закінчиться о %(stop_time)s.

source: The analysis mode has already ended.
cs: Analýza již skončila.
es_cl: La fase de análisis ya finalizó.
et: Järellahendamine on juba lõppenud.
hu: Az analízis mód befejeződött.
lv: Pēcsacensību režīms jau ir beidzies.
ro: Analiza s-a sfarsit.
th: โหมดการวิเคราะห์ได้สิ้นสุดไปแล้ว
uk: Режим аналізу вже закінчився.

source: The analysis mode started at %(start_time)s and ended at %(stop_time)s.
cs: Analýza začala %(start_time)s a skončila %(stop_time)s.
es_cl: La fase de análisis comenzó a las %(start_time)s y finalizó a las %(stop_time)s.
et: Järellahendamine algas %(start_time)s ja lõppes %(stop_time)s.
hu: Az analízis mód %(start_time)s időpontban kezdődött el, és %(stop_time)s időpontban ért véget.
lv: Pēcsacensību režīms sākās %(start_time)s un beidzās %(stop_time)s.
ro: Analiza a inceput la %(start_time)s si s-a sfarsit la %(stop_time)s.
th: โหมดการวิเคราะห์ได้เริ่มต้นเมื่อ %(start_time)s และได้สิ้นสุดเมื่อ %(stop_time)s.
uk: Режим аналізу почався о %(start_time)s і закінчився о %(stop_time)s.

source: You have an infinite number of tokens.
ar: لديك عدد لا نهائي من الtokens
cs: Máte neomezený počet tokenů.
es_cl: Tienes un número ilimitado de tokens.
et: Teil on lõpmatu arv pileteid.
hu: Végtelen zsetonod van.
ja: トークンが無制限に使用できます。
lv: Jums ir neierobežots skaits žetonu.
ro: Aveti un numar nelimitat de token-e.
sl: Imaš neomejeno število žetonov
th: คุณมีโทเค็นจำนวนไม่จำกัด
uk: У вас є нескінченна кількість токенів.
zh_cn: 在本题中有无限量的 Token 可供使用。

source: You can see the detailed result of a submission by using a token on it.
cs: Detailní výsledky odevzdaného řešení si můžete prohlédnout, použijete-li na toto řešení token.
es_cl: Puedes ver el resultado detallado de un envío utilizando un token sobre el mismo.
et: Te saate lahenduse detailseid tulemusi näha, kui kasutate sellel piletit.
hu: Zsetonok felhasználásával megtekintheted egy beküldés részleteit.
ja: トークンを使用することによって、提出に対する詳細な結果を見ることができます。
lv: Detalizētus iesūtījuma rezultātus jūs varēsiet aplūkot, ja izmantosiet žetonu.
ro: Puteti vizualiza rezultatele detaliate ale expedierilor, utilizint token-ul.
sl: Podrobnejši rezultat lahko vidiš, če uporabiš žeton.
th: คุณสามารถดูผลลัพธ์อย่างละเอียดของการส่งได้โดยใช้โทเค็น
uk: Ви можете побачити детальний результат спроби, використовуючи токен на ньому.
zh_cn: 使用 Token 后，即可看到详细结果。

source: Your score for each task will be the maximum among the tokened submissions and the last one.
cs: Vaše skóre bude pro každou úlohu maximum z výsledků řešení, na které byl použitý token, a posledního.
es_cl: Tu puntaje en cada problema será el máximo entre los envíos con token, y el último envío realizado.
et: Ülesande punktide arvu loetakse kui maksimumi Teie viimasest lahendusest ning kõigist kasutatud piletiga lahendustest.
ja: 各課題の得点として、トークンを使用した全ての提出および最後の提出によって得た得点のうち、最大のものが採用されます。
lv: Katram uzdevumam iegūtais punktu skaits būs lielākais starp iesūtījumiem, kuriem izmantoti žetoni, un pēdējo iesūtīto.
ro: Scorul vostru pentru fiecare sarcina va fi maximumul dintre expedierile tokenizate si ultima expediere.
sl: Točke za nalogo bodo dodeljene kot največje število točk med oddajami z žetoni in zadnjo oddajo.
th: คะแนนของคุณสำหรับแต่ละข้อจะเป็นคะแนนสูงสุดในบรรดางานที่ส่งโทเค็นทั้งหมดและงานสุดท้าย
uk: Ваш бал за кожне завдання буде максимальним серед спроб (з токеном) і останнього.
zh_cn: 本题的最终得分将以所有使用 Token 的提交或最后一次提交（无论是否使用 Token）所得的最高总分计算。

source: You have a distinct set of tokens for each task.
cs: Pro každou úlohu máte vlastní sadu tokenů.
es_cl: Tienes un conjunto de tokens diferentes para cada problema.
et: Teil on iga ülesande jaoks eraldi komplekt pileteid.
hu: Vannak zsetonjaid, amin nem osztoznak a feladatok.
ja: 課題ごとに別々のトークンが与えられます。
lv: Jums ir atsevišķi žetoni katram uzdevumam.
ro: Aveti un set diferit de tokenuri pentru fiecare sarcina.
sl: Za vsako nalogo je na voljo ločen nabor žetonov.
th: คุณมีชุดโทเค็นที่แตกต่างกันสำหรับแต่ละข้อ
uk: У вас є окремий набір токенів для кожного завдання.
zh_cn: 每题的 Token 额度是独立计算的。

source: You can find the rules for the %(type_pl)s on each task's description page.
cs: Pravidla pro %(type_pl)s můžete najít u popisu každé úlohy.
es_cl: Puedes ver las reglas de los %(type_pl)s en la página de descripción de cada problema.
et: Te saate iga ülesande kirjelduse lehel teada, milliste reeglite järgi %(type_pl)seid kasutada saab.
hu: A %(type_pl)s használatára vonatkozó szabályokat a feladatok leírásában találod meg.
ja: %(type_pl)sの使用に関する規則は、各課題の説明ページを参照してください。
lv: Katra uzdevuma apraksta lapā ir atrodami %(type_pl)s izmantošanas noteikumi.
ro: Puteti gasi regulile pentru %(type_pl)s pe pagina de descriere a fiecarei sarcina.
sl: Pravila o %(type_pl)sh najdeš na strani pri opisu vsake naloge.
th: คุณสามารถค้นหากฎสำหรับ %(type_pl)s ได้ที่หน้าคำอธิบายของโจทย์แต่ละข้อ
uk: Ви можете знайти правила для %(type_pl)s на сторінці опису кожного завдання.
zh_cn: 在题目描述页面中，可以看到该题目 %(type_pl)s 的使用规则。

source: You have a set of tokens shared among all tasks.
cs: Máte sadu tokenů sdílenou mezi všemi úkoly.
es_cl: Tienes un conjunto de tokens compartido entre todos los problemas.
et: Teil on üks komplekt pileteid kasutuseks kõigi ülesannete jaoks.
hu: Vannak zsetonjaid, amin az összes feladat osztozik.
ja: 全ての課題に共通するトークンが与えられます。
lv: Žetoni ir kopīgi visiem uzdevumiem.
ro: Aveti un set de jetoane partajat intre toate sarcinile.
sl: Žetoni se delijo med vsemi nalogami.
th: คุณมีชุดโทเค็นที่ใช้ร่วมกันระหว่างงานทั้งหมด
uk: У вас є набір токенів, спільний для всіх завдань.
zh_cn: 您有一些所有题目共用的 Token。

source: You have two types of tokens: a set of <em>contest-tokens</em> shared among all tasks and a distinct set of <em>task-tokens</em> for each task.
cs: Máte dva typy tokenů: sadu <em>soutěžních tokenů</em> sdílenou mezi všemi úlohami a jednotlivé sady <em>úlohových tokenů</em> pro každou úlohu.
es_cl: Tienes dos tipos de tokens: un conjunto de <em>contest-tokens</em> compartidos entre todos los problemas, y un conjunto distinto de <em>task-tokens</em> para cada problema.
et: Teil on kahte tüüpi pileteid: hulk <em>võistluse pileteid</em>, jagatud kõigi ülesannete vahel, ning eraldi hulk <em>ülesande pileteid</em> iga ülesande jaoks.
hu: Kétféle zsetonod van: <em>verseny-zseton</em>ok, amelyeken az összes feladat osztozik; és <em>feladat-zseton</em>ok, amelyek egy adott feladatra vonatkoznak.
ja: 全ての課題で共通の<em>コンテストトークン</em>と、課題ごとに別々の<em>課題トークン</em>の二種類のトークンが与えられます。
lv: Ir divu veidu žetoni: <em>sacensību žetoni</em>, kas derīgi visiem uzdevumiem, un <em>uzdevumu žetoni</em>, kas derīgi katram atsevišķam uzdevumam.
ro: Aveti doua tipuri de jetoane: un set de <em>jetoane de concurs</em> partajate intre toate sarcinile si un set distinct de <em>jetoane de sarcina</em> pentru fiecare sarcina.
sl: Imaš dva različna tipa žetonov: nehaj <em>tekmovalnih-žetonov</em>, ki jih lahko uporabiš pri vseh nalogah, in nekaj <em>žetonov-za-nalogo</em> za vsako nalogo.
th: คุณมีโทเคนสองประเภท ได้แก่ <em>โทเค็นการแข่งขัน</em> ที่ใช้ร่วมกันระหว่างโจทย์ทั้งหมด และชุด <em>โทเค็นโจทย์</em> สำหรับแต่ละโจทย์
uk: У вас є два типи токенів: набір <em>токенів для змагання</em>, спільний для всіх завдань, і окремий набір <em>токен для завдання</em> для кожного завдання.
zh_cn: Token 分为两类：竞赛-Token（竞赛共用的 Token），与题目-Token（每题各自独立的 Token）。

source: You can see the detailed result of a submission by using two tokens on it, one of each type.
cs: Detailní výsledky odevzdaného řešení si můžete prohlédnout, použijete-li na toto řešení dva tokeny, jeden od každého druhu.
es_cl: Puedes ver el resultado detallado de un envío utilizando dos tokens sobre el mismo, uno de cada tipo.
et: Te saate lahenduse detailseid tulemusi näha, kui kasutate selle peal ühe võistluse pileti ja ühe ülesande pileti.
hu: Egy beküldés részletes eredményét megtekintheted, ha mindkétféle zsetonból egyet felhasználsz.
ja: 提出に対する結果の詳細は、二種類のトークンを一つずつ、合計二つのトークンを使用することによって見ることができます。
lv: Detalizētus iesūtījuma rezultātus jūs varēsiet aplūkot, ja izmantosiet divus žetonus — pa vienam no katra žetonu veida.
ro: Puteti vedea rezultatul detaliat al unei expedieri folosind doua jetoane pe ea, unul de fiecare tip.
sl: Podrobnosti oddaje lahko vidiš, če uporabiš dva žetona - vsakega tipa enega.
th: คุณสามารถดูผลลัพธ์อย่างละเอียดโดยการใช้ <em>โทเค็นการแข่งขัน</em> และ <em>โทเค็นโจทย์</em> อย่างละหนึ่งโทเค็น
uk: Ви можете побачити детальний результат спроби, використовуючи два токени на ньому, по одному кожного типу.
zh_cn: 对于每次上传而言，使用两类 Token 各一枚即可查看该次详细的评测结果。

source: You can submit at most %(submissions)s solutions during this contest.
ar: يمكنك تسليم %(submissions)s حلول بحد أقصى أثناء المسابقة
cs: Během této soutěže můžete odevzdat maximálně %(submissions)s řešení.
es_cl: Puedes realizar a lo sumo %(submissions)s envíos de solución durante esta competencia.
et: Te võite võistluse jooksul esitada maksimaalselt %(submissions)s lahendust.
hu: Maximum %(submissions)s alkalommal küldhetsz be megoldást a verseny ideje alatt.
ja: この課題に対して最大 %(submissions)s 回まで提出できます。
lv: Šo sacensību laikā jūs drīkstat iesūtīt ne vairāk kā %(submissions)s risinājumus.
ro: Puteti expedia nu mai mult de %(submissions)s solutii in acest concurs.
sl: Med tekmovanjem lahko oddaš največ %(submissions)s rešitev.
th: การแข่งขันนี้สามารถส่งโปรแกรมได้ไม่เกิน %(submissions)s ครั้ง
uk: Під час цього змагання ви можете надіслати щонайбільше %(submissions)s рішень.
zh_cn: 您在本题目的上传次数已达上限 %(submissions)s 次。

source: You can submit at most %(user_tests)s user tests during this contest.
cs: Během této soutěže můžete odevzdat maximálně %(user_tests)s vlastních testů.
es_cl: Puedes realizar a lo sumo %(user_tests)s tests provistos por el usuario durante esta competencia.
et: Te võite võistluse jooksul esitada maksimaalselt %(user_tests)s testi.
ja: この課題に対して最大 %(user_tests)s 回までテストを要求できます。
lv: Šo sacensību laikā jūs drīkstat iesūtīt ne vairāk kā %(user_tests)s lietotāja testus.
ro: Puteti expedia nu mai mult de %(user_tests)s teste ale utilizatorului in acest concurs.
sl: Med tekmovanjem lahko oddaš največ %(user_tests)s svojih preizkusov.
th: การแข่งขันนี้สามารถส่งการทดสอบได้ไม่เกิน %(user_tests)s ครั้ง
uk: Під час цього змагання ви можете надіслати щонайбільше %(user_tests)s тестів користувача.

source: Every user is allowed to compete (i.e. submit solutions) for a uninterrupted time frame of %(per_user_time)s.
cs: Každý uživatel smí bez přerušení soutěžit (např. odevzdávat řešení) po dobu %(per_user_time)s.
es_cl: Cada usuario tiene permitido competir (particularmente, enviar soluciones) durante una ventana de tiempo ininterrumpida de %(per_user_time)s.
et: Iga kasutaja saab võistelda (s.t. lahendusi esitada) %(per_user_time)s pikkuse lahendusperioodi jooksul.
hu: Minden felhasználó megszakítás nélkül versenyezhet (küldhet be megoldásokat) ennyi ideig: %(per_user_time)s.
ja: それぞれのユーザは連続する %(per_user_time)s の時間枠の間、競技に参加する (すなわち、解答を提出する) ことができます。
lv: Katram lietotājam ir atļauts sacensties (t.i., iesūtīt risinājumus) %(per_user_time)s ilgā nepārtrauktā laikaposmā.
ro: Fiecare utilizator poate participa la competitie (de exemplu, sa expedieze solutii) pe parcursul unui interval neintrerupt de timp de %(per_user_time)s.
sl: Vsak lahko tekmuje (t.j. oddaja rešitve) neomejeno znotraj %(per_user_time)s
th: ผู้เข้าแข่งขันแต่ละคนสามารถแข่งขันติดต่อกันได้ไม่เกิน %(per_user_time)s
uk: Кожному користувачеві дозволено змагатися (тобто надсилати рішення) протягом безперервного проміжку часу %(per_user_time)s.
zh_cn: 每位参赛者可以选择连续的 %(per_user_time)s 参加本次计时竞赛。

source: As soon as the contest starts you can choose to start your time frame.
ar: حينما تبدأ المسابقة بإمكانك اختيار الإطار الزمني للبدء
cs: Jakmile soutěž začne, můžete se rozhodnout spustit svoji soutěžní dobu.
es_cl: Una vez que la competencia comienza, puede elegir comenzar su ventana de tiempo.
et: Niipea, kui võistlus algab, saate valida, millal alustate oma lahendusperioodi.
hu: Amint elkezdődik a verseny, elindíthatod a rendelkezésedre álló időablakot.
ja: コンテストが始まったら、あなたは好きなタイミングで自分の時間枠を始めることができます。
lv: Tiklīdz sacensības sāksies, jūs varēsiet izvēlēties sava laikaposma sākumu.
ro: Odata ce incepe concursul va veti putea alege fereastra de timp.
sl: Takoj ko se tekmovanje začne, lahko izbereš, da ti odštevalnik časa začne šteti.
th: คุณสามารถเลือกช่วงเวลาในการเริ่มการแข่งขันได้
uk: Як тільки змагання розпочнеться, ви зможете розпочати свій часовий проміжок.
zh_cn: 当竞赛开启时，您就可以参加竞赛并开始计时。

source: Once you start, you can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
cs: Jakmile začnete, můžete odevzdávat řešení do konce určené doby nebo do konce soutěže, podle toho, co nastane dřív.
es_cl: Una vez iniciada esta ventana de tiempo, podrás enviar soluciones hasta el final de la misma, o hasta el final de la competencia, lo que ocurra primero.
et: Alustades saate esitada lahendusi oma lahendusperioodi lõpuni, või kuni võistluse lõpuni, kumbiganes esimesena kätte jõuab.
hu: Miután elindítottad, lehetőséged van a megoldásokat beküldeni az időablakod vagy a verseny végéig (amelyik előbb következik be).
ja: 時間枠が始まったら、時間枠の終了かコンテストそのものの終了のうち早いほうが来るまでの間、解答を提出することができます。
lv: Tiklīdz jūs sāksiet, jūs varēsiet iesūtīt risinājumus līdz izvēlētā laikaposma vai sacensību beigām (kas iestāsies pirmās).
ro: Odata ce ati inceput, puteti expedia solutii pana la sfarsitul ferestrei de timp sau a concursului (oricare dintrea acestea survine mai intai).
sl: Ko začneš, lahko oddajaš rešitve do konca svojega omejenega časa oz. do konca tekmovanja, katerokoli se izteče prej.
th: เมื่อคุณเริ่มการแข่งขัน คุณจะส่งโปรแกรมได้จนถึงช่วงเวลาที่กำหนด แต่หากจบการแข่งขันก่อนแล้ว คุณจะไม่สามารถส่งโปรแกรมได้อีก
uk: Почавши, ви можете надсилати рішення до кінця відведеного часового проміжку або до кінця змагання, залежно від того, що відбудеться раніше.
zh_cn: 开始计时后即可开始提交解答。此外，若比赛已经结束，即使您自己的竞赛计时器尚未结束, 您也无法提交解答。

source: By clicking on the button below you can start your time frame.
ar: بمجرد ضغطك للزر في الأسفل سيبدأ الإطار الزمني الخاص بك وسيبدأ الوقت.
cs: Kliknutím na tlačítko níže můžete spustit svou soutěžní dobu.
es_cl: Puedes iniciar tu ventana de tiempo haciendo click en el botón de más abajo.
et: Lahendusperioodi alustamiseks vajutage allolevat nuppu.
hu: A lenti gombra kattintva elindíthatod az időablakod.
ja: このボタンをクリックすると、あなたの時間枠が始まります。
lv: Nospiežot zemāk esošo pogu jūs varat sākt savu laikaposmu.
ro: Accesind butonul de mai jos, veti lansa competitia.
sl: S klikom na gumb spodaj lahko poženeš svoj odštevalnik časa.
th: กดที่ปุ่มด้านล่างเพื่อเริ่มการแข่งขัน
uk: Натиснувши на кнопку нижче, ви можете запустити свій часовий проміжок.
zh_cn: 点击以下按钮确认开始参加竞赛并开始计时。

source: You started your time frame at %(start_time)s.
ar: لقد بدأت إطارك الزمني في %(start_time)s
cs: Začali jste svou soutěžní dobu v %(start_time)s.
es_cl: Tu ventana de tiempo comenzó a las %(start_time)s.
et: Te alustasite oma lahendusperioodi %(start_time)s.
hu: Az időablakod a következő időpontban indult: %(start_time)s.
ja: あなたの時間枠は %(start_time)s に始まりました。
lv: Jūs sākāt savu laikaposmu %(start_time)s.
ro: Ati inceput competitia la %(start_time)s.
sl: Z omejenim časom si pričel(a) ob %(start_time)s.
th: คุณเริ่มการแข่งขันตอน %(start_time)s
uk: Ви запустили свій часовий проміжок о %(start_time)s.
zh_cn: 您已在 %(start_time)s 开始竞赛计时。

source: You can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
cs: Můžete odevzdávat řešení do konce určené soutěžní doby nebo do konce soutěže, podle toho, co nastane dřív.
es_cl: Puedes enviar soluciones hasta el final de la ventana de tiempo, o hasta el final de la competencia, lo que ocurra primero.
et: Saate esitada lahendusi oma lahendusperioodi lõpuni, või kuni võistluse lõpuni, kumbiganes esimesena kätte jõuab.
hu: Lehetőséged van a megoldásokat beküldeni az időablakod vagy a verseny végéig (amelyik előbb következik be).
ja: 時間枠の終了かコンテストそのものの終了のうち早いほうが来るまでの間、解答を提出することができます。
lv: Jūs varat iesūtīt risinājumus līdz izvēlētā laikaposma vai sacensību beigām (kas iestāsies pirmās).
ro: Puteti expedia solutii pana la sfarsitul ferestrei de timp sau a concursului (oricare dintre acestea survine mai intai).
sl: Rešitve lahko oddajaš do konca svojega omejenega časa oz. do konca tekmovanja, katerokoli se izteče prej.
th: คุณจะส่งโปรแกรมได้จนถึงช่วงเวลาที่กำหนด แต่หากจบการแข่งขันก่อนแล้ว คุณจะไม่สามารถส่งโปรแกรมได้อีก
uk: Ви можете надсилати рішення до кінця відведеного часового проміжку або до кінця змагання, залежно від того, що відбудеться раніше.
zh_cn: 您可以提交解答直到整体竞赛终止或您的竞赛计时器结束为止。

source: You started your time frame at %(start_time)s and you already finished it.
cs: Spustili jste svou soutěžní dobu v %(start_time)s a již jste ji vyčerpali.
es_cl: Tu ventana de tiempo comenzó a las %(start_time)s, y ya ha finalizado.
et: Teie lahendusperiood algas %(start_time)s ning on juba lõppenud.
hu: Az időablakod (kezd. %(start_time)s) véget ért.
ja: あなたの時間枠は %(start_time)s に始まりました。この時間枠は既に終了しています。
lv: Jūs sākāt savu laikaposmu %(start_time)s, un tas ir noslēdzies.
ro: Ati inceput competitia la %(start_time)s si ea a finisat deja.
sl: Tekmovanje si začel(a) ob %(start_time)s in ga tudi že zaključil(a).
th: คุณได้เริ่มการแข่งขันตอน %(start_time)s ซึ่งหมดช่วงเวลาที่กำหนดไว้แล้ว
uk: Ви запустили свій часовий проміжок о %(start_time)s і вже завершили його.
zh_cn: 您已在 %(start_time)s 开始竞赛计时，而现在时间已结束。

source: There's nothing you can do now.
ar: لا يمكنك فعل شيء.
cs: Aktuálně nemůžete nic dělat.
es_cl: Ya no puedes realizar más envíos.
et: Te ei saa nüüd enam midagi teha.
hu: Nincs további teendőd.
ja: 現在あなたができることはありません。
lv: Nav nekā, ko jūs tagad varētu iesākt.
ro: Nu mai puteti face nimic acum.
sl: Sedaj ne moreš narediti ničesar.
th: คุณไม่สามารถดำเนินการใดๆ ได้อีก
uk: Ви нічого не можете зробити зараз.
zh_cn: 目前无法进行任何操作。

source: You never started your time frame. Now it's too late.
cs: Nikdy jste nespustili svou soutěžní dobu. Teď je příliš pozdě.
es_cl: Nunca iniciaste tu ventana de tiempo. Ya no es posible realizar envíos.
et: Te ei ole oma lahendusperioodi alustanud. Nüüd on selleks liiga hilja.
hu: Sosem indítottad el az időablakod, most már pedig túl késő.
ja: あなたは時間枠を始めませんでした。また、今から始めるには遅すぎます。
lv: Jūs nesākāt savu laikaposmu. Tagad jau ir par vēlu.
ro: Ati inceput competitia. Acum este deja prea tirziu.
sl: Nikoli nisi pognal(a) odštevalnika časa. Sedaj je že prepozno.
th: คุณไม่ได้เริ่มการแข่งขัน. ซึ่งตอนนี้ไม่ทันแล้ว
uk: Ви ніколи не запускали свій часовий проміжок. Тепер уже пізно.
zh_cn: 您尚未开始竞赛，但现在已超过允许时间。

source: Start!
ar: ابدأ!
cs: Spustit!
es_cl: ¡Comenzar!
et: Alusta!
hu: Kezdjük!
ja: 開始!
lv: Sākt!
sl: Začni!
th: เริ่ม!
uk: Старт!
zh_cn: 开始！

source: Task overview
ar: نظرة عامة عن المسألة
cs: Přehled úloh
es_cl: Resumen de los problemas
et: Ülesande info
hu: Feladat áttekintés
ja: 課題概要
lv: Uzdevumu apskats
ro: Privire de ansamblu a sarcinilor
sl: Pregled naloge
th: ภาพรวมโจทย์ทั้งหมด
uk: Огляд завдання
zh_cn: 题目列表

source: Task
ar: مسألة
cs: Úloha
es_cl: Problema
et: Ülesanne
hu: Feladat
ja: 課題
lv: Uzdevums
ro: Sarcina
sl: Naloga
th: โจทย์
uk: Завдання
zh_cn: 简称

source: Name
ar: اسم
cs: Jméno
es_cl: Título
et: Nimi
hu: Név
ja: 名前
lv: Nosaukums
ro: Nume
sl: Ime
th: ชื่อโจทย์
uk: Ім'я
zh_cn: 标题
