Repository: cms-dev/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: ar, cs, es_cl, et, hu, ja, lv, ro, sl, th, uk, zh_cn

source: Time limit
ar: حد الوقت
cs: Časový limit
es_cl: Límite de tiempo
et: Ajalimiit
hu: Időlimit
ja: 時間制限
lv: Izpildes laika ierobežojums
ro: Restrictia de timp
sl: Časovna omejitev
th: ข้อจำกัดเวลา
uk: Обмеження часу
zh_cn: 时间限制

source: Memory limit
ar: حد الذاكرة
cs: Paměťový limit
es_cl: Límite de memoria
et: Mälulimiit
hu: Memórialimit
ja: メモリ制限
lv: Atmiņas apjoma ierobežojums
ro: Restrictia de memorie
sl: Omejitev spomina
th: ข้อจำกัดหน่วยความจำ
uk: Обмеження пам'яті
zh_cn: 内存限制

source: Type
ar: النوع
cs: Typ
es_cl: Tipo
et: Tüüp
hu: Típus
ja: 種類
lv: Tips
ro: Tip
sl: Tip
th: ชนิด
uk: Тип
zh_cn: 作答形式

source: Files
ar: الملفات
cs: Soubory
es_cl: Archivos
et: Failid
hu: Fájlok
ja: ファイル
lv: Datnes
ro: Fisiere
sl: Datoteke
th: ไฟล์
uk: Файли
zh_cn: 提交文件

source: Tokens
cs: Tokeny
et: Piletid
hu: Zsetonok
ja: トークン
lv: Žetoni
ro: Token-e
sl: Žetoni
th: โทเค็น
uk: Токени
zh_cn: Token

source: Yes
ar: نعم
cs: Ano
es_cl: Sí
et: Jah
hu: Igen
ja: はい
lv: Jā
ro: Da
sl: Da
th: ใช่
uk: Так
zh_cn: 是

source: No
ar: لا
cs: Ne
et: Ei
hu: Nem
ja: いいえ
lv: Nē
ro: Nu
sl: Ne
th: ไม่
uk: Ні
zh_cn: 否

source: Print
ar: اطبع
cs: Tisk
es_cl: Imprimir
et: Prindi
hu: Nyomtatás
ja: 印刷
lv: Drukāt
sl: Tiskaj
th: พิมพ์
uk: Роздрукувати

source: You can print %(remaining_jobs)s more text or PDF files of up to %(max_pages)s pages each.
ar: يمكنك طباعة %(remaining_jobs)s ملفات نصية أو PDF زيادة، وكل منها لا يتجاوز %(max_pages)s صفحات.
cs: Můžete vytisknout ještě %(remaining_jobs)s textů nebo souborů PDF, každý o maximálně %(max_pages)s stránkách.
es_cl: Puedes imprimir %(remaining_jobs)s archivos de texto o pdf adicionales, de hasta %(max_pages)s páginas cada uno.
et: Te võite printida veel %(remaining_jobs)s teksti või PDF faili, igaüks kuni %(max_pages)s lehekülge pikk.
sl: Natisneš lahko še %(remaining_jobs)s besedilnih ali PDF datotek z največ %(max_pages)s stranmi.
th: คุณสามารถพิมพ์ไฟล์ข้อความหรือ PDF ได้อีก %(remaining_jobs)s รอบ หรือพิมพ์ PDF ได้ไม่เกิน %(max_pages)s หน้าต่อครั้ง
uk: Ви можете надрукувати ще %(remaining_jobs)s текстових або PDF-файлів обсягом до %(max_pages)s сторінок кожен.

source: You can print %(remaining_jobs)s more text files of up to %(max_pages)s pages each.
cs: Můžete vytisknout ještě %(remaining_jobs)s textových souborů, každý o maximálně %(max_pages)s stránkách.
es_cl: Puedes imprimir %(remaining_jobs)s archivos de texto adicionales, de hasta %(max_pages)s páginas cada uno.
et: Te võite printida veel %(remaining_jobs)s tekstifaili, igaüks kuni %(max_pages)s lehekülge pikk.
sl: Natisneš lahko še %(remaining_jobs)s besedilnih datotek z največ %(max_pages)s stranmi.
th: คุณสามารถพิมพ์ไฟล์ข้อความได้อีก %(remaining_jobs)s รอบ โดยพิมพ์ได้ไม่เกิน %(max_pages)s หน้าต่อครั้ง
uk: Ви можете надрукувати ще %(remaining_jobs)s текстових файлів обсягом до %(max_pages)s сторінок кожен.

source: File (text or PDF)
ar: ملف (نصي أو PDF)
cs: Soubor (text nebo PDF)
es_cl: Archivo (de texto o PDF)
et: Fail (tekst või PDF)
hu: Fájl (szöveg vagy PDF)
ja: ファイル (テキストまたはPDF)
lv: Datne (teksta vai PDF)
sl: Datoteka (besedilna ali PDF)
th: ไฟล์ (ข้อความ หรือ PDF)
uk: Файл (текст або PDF)

source: File (text)
ar: ملف (نصي)
cs: Soubor (text)
es_cl: Archivo (de texto)
et: Fail (tekst)
hu: Fájl (szöveg)
ja: ファイル (テキスト)
lv: Datne (teksta)
sl: Datoteka (besedilna)
th: ไฟล์ (ข้อความ)
uk: Файл (текст)

source: Submit
ar: تسليم
cs: Odevzdat
es_cl: Enviar
et: Esita
hu: Beküldés
ja: 提出
lv: Iesūtīt
ro: Expediaza
sl: Oddaj
th: ส่ง
uk: Надіслати
zh_cn: 提交

source: You cannot print anything any more as you have used up your printing quota.
cs: Už nemůžete nic vytisknout, jelikož váš limit na tisk byl vyčerpaný.
es_cl: Ya no puedes imprimir nada más, pues ya has agotado tu cuota de impresión.
et: Te ei saa rohkem printida, kuna kasutasite ära teile lubatud printimiskvoodi.
hu: Nem tudsz többet nyomtatni, mert felhasználtad a nyomtatási keretedet.
ja: あなたに割り当てられた印刷制限の上限に達したため、これ以上印刷することはできません。
lv: Jūs vairs neko nevarat izdrukāt, jo jau esat izlietojuši atļauto lappušu skaitu.
sl: Ne moreš več tiskati, ker si porabil(a) svojo kvoto tiskanja.
th: ไม่สามารถพิมพ์ได้ เพราะคุณพิมพ์เกินโควตาแล้ว
uk: Ви більше не можете нічого друкувати, оскільки ви використали свою квоту друку.

source: Previous print jobs
cs: Předchozí tiskové úlohy
es_cl: Trabajos de impresión previos
et: Eelmised printimistööd
hu: Korábbi nyomtatások
ja: 以前の印刷ジョブ
lv: Iepriekšējie drukas darbi
sl: Prejšnja tiskalniška opravila
th: งานการพิมพ์ก่อนหน้า
uk: Попередні завдання для друку

source: Date and time
ar: التاريخ والوقت
cs: Datum a čas
es_cl: Fecha y hora
et: Kuupäev ja kellaaeg
hu: Dátum és idő
ja: 日付と時刻
lv: Datums un laiks
ro: Data si timpul
sl: Datum in čas
th: วันที่และเวลา
uk: Дата і час
zh_cn: 日期与时间

source: Time
ar: الوقت
cs: Čas
es_cl: Hora
et: Aeg
hu: Idő
ja: 時刻
lv: Laiks
ro: Timp
sl: Čas
th: เวลา
uk: Час
zh_cn: 时间

source: File name
ar: اسم الملف
cs: Jméno souboru
es_cl: Nombre de archivo
et: Faili nimi
hu: Fájlnév
ja: ファイル名
lv: Datnes nosaukums
sl: Ime datoteke
th: ชื่อไฟล์
uk: Ім'я файлу

source: Status
ar: الحالة
cs: Stav
es_cl: Estado
et: Olek
hu: Állapot
ja: 状態
lv: Statuss
ro: Statut
sl: Stanje
th: สถานะ
uk: Статус
zh_cn: 状态

source: Preparing...
ar: يجهز...
cs: Příprava...
es_cl: Preparando...
et: Valmistamine...
hu: Előkészítés...
ja: 準備中…
lv: Sagatavojas…
sl: Pripravljam...
th: กำลังเตรียม...
uk: Підготовка...

source: no print jobs yet
cs: zatím žádné tiskové úlohy
es_cl: sin trabajos de impresión aún
et: printimistöid ei ole
hu: nincsenek nyomtatások
ja: まだ印刷ジョブはありません
lv: pagaidām nav drukas darbu
sl: ni tiskalniških opravil
th: ไม่มีงานการพิมพ์
uk: ще немає завдань для друку

source: The passwords do not match!
ar: كلمتي المرور غير متطابقة!
cs: Hesla se neshodují!
es_cl: Las contraseñas no coinciden
et: Paroolid ei klapi!
hu: A jelszavak nem egyeznek!
ro: Parolele nu corespund!
th: รหัสผ่านไม่ตรงกัน!
uk: Паролі не збігаються!

source: This username is already taken, please choose a different one.
cs: Toto uživatelské jméno je již zabrané, prosíme vyberte jiné.
es_cl: Este nombre de usuario ya está en uso, por favor elige uno diferente.
et: See kasutajanimi on juba võetud, palun valige uus.
hu: Ez a felhasználónév foglalt, kérlek válassz másikat.
ro: Acest nume de utilizator este deja luat, va rugam sa alegeti unul diferit.
th: ชื่อผู้ใช้นี้ถูกใช้ไปแล้ว กรุณาเลือกชื่อผู้ใช้ใหม่
uk: Цей логін вже зайнятий, виберіть інший.

source: This user is already registered in the contest.
ar: المستخدم قد سجل للمسابقة من قبل.
es_cl: Este usuario ya está inscrito en la competencia.
et: See kasutaja on sellele võistlusele juba registreeritud.
hu: Ez a felhasználó már regisztrált a versenyre.
ro: Acest utilizator este deja inscris in concurs.
th: ผู้ใช้นี้ได้ลงทะเบียนสำหรับการแข่งขันนี้ไปแล้ว
uk: Цей користувач вже зареєстрований у змаганні.

source: No such user.
ar: لا يوجد مستخدم هكذا.
es_cl: No se encontró el usuario.
et: Kasutajat ei leidu.
hu: Nincs ilyen felhasználó.
ro: Nu exista utilizator cu acest nume.
th: ไม่มีชื่อผู้ใช้นี้
uk: Немає такого користувача.

source: The password is not correct.
ar: كلمة المرور غير صحيحة.
es_cl: La contraseña no es correcta.
et: Vale parool.
hu: Helytelen jelszó.
ro: Parola este incorecta.
th: รหัสผ่านไม่ถูกต้อง
uk: Пароль неправильний.

source: Registration
ar: التسجيل
es_cl: Registro
et: Registreerumine
hu: Regisztráció
ro: Inregistrare
th: การลงทะเบียน
uk: Реєстрація

source: Please fill in the fields to register
ar: فضلًا املأ الحقول للتسجيل
cs: Prosíme vyplňte tato pole k registraci
es_cl: Completa los campos para registrarte
et: Palun täida väljad, et registreeruda
hu: Kérlek töltsd ki a mezőket a regisztrációhoz
ro: Va rugam sa completati campurile pentru a va inregistra
th: กรุณากรอกข้อมูล
uk: Будь ласка, заповніть поля для реєстрації

source: New user
ar: مستخدم جديد
cs: Nový uživatel
es_cl: Nuevo usuario
et: Uus kasutaja
hu: Új felhasználó
ro: Utilizator nou
th: ผู้ใช้ใหม่
uk: Новий користувач

source: Join contest
ar: ادخل المسابقة
es_cl: Unirse a la competencia
et: Liitu võistlusega
ro: Intra in concurs
th: เข้าร่วมการแข่งขัน
uk: Приєднатися до змагання

source: First name
ar: الاسم الأول
cs: Křestní jméno
es_cl: Nombre
et: Eesnimi
hu: Keresztnév
ro: Prenume
th: ชื่อ
uk: Ім'я

source: Last name
ar: الاسم الأخير
cs: Příjmení
es_cl: Apellido
et: Perenimi
hu: Vezetéknév
ro: Numele de familie
th: นามสกุล
uk: Прізвище

source: E-mail
ar: البريد الإلكتروني
es_cl: Correo electrónico
et: E-maili aadress
uk: Електронна пошта

source: Representing
cs: V týmu
es_cl: Representando
et: Esindamas
hu: Képviselt intézmény
ro: Reprezentand
th: เป็นผู้แทน
uk: Представляючи

source: Must be one character or more.
cs: Musí mít alespoň %(min_length)s znak.
es_cl: Debe tener al menos un carácter.
et: Peab olema vähemalt ühe tähemärgi pikkune.
hu: Legalább egy karakter hosszúnak kell lennie.
ro: Trebuie sa fie minim 1 caracter sau mai multe.
th: ต้องมีความยาวอย่างน้อย %(min_length)s ตัวอักษร
uk: Має бути один або більше символів.

source: Confirm password
ar: تأكيد كلمة المرور
cs: Zopakujte heslo
es_cl: Confirmar contraseña
et: Korda parooli
hu: Jelszó megerösítése
ro: Confirma parola
th: ยืนยันรหัสผ่าน
uk: Підтвердьте пароль

source: Registered in the contest successfully!
ar: سجلت في المسابقة بنجاح!
es_cl: ¡Te has registrado exitosamente en la competencia!
et: Võistlusele edukalt registreeritud!
hu: Sikeresen regisztráltál a versenyre!
ro: V-ati inregistrat in concurs cu succes!
th: ลงทะเบียนสำหรับการแข่งขันสำเร็จ!
uk: Успішна реєстрація в змаганні!

source: Your username is:
ar: اسم المستخدم:
cs: Vaše uživatelské jméno je:
es_cl: Tu nombre de usuario es:
et: Teie kasutajanimi on:
hu: A felhasználóneved:
ro: Numele de utilizator:
th: ชื่อผู้ใช้ของคุณคือ
uk: Ваш логін:

source: Your password is stored securely.
ar: كلمة مرورك خزنت بأمان.
es_cl: Tu contraseña se almacena de manera segura.
et: Teie parool on turvaliselt hoitud.
hu: A jelszó biztonságosan kerül tárolásra.
ro: Parola voastra este stocata in siguranta.
th: รหัสผ่านของคุณถูกเก็บไว้อย่างปลอดภัย
uk: Ваш пароль надійно зберігається.

source: Back to login
ar: العودة لتسجيل الدخول
cs: Zpět na přihlášení
es_cl: Volver al inicio de sesión
et: Tagasi sisselogimislehele
hu: Vissza a bejelentkezéshez
ro: Inapoi la logare
th: เข้าสู่ระบบ
uk: Назад до входу

source: Compilation output
ar: مخرجات التحويل
cs: Výstup kompilace
es_cl: Salida de la compilación
et: Kompilaatori väljund
hu: Fordítás kimenete
ja: コンパイル出力
lv: Kompilēšanas izvads
ro: Iesire de compilare
sl: Izhod prevajalnika
th: ผลการคอมไพล์
uk: Вихід компіляції
zh_cn: 编译信息

source: Compilation outcome:
ar: نتيجة التحويل:
cs: Výsledek kompilace:
es_cl: Resultado de la compilación:
et: Kompileerimise tulemus:
hu: Fordítás eredménye:
ja: コンパイル結果:
lv: Kompilēšanas iznākums:
ro: Rezultatul compilarii:
sl: Izzid prevajalnika:
th: ผลลัพธ์การคอมไพล์:
uk: Результат компіляції:
zh_cn: 编译结果：

source: Compilation time:
ar: الوقت المستغرق للتحويل
cs: Čas kompilace:
es_cl: Tiempo de compilación:
et: Kompileerimise aeg:
hu: Fordítás ideje:
ja: コンパイル時間:
lv: Kompilēšanas laiks:
ro: Timpul compilarii:
sl: Čas prevajanja:
th: ใช้เวลา:
uk: Час компіляції:
zh_cn: 编译时间：

source: Memory used:
ar: الذاكرة المستعملة:
cs: Použitá paměť:
es_cl: Memoria utilizada:
et: Mälukasutus:
hu: Felhasznált memória:
ja: 消費メモリ:
lv: Izmantotā atmiņa:
ro: Memorie utilizata:
sl: Porabljen spomin:
th: ใช้หน่วยความจำ:
uk: Використана пам'ять:
zh_cn: 内存使用量：

source: Standard output
ar: نظام المخرجات الأساسي
cs: Standardní výstup
es_cl: Salida estándar
et: Standardväljund
hu: Standard kimenet
ja: 標準出力
lv: Standarta izvads
ro: Iesirea standard
sl: Standardni izhod
uk: Стандартний вихід
zh_cn: 标准输出（stdout）

source: Standard error
ar: نظام مخرجات الأخطاء الأساسي
cs: Chybový výstup
es_cl: Salida de error estándar
et: Veaväljund
hu: Standard hibakimenet
ja: 標準エラー
lv: Standarta kļūdu izvads
ro: Erori standarde
sl: Standardna napaka
uk: Стандартна помилка
zh_cn: 标准错误输出（stderr）

source: %(name)s (%(short_name)s) <small>description</small>
ar: %(name)s (%(short_name)s) <small>الوصف</small>
cs: %(name)s (%(short_name)s) <small>popis</small>
es_cl: %(name)s (%(short_name)s) <small>descripción</small>
et: %(name)s (%(short_name)s) <small>kirjeldus</small>
hu: %(name)s (%(short_name)s) <small>leírás</small>
ja: %(name)s (%(short_name)s) <small>説明</small>
lv: %(name)s (%(short_name)s) <small>apraksts</small>
ro: %(name)s (%(short_name)s) <small>descriere</small>
sl: %(name)s (%(short_name)s) <small>opis</small>
th: <small>คำอธิบายของ</small> %(name)s (%(short_name)s)
uk: %(name)s (%(short_name)s) <small>опис</small>
zh_cn: %(name)s (%(short_name)s) <small>题目描述</small>

source: no statement available
ar: لا يوجد نص للمسألة
cs: žádné dostupné zadání
es_cl: no hay ningún enunciado disponible
et: ülesande teksti pole
hu: nem érhető el feladatleírás
ja: 問題文がありません
lv: formulējums nav pieejams
ro: conditii nu sint
sl: besedilo ni dostopno
th: ไม่มีคำอธิบายโจทย์
uk: немає умови
zh_cn: 本题没有描述

source: Download task statement
ar: تحميل نص المسألة
cs: Stáhnout zadání úlohy
es_cl: Descargar enunciado
et: Lae ülesande tekst alla
hu: Feladatleírás letöltése
ja: 問題文をダウンロードする
lv: Lejuplādēt uzdevuma formulējumu
ro: Descarca textul sarcinii
sl: Prenesi besedilo naloge
th: ดาวน์โหลดคำอธิบายโจทย์
uk: Завантажити умову завдання
zh_cn: 下载题目描述

source: The statement for this task is available in multiple versions, in different languages.
ar: نص المسألة متوفر بعدة نسخ للغات مختلفة.
cs: Zadání této úlohy je k dispozici v několika verzích v různých jazycích.
es_cl: El enunciado de este problema está disponible en múltiples versiones, en diferentes idiomas.
et: Selle ülesande tekstist on saadaval mitu versiooni erinevates keeltes.
hu: A feladatleírás több verzióban, különböző nyelveken is elérhető.
ja: この課題に対する問題文は複数のバージョンまたは複数の言語で提供されています。
lv: Šī uzdevuma formulējums ir pieejums vairākās versijās, dažādās valodās.
ro: Enunturile acestei sarcini sint disponibile in mai multe limbi.
sl: Besedilo naloge je na voljo v različnih jezikih.
th: โจทย์ในข้อนี้มีหลายเวอร์ชันและหลายภาษา
uk: Інструкція для цього завдання доступна в кількох версіях різними мовами.
zh_cn: 本题题目描述有多个翻译版本。

source: You can see (and download) all of them using the list on the right.
ar: يمكنك رؤيتها (وتنزيلها) كلها من القائمة على اليمين.
cs: Můžete si prohlédnout (a stáhnout) každou z nich pomocí seznamu vpravo.
es_cl: Puedes ver y descargar todas las versiones utilizando la lista a la derecha.
et: Te võite neid lugeda (ja alla laadida) kasutades paremal pool olevat nimekirja.
hu: Mindet megtekintheted (és letöltheted) a jobb oldali lista segítségével.
ja: 全ての問題文は、右側のリストを用いることで閲覧 (およびダウンロード) できます。
lv: Jūs varat aplūkot (un lejuplādēt) visas tās izmantojot sarakstu labajā pusē.
ro: Puteti vizualiza (si descarca) orice traducere, utilizind lista din dreapta.
sl: Vidiš (in preneseš) lahko vse, če uporabiš seznam na desni.
th: คุณสามารถดู (และดาวน์โหลด) ทั้งหมดได้โดยการใช้แถบด้านขวา
uk: Ви можете переглянути (і завантажити) усі з них, використовуючи список праворуч.
zh_cn: 您可以查看右侧所有翻译版本。

source: Some suggested translations follow.
cs: Následují nějaké navržené překlady.
es_cl: A continuación, se muestran algunas traducciones sugeridas.
et: Järgnevad mõned soovitatud tõlked.
hu: A javasolt fordítások következnek.
ja: 推奨された翻訳が以下にあります。
lv: Zemāk seko daži ieteiktie tulkojumi.
sl: Nekaj predlaganih prevodov še sledi.
th: มีคำแนะนำการแปลต่อไปนี้
uk: Нижче наведено деякі запропоновані переклади.
zh_cn: 推荐翻译版本如下。

source: Statement in <b>%(lang)s</b>
ar: المسألة بلغة <b>%(lang)s</b>
cs: Zadání v <b>%(lang)s</b>
es_cl: Enunciado en <b>%(lang)s</b>
et: Ülesande tekst <b>%(lang)s</b> keeles
hu: Feladatleírás (<b>%(lang)s</b>)
ro: Enunt in <b>%(lang)s</b>
sl: Besedilo v <b>%(lang)s</b>
th: รายละเอียดโจทย์ในภาษา <b>%(lang)s</b>
uk: Умови мовою <b>%(lang)s</b>
zh_cn: 题目描述 in <b>%(lang)s</b>

source: Statement in %(lang)s
ar: نص المسألة بلغة %(lang)s
cs: Zadání v %(lang)s
es_cl: Enunciado en %(lang)s
et: Ülesande tekst %(lang)s keeles
hu: Feladatleírás (%(lang)s)
ro: Enunt in %(lang)s
sl: Besedilo v %(lang)s
th: รายละเอียดโจทย์ในภาษา %(lang)s
uk: Умова %(lang)s
zh_cn: 题目描述 in %(lang)s

source: Some details
ar: بعض التفاصيل
cs: Bližší informace
es_cl: Algunos detalles
et: Üksikasjad
hu: Egyéb adatok
ja: 詳細
lv: Dažas detaļas
ro: Detalii
sl: Nekaj podrobnosti
th: รายละเอียด
uk: Деякі деталі
zh_cn: 详细信息

source: Compilation commands
ar: أوامر التحويل
cs: Příkazy ke kompilaci
es_cl: Comandos de compilación
et: Kompileerimise käsurida
hu: Fordítási parancsok
ja: コンパイル時のコマンド
lv: Kompilēšanas komandas
ro: Comenzile compilarii
sl: Ukazi za prevajanje
th: คำสั่งการคอมไพล์
uk: Команди компіляції
zh_cn: 编译指令

source: You can find the rules for the %(type_pl)s on the <a href="%(contest_root)s">contest overview page</a>.
es_cl: Puedes consultar las reglas de los %(type_pl)s en la <a href="%(contest_root)s">vista general de la competencia</a>.
hu: A %(type_pl)s használatára vonatkozó szabályokat a <a href="%(contest_root)s">verseny áttekintő oldalán</a> találod.
lv: Jūs varat atrast %(type_pl)s noteikumus <a href="%(contest_root)s">sacensību apskata lapā</a>.
ro: Puteti gasi regulile pentru %(type_pl)s pe <a href="%(contest_root)s">pagina principala a concursului</a>.
th: คุณสามารถอ่านกฎของโจทย์ประเภท %(type_pl)s ได้ที่ <a href="%(contest_root)s">ภาพรวมการแข่งขัน</a>.
uk: Ви можете знайти правила для %(type_pl)s на <a href="%(contest_root)s">сторінці огляду змагання</a>.

source: Remember that to see the detailed result of a submission you need to use both a contest-token and a task-token.
cs: Pamatujte, že k zobrazení detailních výsledků odevzdaného řešení musíte použít jak soutěžní token, tak úlohový token.
es_cl: Recuerda que para ver el resultado detallado de un envío, debes utilizar tanto un contest-token como un task-token.
et: Pane tähele, et esitatud lahenduse tulemuste detailvaate nägemiseks pead kasutama nii ühe võistluspileti kui ka ühe ülesandepileti.
hu: Fontos, hogy a beküldés eredményének részletes megtekintéséhez egy verseny-zsetont és egy feladat-zsetont is fel kell használnod.
ro: Pentru a putea vedea rezultatele detaliate ale unei expedieri, trebuie sa utilizati atat un jeton de concurs cat si un jeton de sarcina.
sl: Če želiš videti podrobnejši izzid oddaje, moraš uporabiti oba žetona.
th: โปรดจำไว้ว่าหากต้องการดูผลลัพธ์อย่างละเอียดของการส่ง คุณต้องใช้ทั้ง โทเค็นการแข่งขัน และ โทเค็นโจทย์
uk: Пам’ятайте, що для перегляду детальних результатів спроби потрібно використовувати як токен змагання, так і токен завдання.
zh_cn: 请注意：欲查看详细的评测结果，须使用竞赛-Token 与题目-Token 各一枚。

source: Attachments
ar: المرفقات
cs: Přílohy
es_cl: Adjuntos
et: Manused
hu: Mellékletek
ja: 添付ファイル
lv: Piesaistnes
ro: Atasari
sl: Priponke
th: ไฟล์แนบ
uk: Додатки
zh_cn: 附件

source: unknown
ar: غير معروف
cs: neznámé
es_cl: desconocido
et: tundmatu
hu: ismeretlen
ja: 不明
lv: nezināms
ro: necunoscut
th: ไม่ทราบ
uk: невідомий

source: loading...
ar: يحمل...
cs: nahrávám...
es_cl: cargando...
et: laadimine...
hu: betöltés...
ja: 読み込み中…
lv: ielādē…
ro: se incarca...
sl: nalagam...
th: กำลังโหลด...
uk: завантаження...

source: %(name)s (%(short_name)s) <small>submissions</small>
cs: %(name)s (%(short_name)s) <small>odevzdaná řešení</small>
es_cl: %(name)s (%(short_name)s) <small>envíos</small>
et: %(name)s (%(short_name)s) <small>esitatud lahendused</small>
hu: %(name)s (%(short_name)s) <small>beküldések</small>
ja: %(name)s (%(short_name)s) <small>提出</small>
lv: %(name)s (%(short_name)s) <small>iesūtījumi</small>
ro: %(name)s (%(short_name)s) <small>expedieri</small>
sl: %(name)s (%(short_name)s) <small>oddaje</small>
th: <small>การส่งโปรแกรมของโจทย์</small> %(name)s (%(short_name)s)
uk: %(name)s (%(short_name)s) <small>спроби</small>
zh_cn: %(name)s (%(short_name)s) <small>评测页面</small>

source: Score:
ar: الدرجة:
cs: Skóre:
es_cl: Puntaje:
et: Punktid:
hu: Pontszám:
ro: Scorul:
th: คะแนน:
uk: Бал:

source: Public score:
ar: الدرجة الظاهرة:
cs: Veřejné skóre:
es_cl: Puntaje público:
et: Avalikud punktid:
hu: Nyilvános pontszám:
ro: Scorul public:
th: คะแนนสาธารณะ:
uk: Публічний бал:

source: Score of tokened submissions:
cs: Skóre řešení s tokeny:
es_cl: Puntaje de los envíos con token utilizado:
et: Piletiga lahenduste punktid:
hu: Zsetonos beküldések pontszáma:
ro: Scorul expedierii cu jeton trecute:
th: คะแนนของการส่งที่ใช้โทเค็น:
uk: Бали позначених спроб:

source: Total score:
ar: الدرجة الكلية:
cs: Celkové skóre:
es_cl: Puntaje total:
et: Punktid kokku:
hu: Teljes pontszám:
ro: Scorul total:
th: คะแนนรวม:
uk: Загальний бал:

source: Submit a solution
ar: سلم حلًّا
cs: Odevzdat řešení
es_cl: Enviar solución
et: Esita lahendus
hu: Megoldás beküldése
ja: 解答を提出する
lv: Iesūtīt risinājumu
ro: Expedierea solutiei
sl: Oddaj rešitev
th: ส่งคำตอบ
uk: Надішліть рішення
zh_cn: 提交解答

source: You may submit any subset of outputs in a single submission.
ar: يمكنك أن تسلم أي جزء من المخرجات في التسليم الواحد
cs: Na jeden pokus můžete odevzdat jakoukoliv podmnožinu výstupů.
es_cl: Puedes enviar cualquier subconjunto de los archivos de salida en un mismo envío.
et: Võite esitada suvalise alamhulga väljundfailidest.
ro: Puteti expedia orice subset al iesirilor intr-o singura expediere.
th: คุณอาจส่ง output เพียงบางส่วนในการส่งแต่ละครั้งได้
uk: Ви можете надіслати будь-яку підмножину виводів в одній спробі.

source: You can submit %(submissions_left)s more solution(s).
cs: Můžete odevzdat ještě %(submissions_left)s řešení.
es_cl: Puedes enviar %(submissions_left)s soluciones más.
et: Võite esitada veel %(submissions_left)s lahendust.
hu: Még %(submissions_left)s alkalommal küldhetsz be megoldást.
ja: あなたはあと %(submissions_left)s 回提出できます。
lv: Jūs varat iesūtīt vēl %(submissions_left)s iesūtījumu(s).
ro: Mai puteti trimite %(submissions_left)s solutii.
sl: Oddaš lahko še %(submissions_left)s rešitev.
th: คุณสามารถส่งคำตอบได้อีกไม่เกิน %(submissions_left)s ครั้ง
uk: Ви можете надіслати ще %(submissions_left)s рішення(ів).
zh_cn: 您可以再上传 %(submissions_left)s 个解答。

source: Previous submissions
ar: التسليمات السابقة
cs: Předchozí odevzdaná řešení
es_cl: Envíos anteriores
et: Eelmised esitatud lahendused
hu: Korábbi beküldések
ja: 以前の提出
lv: Iepriekšējie iesūtījumi
ro: Expedierile anterioare
sl: Predhodne oddaje
th: การส่งก่อนหน้า
uk: Попередні спроби
zh_cn: 评测记录

source: Tokens are not allowed on this task.
cs: Tokeny nejsou u této úlohy povoleny.
es_cl: No se permiten tokens en este problema.
et: Piletite kasutamine ei ole selles ülesandes lubatud.
hu: Nem használhatsz zsetonokat ennél a feladatnál.
ro: Jetoanele nu sunt permise pentru aceasta sarcina.
th: ไม่มีการใช้โทเค็นในโจทย์นี้
uk: У цьому завданні токени заборонені.

source: Right now, you have infinite tokens available on this task.
cs: Právě teď máte pro tuto úlohu k dispozici neomezený počet tokenů.
es_cl: En este momento, usted posee una cantidad ilimitada de tokens para este problema.
et: Praegu on Teil selle ülesande lahenduste esitamiseks piiramatult pileteid.
hu: Jelenleg végtelen zsetonod van ehhez a feladathoz.
ja: 現在、この課題ではトークンを無制限に使用できます。
lv: Šobrīd šim uzdevumam jums ir pieejams neierobežots skaits žetonu.
ro: Acum, pentru aceasta sarcina, aveti un numar nelimitat de jetoane.
sl: Trenutno imaš na voljo neomejeno število žetonov za to nalogo.
th: ขณะนี้ คุณมีโทเค็นจำนวนไม่จำกัดสำหรับโจทย์นี้
uk: Зараз у вас є нескінченні токени для цієї задачі.
zh_cn: 现在，您拥有不限数量的 Token 可供使用于本题。
