Repository: cms-dev/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: ar, cs, es_cl, et, hu, ja, lv, ro, sl, th, uk, zh_cn

source: You don't have %(type_pl)s available for this task.
es_cl: No tienes %(type_pl)s disponibles para este problema.
et: Selle ülesande jaoks pole Teil ühtegi %(type_pl)sit.
hu: Nem áll rendelkezésedre %(type_pl)s ehhez a feladathoz.
ja: この課題に対して使用可能な%(type_pl)sはありません。
lv: Jums šim uzdevumam nav %(type_pl)s.
ro: Nu aveti %(type_pl)s disponibil pentru acesta sarcina.
sl: Nimaš %(type_pl)s dostopnih za to nalogo.
th: คุณไม่เหลือ %(type_pl)s สำหรับโจทย์ข้อนี้แล้ว
uk: У вас немає %(type_pl)s для цього завдання.

source: You have an infinite number of %(type_pl)s for this task.
es_cl: Tienes una cantidad infinita de %(type_pl)s para este problema.
et: Selle üleande jaoks on Teil lõpmata palju %(type_pl)seid.
hu: Végtelen %(type_pl)s áll rendelkezésedre ehhez a feladathoz.
ja: この課題では%(type_pl)sを無制限に使用できます。
lv: Šim uzdevumam jums ir bezgalīgi daudz %(type_pl)s.
ro: Aveti un numar infinit de %(type_pl)s pentru aceasta sarcina.
sl: Imaš neomejeno število %(type_pl)s za to nalogo.
th: คุณมี %(type_pl)s จำนวนไม่จำกัดสำหรับโจทย์นี้
uk: У вас є нескінченна кількість %(type_pl)s для цього завдання.

source: You start with no %(type_pl)s.
es_cl: Comienzas sin %(type_pl)s.
et: Teil ei ole alguses ühtegi %(type_pl)sit.
hu: Nem áll rendelkezésedre %(type_pl)s ehhez a feladathoz.
ja: %(type_pl)sがない状態から始まります。
lv: Sākumā jums nav %(type_pl)s.
ro: Incepeti fara %(type_pl)s.
sl: Začel si brez %(type_pl)s.
th: คุณเริ่มต้นด้วยไม่มี %(type_pl)s.
uk: Ви починаєте без %(type_pl)s.

source: You start with one %(type_s)s.
cs: %(type_pl)s k dispozici na začátku: %(gen_initial)d
es_cl: Comienzas con un %(type_s)s.
et: Teil on alguses üks %(type_s)s.
hu: Kezdetben egy %(type_s)s áll rendelkezésedre.
ja: 開始時に %(gen_initial)d 個の%(type_pl)sを使用可能です。
lv: Sākumā jums ir %(gen_initial)d %(type_s)s.
ro: Puteti incepe cu un %(type_s)s.
sl: Začneš z enim %(type_s)s.
th: คุณเริ่มต้นด้วย %(gen_initial)d %(type_pl)s.
uk: Ви починаєте з одного %(type_s)s.

source: Every minute
cs: Každou %(gen_interval)g minutu
es_cl: Cada minuto
et: Iga minut
hu: Minden percben
ja: %(gen_interval)g 分ごとに、
lv: Ik pēc %(gen_interval)g minūtes
ro: Fiecare minut
sl: Vsako minuto
th: ทุก %(gen_interval)g นาที
uk: Кожну хвилину

source: you get another %(type_s)s,
cs: dostanete další %(type_s),
es_cl: recibe otro %(type_s)s,
et: saate Te veel ühe %(type_s)si,
hu: kapsz egy %(type_s)st,
ja: 新たに %(gen_number)d 個の%(type_pl)sが追加されます。
lv: jums tiek piešķirts vēl %(gen_number)d %(type_s)s,
ro: obtineti inca %(type_s)s,
sl: dobiš dodaten %(type_s)s,
th: คุณได้ %(gen_number)d %(type_pl)s
uk: ви отримуєте інший %(type_s)s,

source: up to a maximum of one %(type_s)s.
cs: až do maximálního počtu 1 %(type_pl)s.
es_cl: hasta un máximo de un %(type_s)s.
et: kuni maksimaalselt ühe %(type_s)sini.
hu: amíg nem lesz összesen egy %(type_s)sod.
ja: ただし、同時に %(gen_max)d 個までしか保有できず、持ちきれなくなった%(type_pl)sは破棄されます。
lv: līdz ne vairāk kā %(gen_max)d %(type_s)s.
ro: pana la maxim un %(type_s)s.
sl: največ en %(type_s)s.
th: ได้สูงสุด %(gen_max)d%(type_pl)s
uk: до максимум одного %(type_s)s.

source: You don't get other %(type_pl)s.
es_cl: No recibes %(type_pl)s adicionales.
et: Te ei saa rohkem %(type_pl)seid.
hu: Nem kapsz további %(type_pl)sokat.
ja: これ以上%(type_pl)sが追加されることはありません。
lv: Jums netiek piešķirti %(type_pl)s.
ro: Nu puteti primi alte %(type_pl)s.
sl: Ne dobiš več novih %(type_pl)s.
th: คุณจะไม่ได้ %(type_pl)s ชนิดอื่น
uk: Ви не отримуєте інших %(type_pl)s.
zh_cn: 并不再产生新的 %(type_pl)s。

source: you get another %(type_s)s.
cs: dostanete další %(type_s)s.
es_cl: recibes otro %(type_s)s.
et: saate Te veel ühe %(type_s)si.
hu: kapsz egy %(type_s)st.
ja: 新たに %(gen_number)d 個の%(type_pl)sが追加されます。
lv: jums tiek piešķirts vēl %(gen_number)d %(type_s)s.
ro: obtineti inca %(type_s)s.
sl: dobiš dodaten %(type_s)s.
th: คุณได้ %(type_pl)s อีก %(gen_number)dอัน
uk: ви отримуєте інший %(type_s)s.

source: You can use a %(type_s)s every second
cs: Můžete použít %(type_s) každou vteřinu
es_cl: Puedes utilizar un %(type_s)s por segundo
et: Te võite kasutada ühe %(type_s)si iga sekundi järel,
hu: Minden másodpercben felhasználhatsz egy %(type_s)st
ja: あなたは %(min_interval)g 秒につき一回まで%(type_s)sを使うことができます。
lv: Katru %(min_interval)g sekundi jūs varat lietot %(type_s)s
ro: Puteti utiliza %(type_s)s o singura data pe secunda
sl: %(type_s)s lahko uporabiš vsako sekundo
th: คุณสามารถใช้%(type_s)sได้ทุก%(min_interval)gวินาที
uk: Ви можете використовувати %(type_s)s щосекунди

source: and no more than one %(type_s)s in total.
cs: a maximálně 1 %(type_s) celkem.
es_cl: y no más de un %(type_s)s en total.
et: kuid kokku maksimaalselt ühe korra.
hu: egészen addig, amíg összesen egy %(type_s)st fel nem használtál.
ja: ただし、合計で %(max_number)d 個までしか使うことはできません。
lv: un kopumā ne vairāk kā %(max_number)d %(type_s)s.
ro: si nu mai mult decat un/o %(type_s)s in total.
sl: in ne več kot %(max_number)d %(type_s)s skupno.
th: จะมี%(type_pl)sทั้งหมดไม่เกิน%(max_number)d
uk: і не більше одного %(type_s)s загалом.

source: You can use a %(type_s)s every second.
cs: Smíte použít %(type_s) každou vteřinu.
es_cl: Puedes utilizar un %(type_s)s por segundo.
et: Te võite kasutada ühe %(type_s)si iga sekundi järel.
hu: Minden másodpercben felhasználhatsz egy %(type_s)st.
ja: あなたは %(min_interval)g 秒につき一回まで%(type_s)sを使うことができます。
lv: Katru %(min_interval)g sekundi jūs varat lietot %(type_s)s.
ro: Puteti utiliza %(type_s)s o singura data pe secunda.
sl: %(type_s)s lahko uporabiš vsako sekundo.
th: คุณสามารถใช่%(type_s)sได้ทุก%(min_interval)gวินาที
uk: Ви можете використовувати %(type_s)s щосекунди.

source: You can use no more than one %(type_s)s in total.
cs: Počet použití %(type_s)s máte omezený na 1.
es_cl: No puedes utilizar más de un %(type_s)s en total.
et: Te võite kokku kasutada maksimaalselt ühe %(type_s)si.
hu: Maximum egy %(type_s)st használhatsz fel.
ja: あなたは%(type_pl)sを合計で %(max_number)d 個までしか使うことはできません。
lv: Kopumā jūs varat lietot ne vairāk kā %(max_number)d %(type_s)s.
ro: Nu puteti folosi mai mult decat un/o %(type_s)s in total.
sl: Uporabiš lahko največ %(max_number)d %(type_s)s.
th: คุณไม่สามารถใช้%(type_pl)sทั้งหมดได้เกิน%(max_number)d
uk: Загалом ви можете використовувати не більше одного %(type_s)s.

source: You have no limitations on how you use them.
cs: Nemáte žádná omezení na to, jak je použijete.
es_cl: No hay limitaciones en cuanto a su utilización.
et: Teil pole piiranguid nende kasutamise osas.
hu: Nincsenek korlátozások a zsetonok felhasználására vonatkozóan.
ja: %(type_pl)sを使う間隔や回数に制限はありません。
lv: Nav ierobežojumu kā tos izmantot.
ro: Nu aveti limite de utilizare a acestora.
sl: Ni omejitev za uporabo.
th: ไม่มีข้อจำกันในการใช้มัน
uk: Ви не маєте обмежень щодо того, як ви їх використовуєте.
zh_cn: 使用规则中没有其他额外的限制。

source: Too many print jobs!
cs: Příliš mnoho tiskových úloh!
es_cl: ¡Demasiados trabajos de impresión!
et: Liiga palju printmistöid!
ja: 印刷が多すぎます!
lv: Pārāk daudz drukas darbu!
sl: Preveč tiskalniških opravil!
th: สั่งพิมพ์เยอะเกินไป!
uk: Забагато завдань для друку!

source: You have reached the maximum limit of at most %d print jobs.
cs: Byl dosažený limit maximálně %d tiskoových úloh.
es_cl: Ha alcanzado el límite máximo de %d trabajos de impresión.
et: Teil ei ole lubatud rohkem kui %d printimistööd esitada.
ja: 印刷はひとりあたり最大 %d 回までです。
lv: Jūs esat sasniedzis maksimāli pieļaujamo drukas darbu ierobežojumu (%d darbs(i)).
sl: Dosegel(la) si največje število %d tiskanj.
th: คุณได้ถึงขีดจำกัดการพิมพ์ครบ %d ครั้งแล้ว
uk: Ви досягли максимальної кількості завдань для друку (%d).

source: Invalid format!
cs: Neplatný formát!
es_cl: ¡Formato inválido!
et: Vigane vorming!
hu: Érvénytelen formátum!
ja: 無効な形式です!
lv: Nepareizs formāts!
sl: Napačen format!
th: รูปแบบไม่ถูกต้อง!
uk: Недійсний формат!

source: Please select the correct files.
cs: Prosím vyberte správné soubory.
es_cl: Por favor seleccione los archivos correctos.
et: Palun valige õiged failid.
hu: Kérlek válaszd ki a megfelelő fájlokat.
ja: 正しいファイルを選択してください。
lv: Lūdzu, izvēlieties pareizās datnes.
ro: Va rugam alegeti fisierele corecte.
sl: Prosim izberi pravilne datoteke.
th: กรุณาเลือกไฟล์ที่ถูกต้อง
uk: Виберіть правильні файли.
zh_cn: 请选择正确的文件。

source: File too big!
ar: ملف ضخم جدًا!
cs: Příliš velký soubor!
es_cl: ¡El archivo es demasiado grande!
et: Fail on liiga suur!
hu: Túl nagy fájl!
ja: ファイルが大きすぎます!
lv: Datne pārāk liela!
sl: Datoteka je prevelika!
th: ไฟล์ใหญ่เกินไป!
uk: Файл завеликий!

source: Each file must be at most %d bytes long.
cs: Každý soubor smí být velký maximálně %d bytů.
es_cl: Cada archivo debe tener un tamaño de a lo sumo %d bytes.
et: Iga fail võib olla ülimalt %d baiti pikk.
hu: Minden fájl maximum %d bájt méretű lehet.
ja: 各ファイルは %d バイト以下である必要があります。
lv: Katras datnes izmērs nedrīkst pārsniegt %d baitus.
sl: Vsaka datoteka je lahko velika največ %d bajtov.
th: ไฟล์ใหญ่ได้สูงสุด %d ไบต์
uk: Довжина кожного файлу не повинна перевищувати %d байтів.

source: Print job storage failed!
cs: Nepodařilo se uložit tiskovou úlohu.
es_cl: ¡No se pudo almacenar el trabajo de impresión!
et: Printimistöö salvestamine ebaõnnestus!
ja: 印刷ジョブの保存に失敗しました!
lv: Drukas darbu glabātuvē ir radusies kļūme!
sl: Shranjevanje tiska ni uspelo!
th: งานพิมพ์จัดเก็บล้มเหลว!
uk: Не вдалося зберегти завдання для друку!

source: Please try again.
ar: فضلًا جرب مرة أخرى.
cs: Prosím zkuste to znovu.
es_cl: Por favor, intente nuevamente.
et: Palun proovige uuesti.
hu: Kérlek próbáld újra.
ja: もう一度試してください。
lv: Lūdzu, mēģiniet vēlreiz.
ro: Va rugam sa mai incercati o data.
sl: Prosim poizkusi znova.
th: กรุณาลองใหม่อีกครั้ง
uk: Будь ласка спробуйте ще раз.
zh_cn: 请再试一次。

source: Token request discarded
cs: Požadavek na token nesplněn.
es_cl: Pedido de token descartado
et: Pileti päring tühistatud
hu: Zseton kérelem elutasítva
ja: トークン使用要求は却下されました
lv: Žetona pieprasījums noraidīts
ro: Cererea de jeton a fost refuzata
sl: Žeton je opuščen
th: คำขอโทเค็นถูกยกเลิก
uk: Запит токена відхилено
zh_cn: Token 使用已拒绝

source: Your request has been discarded because you have no tokens available.
cs: Požadavek nebyl splněn, protože nemáte k dispozici žádné tokeny.
es_cl: Su pedido ha sido descartado porque no posee tokens disponibles.
et: Päring on tühistatud, kuna Teil pole ühtegi piletit.
hu: A kérelmed el lett utasítva, mert nincsenek zsetonjaid.
ja: 使用可能なトークンがないので、あなたの要求は却下されました。
lv: Jūsu pieprasījums ir noraidīts, jo jums nav žetonu.
ro: Cererea voastra a fost refuzata deoarece nu mai aveti jetoane ramase.
sl: Tvoja zahteva je bila zavžena, ker nimaš na voljo žetonov.
th: คำขอของคุณถูกยกเลิกเนื่องจากคุณไม่มีโทเค็นที่พร้อมใช้งาน
uk: Ваш запит відхилено, оскільки у вас немає доступних токенів.
zh_cn: 由于无可用 Token，使用已拒绝。

source: Your request has been discarded because you already used a token on that submission.
cs: Požadavek nebyl splněn, protože pro toto odevzdané řešení jste už token použili.
es_cl: Su pedido ha sido descartado porque ya ha utilizado un token sobre ese envío.
et: Päring on tühistatud, kuna selle jaoks on juba piletit kasutatud.
hu: A kérelmed el lett utasítva, mert már felhasználtál egy zseton erre a beküldésre.
ja: この提出には既にトークンが使用されているため、あなたの要求は却下されました。
lv: Jūsu pieprasījums ir noraidīts, jo jūs jau izmantojāt žetonu šim iesūtījumam.
ro: Cererea voastra a fost refuzata deoarece deja ati folosit un jeton pe acea expediere.
sl: Tvoja zahteva je bila zavržena, ker si pri tej oddaji že uporabil žeton.
th: คำขอของคุณถูกยกเลิกเนื่องจากคุณใช้โทเค็นในการส่งครั้งนั้นไปแล้ว
uk: Ваш запит відхилено, оскільки ви вже використали токен для цієї спроби.
zh_cn: 由于本次提交已使用过 Token，使用已拒绝。

source: Question received
ar: استقبلت سؤالًا
cs: Otázka přijata
es_cl: Pregunta recibida
et: Küsimus on vastu võetud
hu: Kérdés elküldve
ja: 質問を受理しました
lv: Jautājums saņemts
ro: Intrebarea a fost primita
sl: Vprašanje je bilo prejeto
th: ได้รับคำถามแล้ว
uk: Питання отримано
zh_cn: 已送出询问

source: Your question has been received, you will be notified when it is answered.
cs: Otázka byla přijata, budete upozorněni, až bude zodpovězena.
es_cl: Su pregunta ha sido recibida. Se le notificará cuando sea respondida.
et: Teie küsimus on vastu võetud. Teid teavitatakse, kui selle on vastatud.
hu: A kérdésed el lett küldve, értesítve leszel amint megválaszolásra kerül.
ja: あなたの質問を受理しました。回答があった場合は通知されます。
lv: Jūsu jautājums saņemts. Tiklīdz uz to būs atbildēts, jums tiks paziņots.
ro: Intrebarea ta a fost receptionata, veti fi notificat cand i se va raspunde.
sl: Tvoje vprašanje je bilo prejeto. O odgovoru boš obveščen(a)
th: ได้รับคำถามของคุณแล้ว, เราจะแจ้งเตือนคุณเมื่อได้รับคำตอบ
uk: Ваше запитання отримано, Ви отримаєте сповіщення, коли на нього дадуть відповідь.
zh_cn: 您的询问已成功送出, 待此询问得到回复后将会通知您。

source: Print job received
cs: Tisková úloha přijata
es_cl: Trabajo de impresión recibido
et: Printimistöö vastu võetud
ja: 印刷ジョブを受理しました
lv: Drukas darbs saņemts
sl: Tiskalniško opravilo je sprejeto
th: สั่งพิมพ์แล้ว
uk: Отримано завдання для друку

source: Your print job has been received.
cs: Vaše tisková úloha byla přijata.
es_cl: Su trabajo de impresión ha sido recibido.
et: Teie printimistöö on edukalt vastu võetud.
ja: あなたの印刷ジョブを受理しました。
lv: Jūsu drukas darbs saņemts.
sl: Tvoje tiskalniško opravilo je bilo sprejeto.
th: คุณได้สั่งพิมพ์แล้ว
uk: Ваше завдання для друку отримано.

source: Submission received
ar: التسليم استقبل
cs: Řešení přijato
es_cl: Envío recibido
et: Lahendus on vastu võetud
hu: Beküldés elküldve
ja: 提出を受理しました
lv: Iesūtījums saņemts
ro: Expediere cu succes
sl: Oddaja je sprejeta
th: ได้รับการส่งแล้ว
uk: Спробу отримано
zh_cn: 已收到本次提交

source: Your submission has been received and is currently being evaluated.
cs: Řešení bylo přijato a právě se vyhodnocuje.
es_cl: Su envío ha sido recibido, y se está evaluando en este momento.
et: Lahendus on vastu võetud ja hetkel testimisel.
hu: A beküldésed megérkezett, jelenleg kiértékelés alatt.
ja: あなたの提出を受理しました。提出ファイルの実行・評価が行われています。
lv: Jūsu iesūtījums ir saņemts un šobrīd tiek vērtēts.
ro: Programul a fost receptionat si se evalueaza.
sl: Tvoja oddaja je bila sprejeta in je v postopku vrednotenja.
th: ได้รับการส่งของคุณแล้วและตอนนี้กำลังประมวลผลอยู่
uk: Ваша спроба отримана та наразі оцінюється.
zh_cn: 已收到您的提交, 等待评测中。

source: Compiling...
cs: Kompilace...
es_cl: Compilando...
et: Kompileerimine...
hu: Fordítás...
ja: コンパイルしています…
lv: Kompilē…
ro: Compilare...
sl: Prevajam...
th: กำลังคอมไพล์...
uk: Компіляція...
zh_cn: 编译中...

source: Evaluating...
cs: Vyhodnocování...
es_cl: Evaluando...
et: Testimine...
hu: Kiértékelés...
ja: 実行・評価しています…
lv: Izpilda…
ro: Evaluare...
sl: Ovrednotenje poteka...
th: กำลังประเมินผล...
uk: Оцінювання...
zh_cn: 执行中...

source: Scoring...
cs: Přidělování bodů...
es_cl: Puntuando...
et: Punktide andmine...
hu: Pontozás...
ja: 得点を計算しています…
lv: Vērtē…
ro: Punctare...
sl: Točkujem...
th: กำลังคิดคะแนน...
uk: Бали...
zh_cn: 评分中...

source: Evaluated
cs: Vyhodnoceno
es_cl: Evaluado
et: Testitud
hu: Kiértékelve
ja: 実行・評価完了
lv: Izpildīts
ro: Evaluat
sl: Ovrednoteno
th: ประเมินผลแล้ว
uk: Оцінено
zh_cn: 已评测

source: status
cs: stav
es_cl: estado
et: Olek
hu: állapot
ro: statut
th: สถานะ
uk: статус

source: Your request has been received and applied to the submission.
cs: Váš požadavek byl použit na odevzdané řešení.
es_cl: Su pedido ha sido recibido y aplicado al envío.
et: Teie päring on vastu võetud ning rakendatud lahendusele.
ja: あなたの要求は受理され、トークンが提出に適用されました。
lv: Jūsu pieprasījums ir saņemts un pielietots iesūtījumam.
ro: Cererea voastra a fost receptionata si aplicata expedierii.
sl: Tvoja zahteva je bila sprejeta in je dodana k oddaji.
th: เราได้รับคำขอของคุณและใช้งานไปยังการส่งของคุณแล้ว
uk: Ваш запит отримано та застосовано до спроби.
zh_cn: 请查看本次提交的完整评测结果。

source: Token request received
cs: Obdržen požadavek o token
es_cl: Pedido de token recibido
et: Pileti päring vastu võetud
ja: トークン使用要求は受理されました
lv: Žetona pieprasījums saņemts
ro: Cererea voastra de jeton a fost receptionata
sl: Zahteva žetona je sprejeta
th: ได้รับคำขอโทเค็นแล้ว
uk: Отримано запит на токен
zh_cn: Token 使用成功

source: Test received
cs: Test přijat
es_cl: Test recibido
et: Test vastu võetud
hu: Teszt elküldve
ja: テスト要求を受理しました
lv: Tests saņemts
ro: Test receptionat
sl: Preizkus sprejet
th: ได้รับชุดทดสอบแล้ว
uk: Тест отримано
zh_cn: 已收到测试

source: Your test has been received and is currently being executed.
cs: Test byl přijatý a právě se provádí.
es_cl: Su test ha sido recibido, y se está ejecutando en este momento.
et: Test on vastu võetud ja seda joostakse hetkel.
hu: A teszt megérkezett, jelenleg végrehajtás alatt áll.
ja: あなたのテスト要求を受理しました。テストが実行されています。
lv: Jūsu tests ir saņemts un šobrīd tiek izpildīts.
ro: Testul vostru a fost receptionat si este in curs de executare.
sl: Tvoj preizkus je sprejet in se trenutno izvaja.
th: ได้รับการชุดทดสอบของคุณแล้วและตอนนี้กำลังประมวลผลอยู่
uk: Ваш тест отримано та зараз виконується.
zh_cn: 已收到您的测试，现在正在运行。

source: details
ar: التفاصيل
cs: detaily
es_cl: detalles
et: detailvaade
hu: részletek
ja: 詳細
lv: detaļas
ro: detalii
sl: podrobnosti
th: รายละเอียด
uk: деталі
zh_cn: 详细资料

source: Executing...
cs: Provádění...
es_cl: Ejecutando...
et: Testimine...
hu: Végrehajtás...
ja: 実行中…
lv: Izpilda…
ro: Se executa...
sl: Izvajam...
th: กำลังรัน...
uk: Виконання...
zh_cn: 执行中...

source: Executed
ar: نُفّذ
cs: Provedeno
es_cl: Ejecutado
et: Käivitatud
hu: Végrehajtva
ja: 実行完了
lv: Izpildīts
ro: Executat
sl: Izvedeno
th: รันแล้ว
uk: Виконано
zh_cn: 已评测

source: Too many submissions!
ar: كثرت تسليمات!
cs: Příliš mnoho odevzdaných řešení!
es_cl: ¡Demasiados envíos!
et: Liiga palju esitatud lahendusi!
hu: Túl sok beküldés!
ja: 提出が多すぎます!
lv: Pārāk daudz iesūtījumu!
ro: Prea multe expedieri!
sl: Preveč oddaj!
th: การส่งมากเกินไป!
uk: Забагато спроб!
zh_cn: 提交次数超出限制！

source: You have reached the maximum limit of at most %d submissions among all tasks.
cs: Byl dosažený limit maximálně %d odevzdání všech úloh dohromady.
es_cl: Has alcanzado el límite máximo de a lo sumo %d envíos entre todos los problemas.
et: Te olete ületanud lahenduste esitamise kogulimiidi (%d lahendust).
hu: Elérted az összes feladatra engedélyezett beküldések maximális számát (%d).
ja: すべての課題を通して、提出は合計で最大 %d 回までです。
lv: Jūs esat sasniedzis maksimāli pieļaujamo iesūtījumu skaitu pa visiem uzdevumiem (%d).
ro: Ati atins limita maxima de %d expedieri pentru toate sarcinile impreuna.
sl: Dosegel(la) si največje možno število %d oddaj za vse naloge.
th: สำหรับการแข่งขันนี้ คุณได้ส่งโปรแกรมครบ %d ครั้งแล้ว
uk: Ви досягли максимального ліміту (не більше ніж %d спроб) для всіх завдань.
zh_cn: 您在本竞赛的提交次数已达上限 %d 次。

source: You have reached the maximum limit of at most %d submissions on this task.
cs: Byl dosažený limit maximálně %d odevzdání této úlohy.
es_cl: Has alcanzado el límite máximo de a lo sumo %d envíos en este problema.
et: Te olete ületanud selle ülesande lahenduste esitamise limiidi (%d lahendust).
hu: Elérted az erre a feladatra engedélyezett beküldések maximális számát (%d).
ja: この課題に対する提出は最大 %d 回までです。
lv: Jūs esat sasniedzis maksimāli pieļaujamo iesūtījumu skaitu šim uzdevumam (%d).
ro: Ati atins limita maxima de %d expedieri pe aceasta sarcina.
sl: Dosegel(la) si največje število %d oddaj za to nalogo.
th: สำหรับโจทย์ข้อนี้ คุณได้ส่งโปรแกรมครบ %d ครั้งแล้ว
uk: Ви досягли максимального ліміту (не більше ніж %d спроб) для цього завдання.
zh_cn: 您在本题目的提交次数已达上限 %d 次。

source: Submissions too frequent!
ar: تسليماتك كثيرة في وقت قليل
cs: Příliš časté odevzdávání!
es_cl: ¡Envíos demasiado frecuentes!
et: Lahenduste esitamine on liiga sage!
hu: Túl gyakori beküldések!
ja: 提出間隔が短すぎます!
lv: Pārāk bieži iesūtījumi!
ro: Expedieri prea dese!
sl: Prepogosto oddajanje!
th: ส่งบ่อยเกินไป!
uk: Спроби надто часті!
zh_cn: 提交过于频繁！

source: Among all tasks, you can submit again after %d seconds from last submission.
cs: Řešení libovolné úlohy můžete znovu odevzdat po %d vteřinách od posledního odevzdání.
es_cl: Entre todos los problemas, puede realizar un envío nuevamente pasados %d segundos desde último envío.
et: Saate jälle uue lahenduse esitada (suvalisele ülesandele) %d sekundit pärast viimase lahenduse esitamist.
hu: Az összes feladatra vonatkoztatva az utolsó beküldésed után %d másodperccel tudsz újra beküldeni.
ja: 全課題を通して、最後の提出から %d 秒間は解答を提出することができません。
lv: Jebkura uzdevuma risinājumu jūs drīkstat iesūtīt %d sekundes pēc iepriekšējā iesūtījuma.
ro: Pentru toate sarcinile, puteti face trimiteri din nou dupa %d secunde de la ultima expediere.
sl: Nasednjo oddajo lahko opraviš %d sekund po zadnji oddaji.
th: สำหรับการแข่งขันนี้ คุณสามารถส่งได้ทุก ๆ %d วินาที
uk: Серед усіх завдань ви можете надіслати знову через %d секунд після останньої спроби.
zh_cn: 在本竞赛的最后一次提交过后 %d 秒始可再次提交。

source: For this task, you can submit again after %d seconds from last submission.
cs: Řešení této úlohy můžete znovu odevzdat po %d vteřinách od posledního odevzdání.
es_cl: En este problema, puede realizar un envío nuevamente pasados %d segundos desde último envío.
et: Saate sellele ülesandele uue lahenduse esitada %d sekundit pärast viimase lahenduse esitamist.
hu: Ennél a feladatnál az utolsó beküldésed után %d másodperccel tudsz újra beküldeni.
ja: この課題に関して、最後の提出から %d 秒間は解答を提出することができません。
lv: Šī uzdevuma risinājumu jūs drīkstat iesūtīt %d sekundes pēc iepriekšējā iesūtījuma.
ro: Pentru aceasta sarcina, puteti face trimitere din nou dupa %d secunde de la ultima expediere.
sl: Nasednjo oddajo za to nalogo lahko opraviš %d sekund po zadnji oddaji.
th: สำหรับโจทย์ข้อนี้ คุณสามารถส่งได้ทุกๆ %d วินาที
uk: Це завдання можна надіслати знову через %d секунд після останньої спроби.
zh_cn: 在本题的最后一次提交过后 %d 秒始可再次提交。

source: Invalid archive format!
cs: Neplatný formát archivu!
es_cl: ¡El formato del archivo comprimido es inválido!
et: Vigases vormingus arhiiv!
ja: 無効なアーカイブ形式です!
lv: Nepareizs arhīva formāts!
ro: Formatul pentru arhiva nu este valid!
sl: Napačna oblika arhiva!
th: ไฟล์ archive เสีย
uk: Невірний формат архіву!
zh_cn: 封装文件格式错误！

source: The submitted archive could not be opened.
cs: Odevzdaný archiv nemohl být otevřen.
es_cl: No se pudo abrir el archivo comprimido enviado.
et: Esitatud arhiivi ei õnnestunud avada.
hu: A beküldött tömörített állományt nem sikerült megnyitni.
ja: 提出されたアーカイブを開くことができませんでした。
lv: Iesūtīto arhīvu nav iespējams atvērt.
ro: Archiva expediata nu a putut fi deschisa.
sl: Ne morem odpreti oddanega arhiva.
th: ไฟล์ archive เปิดไม่ได้
uk: Не вдалося відкрити надісланий архів.
zh_cn: 封装文件无法正常开启。

source: Invalid submission format!
cs: Neplatný formát odevzdaného řešení!
es_cl: ¡El formato del envío es inválido!
et: Esitatud lahenduse vorming on vale!
ja: 無効な提出形式です!
lv: Nepareizs iesūtījuma formāts!
ro: Formatul expedierii nu este valid!
sl: Napačna oblika oddaje!
th: การส่งไม่ตรงตามรูปแบบที่กำหนดไว้
uk: Недійсний формат спроби!
zh_cn: 文件格式错误！

source: Submission too big!
ar: تسليم جدًا ضخم!
cs: Příliš velké odevzdané řešení!
es_cl: ¡Envío demasiado grande!
et: Esitatud lahendus on liiga suur!
hu: Túl nagy beküldés!
ja: 提出ファイルが大きすぎます!
lv: Iesūtījums pārāk liels!
ro: Fisierul expediat este prea mare!
sl: Prevelika oddaja!
th: ไฟล์ที่ส่งใหญ่เกินไป
uk: Спроба занадто велика!
zh_cn: 提交文件过大！

source: Each source file must be at most %d bytes long.
cs: Každý zdrojový soubor smí být maximálně %d bytů velký.
es_cl: Cada archivo de código fuente debe tener un tamaño de a lo sumo %d bytes.
et: Iga lähteteksti fail võib olla ülimalt %d baiti pikk.
hu: Minden forrásfájl maximum %d bájt méretű lehet.
ja: 各ソースファイルは %d バイト以下である必要があります。
lv: Katra izejas koda datne drīkst būt ne vairāk kā %d baitus liela.
ro: Niciun fisier sursa nu poate depasi lungimea de %d octeti.
sl: Vsaka izvorna datoteka je lahko velika največ %d bajtov.
th: ขนาดไฟล์แต่ละไฟล์ที่ส่งมาจะต้องมีขนาดไม่เกิน %d ไบท์
uk: Довжина кожного вихідного файлу не повинна перевищувати %d байтів.
zh_cn: 每个源文件长度不得超过 %d 字节。
